
const data_1 = [
// 11
    {
        title: "民族工作的根本要求是：坚定不移走中国特色解决民族问题的正确道路，坚持中国共产党的领导，坚持中国特色社会主义道路，坚持维护祖国统一，坚持各民族一律平等，坚持和完善民族区域自治制度。",
        options: ["A) 正确", "B) 错误"],
        answer: ["A"],
        flag: "单选题"
    },
// 12
    {
        title: "发现党员有思想、工作、生活、作风和纪律方面苗头性倾向性问题的，以及群众对其有不良反映的，党组织负责人应当及时进行提醒谈话，抓早抓小、防微杜渐。( )",
        options: ["A) 正确", "B) 错误"],
        answer: ["A"],
        flag: "单选题"
    },
// 13
    {
        title: "临时党支部主要组织党员开展政治学习，教育、管理、监督党员，对入党积极分子进行教育培养等，一般不发展党员、处分处置党员，不收缴党费，不选举党代表大会代表和进行换届。",
        options: ["A) 正确", "B) 错误"],
        answer: ["A"],
        flag: "单选题"
    },
// 14
    {
        title: "非公有制经济组织、社会组织，一般从管理层中选任党支部书记，应当注重从业务骨干中选拔党支部书记。",
        options: ["A) 正确", "B) 错误"],
        answer: ["A"],
        flag: "单选题"
    },
// 15
    {
        title: "抓党支部建设情况应当列入各级党委书记抓基层党建工作述职评议考核的重要内容，作为评判其履行管党治党政治责任情况的重要依据。",
        options: ["A) 正确", "B) 错误"],
        answer: ["A"],
        flag: "单选题"
    },
// 16
    {
        title: "企业、农村、机关、学校、科研院所、社区、社会组织、人民解放军和武警部队连（中）队以及其他基层单位，凡是有正式党员2人以上的，都应当成立党支部。",
        options: ["A) 正确", "B) 错误"],
        answer: ["B"],
        flag: "单选题"
    },
// 17
    {
        title: "为期3个月以上的工程、工作项目等，符合条件的，应当成立党支部。",
        options: ["A) 正确", "B) 错误"],
        answer: ["B"],
        flag: "单选题"
    },
// 18
    {
        title: "村、社区党支部书记纳入县级党委组织部备案管理。",
        options: ["A) 正确", "B) 错误"],
        answer: ["A"],
        flag: "单选题"
    },
// 19
    {
        title: "中央纪委国家监察机关主要负责党员纪律作风教育，指导开展党员监督，查处党员违犯党的纪律和职务违法、职务犯罪行为。( )",
        options: ["A) 正确", "B) 错误"],
        answer: ["B"],
        flag: "单选题"
    },
// 20
    {
        title: "中国共产党在领导社会主义事业中，必须坚持以从严治党为中心。",
        options: ["A) 正确", "B) 错误"],
        answer: ["B"],
        flag: "单选题"
    },
// 21
    {
        title: "社会主义初级阶段基本路线的中心是__________。",
        options: ["A) 改革开放", "B) 经济建设", "C) 保持社会稳定", "D) 坚持走社会主义道路"],
        answer: ["B"],
        flag: "单选题"
    },
// 22
    {
        title: "党的基层委员会、总支部委员会、支部委员会每届任期（）",
        options: ["A) 一年至两年", "B) 两年至三年", "C) 三年至四年", "D) 三年至五年"],
        answer: ["D"],
        flag: "单选题"
    },
// 23
    {
        title: "把用习近平新时代中国特色社会主义思想武装全党作为党员教育管理的( )，引导党员充分认识学习贯彻习近平新时代中国特色社会主义思想的重大意义，自觉学懂弄通做实。",
        options: ["A) 基本政治任务", "B) 首要政治任务", "C) 根本政治任务", "D) 主要政治任务"],
        answer: ["B"],
        flag: "单选题"
    },
// 24
    {
        title: "联合党支部覆盖单位一般不超过（ ）个。",
        options: ["A) 2", "B) 3", "C) 4", "D) 5"],
        answer: ["D"],
        flag: "单选题"
    },
// 25
    {
        title: "党员受到警告处分_______内，不得在党内提升职务和向党外组织推荐担任高于其原任职务的党外职务。",
        options: ["A) 六个月", "B) 一年", "C) 一年半", "D) 两年"],
        answer: ["B"],
        flag: "单选题"
    },
// 26
    {
        title: "新世纪新阶段统一战线具有空前的广泛性、巨大的包容性、鲜明的多样性和显著的（）",
        options: ["A) 政治性", "B) 时代性", "C) 复杂性", "D) 社会性"],
        answer: ["D"],
        flag: "单选题"
    },
// 27
    {
        title: "党员教育基本任务中，要突出( )和政治训练，严格党内政治生活锻炼，教育党员旗帜鲜明讲政治，提高政治觉悟和政治能力，严守政治纪律和政治规矩，永葆共产党人政治本色。",
        options: ["A) 政治修养", "B) 政治教育", "C) 政治素养", "D) 政治规划"],
        answer: ["B"],
        flag: "单选题"
    },
// 28
    {
        title: "我国根本的政治制度是__________。",
        options: ["A) 政治协商制度", "B) 人民代表大会制度", "C) 多党合作制度", "D) 民主集中制"],
        answer: ["B"],
        flag: "单选题"
    },
// 29
    {
        title: "（）是共产党人精神上的“钙”。",
        options: ["A) 理想信念", "B) 政治觉悟", "C) 世界观和方法论", "D) 文化追求"],
        answer: ["A"],
        flag: "单选题"
    },
// 30
    {
        title: "（）是党的基础组织，是党组织开展工作的基本单元，是党在社会基层组织中的战斗堡垒，是党的全部工作和战斗力的基础。",
        options: ["A) 党小组", "B) 党支部", "C) 党总支", "D) 党委"],
        answer: ["C"],
        flag: "单选题"
    },
// 31
    {
        title: "习近平总书记“七一”重要讲话指出，在坚持马克思主义指导地位这一根本问题上，我们必须坚定不移，任何时候任何情况下都不能有丝毫动摇。同时，面对新的时代特点和实践要求，马克思主义也面临着进一步中国化、时代化、（ ）的问题。",
        options: ["A) 特色化", "B) 具体化", "C) 大众化", "D) 科学化"],
        answer: ["C"],
        flag: "单选题"
    },
// 32
    {
        title: "党员如果没有正当理由，连续_______不交纳党费，就被认为是自行脱党。",
        options: ["A) 三个月", "B) 半年", "C) 一年", "D) 两年"],
        answer: ["B"],
        flag: "单选题"
    },
// 33
    {
        title: "党支部书记应当具备良好政治素质，在党员、群众中有较高威信，一般应当具有（）年以上党龄。",
        options: ["A) 半", "B) 一", "C) 二", "D) 三"],
        answer: ["B"],
        flag: "单选题"
    },
// 34
    {
        title: "党员必须坚持党和人民利益高于一切，吃苦在前，享受在后，_______，多做贡献。",
        options: ["A) 克己奉公", "B) 廉洁自律", "C) 艰苦奋斗", "D) 艰苦创业"],
        answer: ["A"],
        flag: "单选题"
    },
// 35
    {
        title: "坚持四项基本原则的核心是坚持__________。",
        options: ["A) 社会主义道路", "B) 人民民主专政", "C) 中国共产党的领导", "D) 马克思列宁主义毛泽东思想"],
        answer: ["C"],
        flag: "单选题"
    },
// 36
    {
        title: "坚持中国共产党在统一战线中的（ ）是统一战线最根本的问题。",
        options: ["A) 主导地位", "B) 领导权", "C) 发言权"],
        answer: ["A"],
        flag: "单选题"
    },
// 37
    {
        title: "统一战线工作的根本任务是______________，为实现党和国家的宏伟目标而团结奋斗。",
        options: ["A) 凝聚人心、汇聚力量", "B) 大团结、大联合", "C) 为社会主义的经济、政治、文化服务"],
        answer: ["C"],
        flag: "单选题"
    },
// 38
    {
        title: "各级党委主管统一战线工作的职能部门是（ ）。",
        options: ["A) 办公厅（室）", "B) 宣传部", "C) 统战部"],
        answer: ["C"],
        flag: "单选题"
    },
// 39
    {
        title: "中国共产党第十八次全国代表大会，是在我国进入（）小康社会决定性阶段召开的一次十分重要的大会",
        options: ["A) 全面建设", "B) 全面建成", "C) 全面建立"],
        answer: ["B"],
        flag: "单选题"
    },
// 40
    {
        title: "党的十八大报告强调，我们坚定不移高举中国特色社会主义伟大旗帜，既不走封闭僵化的老路、也不走（）的邪路。",
        options: ["A) 资本主义", "B) 改旗易帜", "C) 改弦更张"],
        answer: ["B"],
        flag: "单选题"
    },// 41
    {
        title: "对于全面从严治党，（）是党自我净化、自我完善、自我革新、自我提高的根本途径，（ ）则是实现改革发展目标的根本保证，增强从严治党的系统性、预见性、创造性、实效性，锻造我们事业更加坚强的领导核心。",
        options: ["A) 改革；", "B) 经济建设；", "C) 政治建设；", "D) 党的领导；"],
        answer: ["A", "D"],
        flag: "多选题"
    },
// 42
    {
        title: "中国共产党在新时期面临的三大历史任务为( )。",
        options: ["A) 发展生产力", "B) 推进现代化建设", "C) 完成祖国统一", "D) 维护世界和平与促进共同发展"],
        answer: ["B", "C", "D"],
        flag: "多选题"
    },
// 43
    {
        title: "违反有关规定等，对直接责任者和领导责任者，情节较轻的，给予警告或者严重警告处分;情节较重的，给予撤销党内职务或者留党察看处分;情节严重的，给予开除党籍处分。",
        options: ["A) 自定薪酬", "B) 滥发津贴", "C) 滥发补贴", "D) 滥发奖金"],
        answer: ["A", "B", "C", "D"],
        flag: "多选题"
    },
// 44
    {
        title: "健全人民当家作主制度体系，发展社会主义民主政治，必须要（）。",
        options: ["A) 坚持党的领导、人民当家作主、依法治国有机统一；", "B) 加强人民当家作主制度保障；", "C) 发挥社会主义协商民主重要作用；", "D) 简化机构和行政体制改革；"],
        answer: ["A", "B", "C"],
        flag: "多选题"
    },
// 45
    {
        title: "《中国共产党党员教育管理工作条例》的制定和实施，对于________,实现党伟大执政使命，具有十分重要的意义。",
        options: ["A) 提高党员队伍建设质量", "B) 激发党组织的生机活力", "C) 推动全面从严治党向纵深发展", "D) 夯实党长期执政基础"],
        answer: ["A", "B", "C", "D"],
        flag: "多选题"
    },
// 46
    {
        title: "党员应当主动学网用网，依托各类党员教育管理信息化平台，_______。",
        options: ["A) 积极参加在线学习培训", "B) 认真参加党组织的活动", "C) 做好教育培训、管理服务等工作", "D) 自觉接受党组织的教育管理"],
        answer: ["A", "B", "D"],
        flag: "多选题"
    },
// 47
    {
        title: "党员廉洁自律规范包括：",
        options: ["A) 坚持公私分明，先公后私，克己奉公", "B) 坚持崇廉拒腐，清白做人，干净做事", "C) 坚持尚俭戒奢，艰苦朴素，勤俭节约", "D) 坚持吃苦在前，享受在后，甘于奉献"],
        answer: ["A", "B", "C", "D"],
        flag: "多选题"
    },
// 48
    {
        title: "中国共产党要建设成为_______、_______、________马克思主义执政党。",
        options: ["A) 学习型", "B) 服务型", "C) 创新性", "D) 战斗型"],
        answer: ["A", "B", "C"],
        flag: "多选题"
    },
// 49
    {
        title: "党小组组长（ ）产生",
        options: ["A) 党支部指定", "B) 群众推荐", "C) 所在党小组党员推荐", "D) 毛遂自荐"],
        answer: ["A", "C"],
        flag: "多选题"
    },
// 50
    {
        title: "新形势下，党面临的危险包括：_____",
        options: ["A) 精神懈怠危险", "B) 能力不足危险", "C) 脱离群众危险", "D) 消极腐败危险"],
        answer: ["A", "B", "C", "D"],
        flag: "多选题"
    },
// 51
    {
        title: "《党章》第四条规定，党员享有八项权利，下列哪些属于党员享有的权利?",
        options: ["A) 参加党的有关会议，阅读党的有关文件，接受党的教育和培训", "B) 在党的会议上和党报党刊上，参加关于党的政策问题的讨论", "C) 对党的工作提出建议和倡议", "D) 行使表决权、选举权，有被选举权"],
        answer: ["A", "B", "C", "D"],
        flag: "多选题"
    },
// 52
    {
        title: "坚定文化自信，推动社会主义文化繁荣兴盛，要求我们党（）。",
        options: ["A) 放弃意识形态工作；", "B) 培育和践行社会主义核心价值观；", "C) 加强思想道德建设；", "D) 繁荣发展社会主义文艺；"],
        answer: ["B", "C", "D"],
        flag: "多选题"
    },
// 53
    {
        title: "党员要加强党性锻炼，不断提高政治觉悟和政治能力，把( )作为根本政治担当，永葆共产党人政治本色。",
        options: ["A) 对党忠诚；", "B) 为党分忧；", "C) 为党尽职；", "D) 为民造福；"],
        answer: ["A", "B", "C", "D"],
        flag: "多选题"
    },
// 54
    {
        title: "《党章》第三十一条规定，党的基层组织对要求入党的积极分子进行教育和培养，做好经常性的发展党员工作，重视在__中发展党员。",
        options: ["A) 生产第一线", "B) 先进工作者", "C) 工作第一线", "D) 青年"],
        answer: ["A", "C"],
        flag: "多选题"
    },
// 55
    {
        title: "基层党委履行抓党员教育管理的基本职责，推动落实上级党组织工作安排，组织做好党员集中培训、组织关系管理、_____________,纪律处分等工作，指导所辖党支部做好党员日常教育管理工作。( )",
        options: ["A) 表彰激励", "B) 关怀帮扶", "C) 指导督促", "D) 组织处置"],
        answer: ["A", "B", "D"],
        flag: "多选题"
    },
// 56
    {
        title: "党小组会一般每月召开1次，组织党员（ ）等。",
        options: ["A) 政治学习", "B) 谈心谈话", "C) 开展批评", "D) 自我批评"],
        answer: ["A", "B", "C", "D"],
        flag: "多选题"
    },
// 57
    {
        title: "对党员的纪律处分种类，包括",
        options: ["A) 警告", "B) 严重警告", "C) 撤销党内职务", "D) 留党察看"],
        answer: ["A", "B", "C", "D"],
        flag: "多选题"
    },
// 58
    {
        title: "中国共产党第十九次全国代表大会同意把（ ）一道写入党章",
        options: ["A) 中国特色社会主义道路", "B) 中国特色社会主义理论体系", "C) 中国特色社会主义制度", "D) 中国特色社会主义文化"],
        answer: ["A", "B", "C", "D"],
        flag: "多选题"
    },
// 59
    {
        title: "《党章》总纲中明确指出，中国共产党的性质是",
        options: ["A) 中国共产党是中国工人阶级的先锋队", "B) 是中国特色社会主义事业的领导核心", "C) 代表中国先进生产力的发展要求", "D) 代表中国先进文化的前进方向"],
        answer: ["A", "B", "C", "D"],
        flag: "多选题"
    },
// 60
    {
        title: "中国共产党必须不断提高党的创造力、凝聚力、战斗力，建设（）的马克思主义执政党。",
        options: ["A) 学习型；", "B) 努力型；", "C) 服务型；", "D) 创新型；"],
        answer: ["A", "C", "D"],
        flag: "多选题"
    }
]
const data_2 = [
// 11. 党员领导干部必须接受党内外群众的监督，普通党员则不必接受监督。
    {
        title: "党员领导干部必须接受党内外群众的监督，普通党员则不必接受监督。",
        options: ["A) 正确", "B) 错误"],
        answer: ["B"],
        flag: "单选题"
    },
// 12. 创新是引领发展的第一动力，是建设现代化经济体系的战略支撑。
    {
        title: "创新是引领发展的第一动力，是建设现代化经济体系的战略支撑。",
        options: ["A) 正确", "B) 错误"],
        answer: ["A"],
        flag: "单选题"
    },
// 13. 对组织关系不在本党支部的流动党员民主评议等情况，应当通报其组织关系所在党支部。
    {
        title: "对组织关系不在本党支部的流动党员民主评议等情况，应当通报其组织关系所在党支部。",
        options: ["A) 正确", "B) 错误"],
        answer: ["A"],
        flag: "单选题"
    },
// 14. 党支部每年至少召开1次组织生活会，也可以根据工作需要随时召开，一般以党员大会、党支部委员会会议或者党小组会形式进行。
    {
        title: "党支部每年至少召开1次组织生活会，也可以根据工作需要随时召开，一般以党员大会、党支部委员会会议或者党小组会形式进行。",
        options: ["A) 正确", "B) 错误"],
        answer: ["A"],
        flag: "单选题"
    },
// 15. 正式党员不足7人的党支部，设1名书记，必要时可以设1名副书记。
    {
        title: "正式党员不足7人的党支部，设1名书记，必要时可以设1名副书记。",
        options: ["A) 正确", "B) 错误"],
        answer: ["A"],
        flag: "单选题"
    },
// 16. 不忘本来才能开辟未来，善于继承才能更好创新。
    {
        title: "不忘本来才能开辟未来，善于继承才能更好创新。",
        options: ["A) 正确", "B) 错误"],
        answer: ["A"],
        flag: "单选题"
    },
// 17. 民主评议党员跟组织生活会必须分开进行。
    {
        title: "民主评议党员跟组织生活会必须分开进行。",
        options: ["A) 正确", "B) 错误"],
        answer: ["B"],
        flag: "单选题"
    },
// 18. 预备党员也可以作入党介绍人。
    {
        title: "预备党员也可以作入党介绍人。",
        options: ["A) 正确", "B) 错误"],
        answer: ["B"],
        flag: "单选题"
    },
// 19. 预备党员的预备期，从支部大会通过他为预备党员之日算起。
    {
        title: "预备党员的预备期，从支部大会通过他为预备党员之日算起。",
        options: ["A) 正确", "B) 错误"],
        answer: ["A"],
        flag: "单选题"
    },
// 20. 实现中华民族伟大复兴是近代以来中国是近代中华民族最伟大的梦想。
    {
        title: "实现中华民族伟大复兴是近代以来中国是近代中华民族最伟大的梦想。",
        options: ["A) 正确", "B) 错误"],
        answer: ["A"],
        flag: "单选题"
    },
// 21. 申请入党的人，要有____名正式党员作为介绍人。
    {
        title: "申请入党的人，要有____名正式党员作为介绍人。",
        options: ["A) 1", "B) 2", "C) 3", "D) 4"],
        answer: ["B"],
        flag: "单选题"
    },
// 22. 十八届六中全会认为党的十八大以来，党内政治生活展现新气象，为开创党和国家事业新局面提供了（）。
    {
        title: "十八届六中全会认为党的十八大以来，党内政治生活展现新气象，为开创党和国家事业新局面提供了（）。",
        options: ["A) 重要保障", "B) 重要保证", "C) 根本保证", "D) 力量源泉"],
        answer: ["B"],
        flag: "单选题"
    },
// 23. 高校党组织对组织关系保留在学校的高校毕业生流动党员，应当继续履行管理职责。党员组织关系保留时间一般不超过（ ）年，对符合转出组织关系条件的及时转出。
    {
        title: "高校党组织对组织关系保留在学校的高校毕业生流动党员，应当继续履行管理职责。党员组织关系保留时间一般不超过（ ）年，对符合转出组织关系条件的及时转出。",
        options: ["A) 半年", "B) 1", "C) 2", "D) 3"],
        answer: ["C"],
        flag: "单选题"
    },
// 24. 党的（）专题研究依法治国问题，并作出我们党历史上第一个关于加强法治建设的专门决定，开启了法治建设新时代。
    {
        title: "党的（）专题研究依法治国问题，并作出我们党历史上第一个关于加强法治建设的专门决定，开启了法治建设新时代。",
        options: ["A) 十五届四中全会", "B) 十六届四中全会", "C) 十七届四中全会", "D) 十八届四中全会"],
        answer: ["D"],
        flag: "单选题"
    },
// 25. 从全面建成小康社会到基本实现现代化，再到全面建成（ ），是新时代中国特色社会主义发展的战略安排。
    {
        title: "从全面建成小康社会到基本实现现代化，再到全面建成（ ），是新时代中国特色社会主义发展的战略安排。",
        options: ["A) 创新型国家", "B) 社会主义现代化强国", "C) 社会主义现代化大国", "D) 世界一流强国"],
        answer: ["B"],
        flag: "单选题"
    },
// 26. 党支部党员人数一般不超过（ ）人。
    {
        title: "党支部党员人数一般不超过（ ）人。",
        options: ["A) 30", "B) 40", "C) 50", "D) 60"],
        answer: ["C"],
        flag: "单选题"
    },
// 27. 对出国（境）学习研究党员，由原就读高校或者工作单位党组织保留其组织关系，每半年至少与其联系( )次。出国（境）学习研究党员返回后按照规定恢复组织生活。
    {
        title: "对出国（境）学习研究党员，由原就读高校或者工作单位党组织保留其组织关系，每半年至少与其联系( )次。出国（境）学习研究党员返回后按照规定恢复组织生活。",
        options: ["A) 1", "B) 2", "C) 3", "D) 4"],
        answer: ["A"],
        flag: "单选题"
    },
// 28. 我国根本的政治制度是__________。
    {
        title: "我国根本的政治制度是__________。",
        options: ["A) 政治协商制度", "B) 人民代表大会制度", "C) 多党合作制度", "D) 民主集中制"],
        answer: ["B"],
        flag: "单选题"
    },
// 29. 以下哪一项不是统一战线工作范围和对象（ ）
    {
        title: "以下哪一项不是统一战线工作范围和对象（ ）",
        options: ["A) 民主党派成员", "B) 少数民族人士", "C) 宗教界人士", "D) 外国友人"],
        answer: ["D"],
        flag: "单选题"
    },
// 30. 从（）到（），是“两个一百年”奋斗目标的历史交汇期。
    {
        title: "从（）到（），是“两个一百年”奋斗目标的历史交汇期。",
        options: ["A) 2020年 2035年", "B) 十九大 二十大", "C) 二十大 二十一大", "D) 2035年 本世纪中叶"],
        answer: ["B"],
        flag: "单选题"
    },
// 31. 建设中国特色社会主义，总布局是（）
    {
        title: "建设中国特色社会主义，总布局是（）",
        options: ["A) “四个全面”战略布局", "B) “五位一体”总体布局", "C) “一个中心、两个基本点”", "D) “三步走”发展战略"],
        answer: ["B"],
        flag: "单选题"
    },
// 32. 党的__________都无权剥夺党员的权利。
    {
        title: "党的__________都无权剥夺党员的权利。",
        options: ["A) 上级组织", "B) 党中央", "C) 任何一级组织直至中央", "D) 地方组织"],
        answer: ["C"],
        flag: "单选题"
    },
// 33. 掌握贯穿其中的( )立场观点方法，增强政治自觉、理论自信、情感融入。建立以学习贯彻习近平新时代 中国特色社会主义思想为中心内容的党员教育教材体系。
    {
        title: "掌握贯穿其中的( )立场观点方法，增强政治自觉、理论自信、情感融入。建立以学习贯彻习近平新时代 中国特色社会主义思想为中心内容的党员教育教材体系。",
        options: ["A) 三个代表", "B) 邓小平理论", "C) 马克思主义", "D) 科学发展观"],
        answer: ["C"],
        flag: "单选题"
    },
// 34. 十八届六中全会认为党要管党必须从（）管起。
    {
        title: "十八届六中全会认为党要管党必须从（）管起。",
        options: ["A) 党员领导干部", "B) 个人重大事项报告", "C) 党内政治生活", "D) 中央政治局委员"],
        answer: ["C"],
        flag: "单选题"
    },
// 35. 开展形势政策教育，围绕贯彻执行党和国家重大决策、推进落实重大任务，宣讲党的 路线方针政策，解读世情国情党情，回应党员关注的问题，引导党员正确认识形势， 把（ ）和行动统一到党中央要求上来。
    {
        title: "开展形势政策教育，围绕贯彻执行党和国家重大决策、推进落实重大任务，宣讲党的 路线方针政策，解读世情国情党情，回应党员关注的问题，引导党员正确认识形势， 把（ ）和行动统一到党中央要求上来。",
        options: ["A) 思想", "B) 修养", "C) 素质", "D) 内涵"],
        answer: ["A"],
        flag: "单选题"
    },
// 36. 中国共产党坚持独立自主的和平外交政策，坚持和平发展道路，坚持________的开 放战略，统筹________两个大局，积极发展对外关系。
    {
        title: "中国共产党坚持独立自主的和平外交政策，坚持和平发展道路，坚持________的开 放战略，统筹________两个大局，积极发展对外关系。",
        options: ["A) 互利共赢、国内国际", "B) 互惠互利、国内国际", "C) 互利共赢、内地外地"],
        answer: ["A"],
        flag: "单选题"
    },
// 37. 中国共产党坚持独立自主的和平外交政策，坚持和平发展道路，坚持________的开 放战略，统筹________两个大局，积极发展对外关系。
    {
        title: "中国共产党坚持独立自主的和平外交政策，坚持和平发展道路，坚持________的开 放战略，统筹________两个大局，积极发展对外关系。",
        options: ["A) 互利共赢、国内国际", "B) 互惠互利、国内国际", "C) 互利共赢、内地外地"],
        answer: ["A"],
        flag: "单选题"
    },
// 38. 坚持中国共产党在统一战线中的_________是统一战线最根本的问题。
    {
        title: "坚持中国共产党在统一战线中的_________是统一战线最根本的问题。",
        options: ["A) 主导地位", "B) 领导权", "C) 发言权"],
        answer: ["A"],
        flag: "单选题"
    },
// 39. 从2020年到本世纪中叶的第一阶段奋斗目标是：（）
    {
        title: "从2020年到本世纪中叶的第一阶段奋斗目标是：（）",
        options: ["A) 初步实现社会主义现代化", "B) 基本实现社会主义现代化", "C) 全面实现社会主义现代化"],
        answer: ["B"],
        flag: "单选题"
    },
// 40. 各级党委主管统一战线工作的职能部门是_________。
    {
        title: "各级党委主管统一战线工作的职能部门是_________。",
        options: ["A) 办公厅（室）", "B) 宣传部", "C) 统战部"],
        answer: ["C"],
        flag: "单选题"
    },
    // 41
    {
        title: "习近平新时代中国特色社会主义思想是对（）的继承和发展，是马克思主义中国化最新成果，是党和人民实践经验和集体智慧的结晶。",
        options: ["A) 马克思列宁主义；", "B) 毛泽东思想", "C) 邓小平理论；", "D) “三个代表”重要思想；"],
        answer: ["A", "B", "C", "D"],
        flag: "多选题"
    },
    // 42
    {
        title: "《党章》总纲中明确指出，中国共产党的性质是()",
        options: ["A) 中国共产党是中国工人阶级的先锋队", "B) 是中国特色社会主义事业的领导核心", "C) 代表中国先进生产力的发展要求", "D) 代表中国先进文化的前进方向"],
        answer: ["A", "B", "C", "D"],
        flag: "多选题"
    },
    // 43
    {
        title: "支持民主党派和无党派人士参政的主要内容是：（）。",
        options: ["A) 参加国家政权；", "B) 监督人民代表大会；", "C) 参与国家事务的管理；", "D) 参与国家方针政策、法律法规的制定和执行；"],
        answer: ["A", "C", "D"],
        flag: "多选题"
    },
    // 44
    {
        title: "对劝其退党、_____________的，原则上不能恢复党籍，符合条件的可以重新入党。",
        options: ["A) 劝而不退出名", "B) 自行脱党除名", "C) 退党除名", "D) 开除党籍"],
        answer: ["A", "B", "C", "D"],
        flag: "多选题"
    },
    // 45
    {
        title: "组织党员读原著、学原文、悟原理，深入学习领会习近平新时代中国特色社会主义思想的___________，掌握贯穿其中的马克思主义立场观点方法，增强政治自觉、理论自信、情感融入。",
        options: ["A) 基本理论", "B) 核心要义", "C) 基本精神", "D) 实践要求"],
        answer: ["B", "C", "D"],
        flag: "多选题"
    },
    // 46
    {
        title: "基层党组织应当加强流动党员管理，对外出6个月以上并且没有转移组织关系的流动党员，应当做好哪些工作？ ( )",
        options: ["A) 保持经常联系", "B) 组织其参加组织生活或者教育培训", "C) 跟进做好教育培训", "D) 管理服务"],
        answer: ["A", "C", "D"],
        flag: "多选题"
    },
    // 47
    {
        title: "预备党员的权利，除了没有以下哪些权利以外，也同正式党员一样：",
        options: ["A) 投票权", "B) 表决权", "C) 选举权", "D) 被选举权"],
        answer: ["B", "C", "D"],
        flag: "多选题"
    },
    // 48
    {
        title: "支持民主党派和无党派人士就经济社会发展重大问题进行考察调研，发挥其（）在方面的积极作用",
        options: ["A) 反映社情民意；", "B) 协调社会关系；", "C) 维护社会稳定；", "D) 维护宪法权威；"],
        answer: ["A", "B", "C"],
        flag: "多选题"
    },
    // 49
    {
        title: "我国成功走出了一条中国特色社会主义道路，实践证明我们的__、__、__是成功的。",
        options: ["A) 方针政策", "B) 道路", "C) 理论体系", "D) 制度"],
        answer: ["B", "C", "D"],
        flag: "多选题"
    },
    // 50
    {
        title: "对存在换届选举（ ）干扰渗透等问题的，上级党组织应当及时严肃处理。",
        options: ["A) 拉票贿选", "B) 宗族宗教", "C) 黑恶势力", "D) 任人唯亲"],
        answer: ["A", "B", "C"],
        flag: "多选题"
    },
    // 51
    {
        title: "党员具有下列情形之一的，按照规定程序给予除名处置。",
        options: ["A) 理想信念缺失，政治立场动摇，已经丧失党员条件的，予以除名；", "B) 信仰宗教，经党组织帮助教育仍没有转变的，劝其退党，劝而不退的予以除名；", "C) 因思想蜕化提出退党，经教育后仍然坚持退党的，予以除名；", "D) 为了达到个人目的以退党相要挟，经教育不改的，劝其退党，劝而不退的予以除名；"],
        answer: ["A", "B", "C", "D"],
        flag: "多选题"
    },
    // 52
    {
        title: "党员受到党纪处分后，不按照干部管理权限和组织关系对受处分党员开展日常__工作的，对直接责任者和领导责任者，情节较重的，给予警告或者严重警告处分;情节严重的，给予撤销党内职务或者留党察看处分。",
        options: ["A) 教育", "B) 管理", "C) 监督", "D) 培训"],
        answer: ["A", "B", "C"],
        flag: "多选题"
    },
    // 53
    {
        title: "加强对党外代表人士的管理，重点了解掌握其（），特别是在重大原则问题上的政治立场和态度。",
        options: ["A) 政治表现；", "B) 思想状况；", "C) 履行职责；", "D) 廉洁自律情况；"],
        answer: ["A", "B", "C", "D"],
        flag: "多选题"
    },
    // 54
    {
        title: "临时党支部（ ）由批准其成立的党组织指定。",
        options: ["A) 书记", "B) 副书记", "C) 委员", "D) 组长"],
        answer: ["A", "B", "C"],
        flag: "多选题"
    },
    // 55
    {
        title: "党员犯罪，有下列哪些情形的，应当给予开除党籍处分?",
        options: ["A) 被依法判处刑法规定的主刑(含宣告缓刑)的;", "B) 被单处或者附加剥夺政治权利的;", "C) 因过失犯罪，被依法判处三年以上(不含三年)有期徒刑的。", "D) 违纪情节轻微的"],
        answer: ["A", "B", "C"],
        flag: "多选题"
    },
    // 56
    {
        title: "党的全国代表大会的职权包括：",
        options: ["A) 听取和审查中央委员会的报告", "B) 审查中央纪律检查委员会的报告", "C) 讨论并决定党的重大问题", "D) 修改党的章程"],
        answer: ["A", "B", "C", "D"],
        flag: "多选题"
    },
    // 57
    {
        title: "______个人档案资料的，给予严重警告处分;情节严重的，给予撤销党内职务或者留党察看处分。",
        options: ["A) 篡改", "B) 伪造", "C) 报告", "D) 填写"],
        answer: ["A", "B"],
        flag: "多选题"
    },
    // 58
    {
        title: "党的四项基本原则是",
        options: ["A) 坚持社会主义道路", "B) 坚持人民民主专政", "C) 坚持中国共产党的领导", "D) 坚持马克思列宁主义毛泽东思想"],
        answer: ["A", "B", "C", "D"],
        flag: "多选题"
    },
    // 59
    {
        title: "中国特色社会主义文化是中国特色社会主义的（），是激励全党全国人民奋勇前进的（ ）",
        options: ["A) 重要组成部分", "B) 强大精神力量", "C) 基本理论", "D) 伟大支撑"],
        answer: ["A", "B"],
        flag: "多选题"
    },
    // 60
    {
        title: "中共十九大会的主题是（）。",
        options: ["A) 不忘初心，牢记使命；", "B) 高举中国特色社会主义伟大旗帜，决胜全面建成小康社会；", "C) 健全社会主义政治制度；", "D) 夺取新时代中国特色社会主义伟大胜利，为实现中华民族伟大复兴的中国梦不懈奋斗。"],
        answer: ["A", "B", "D"],
        flag: "多选题"
    },
    // 其他题目...
];
const data_3 = [
    // 11.
    {
        title: "党支部的成立，一般由基层单位提出申请，县委组织部召开会议研究决定并批复。",
        options: ["A) 正确", "B) 错误"],
        answer: ["B"],
        flag: "单选题"
    },
// 12.
    {
        title: "党支部委员之间、党支部委员和党员之间、党员和党员之间，每年谈心谈话一般不少于2次。",
        options: ["A) 正确", "B) 错误"],
        answer: ["B"],
        flag: "单选题"
    },
// 13.
    {
        title: "坚持党的领导,是党和国家的根本所在、命脉所在，是全国各族人民的利益所系、幸福所系",
        options: ["A) 正确", "B) 错误"],
        answer: ["A"],
        flag: "单选题"
    },
// 14.
    {
        title: "为了达到个人目的以退党相要挟，经教育不改的，劝其退党，劝而不退的予以除名。( )",
        options: ["A) 正确", "B) 错误"],
        answer: ["A"],
        flag: "单选题"
    },
// 15.
    {
        title: "党员没有无义务的权利，但有无权利的义务。",
        options: ["A) 正确", "B) 错误"],
        answer: ["B"],
        flag: "单选题"
    },
// 16.
    {
        title: "领导干部手中的权力是人民赋予的，只能用来为人民谋利益。",
        options: ["A) 正确", "B) 错误"],
        answer: ["A"],
        flag: "单选题"
    },
// 17.
    {
        title: "村、社区重要事项以及与群众利益密切相关的事项，必须经过党支部党员大会讨论。",
        options: ["A) 正确", "B) 错误"],
        answer: ["A"],
        flag: "单选题"
    },
// 18.
    {
        title: "经济体制改革必须以完善产权制度和要素市场化配置为重点，实现产权有效激励、要素自由流动、价格反应灵活、竞争公平有序、企业优胜劣汰。",
        options: ["A) 正确", "B) 错误"],
        answer: ["A"],
        flag: "单选题"
    },
// 19.
    {
        title: "对出国（境）学习研究党员，由原就读高校或者工作单位党组织保留其组织关系，每半年至少与其联系1次。出国（境）学习研究党员返回后按照规定恢复组织生活。( )",
        options: ["A) 正确", "B) 错误"],
        answer: ["A"],
        flag: "单选题"
    },
// 20.
    {
        title: "党组织应当教育引导党员严格规范网络行为，敢于同网上错误言论作斗争，不得制作、发布、传播违反党的纪律规定和国家法律法规的信息内容。( )",
        options: ["A) 正确", "B) 错误"],
        answer: ["A"],
        flag: "单选题"
    },
// 21.
    {
        title: "党章规定，申请入党的同志，必须年满_________岁。",
        options: ["A) 16", "B) 17", "C) 18", "D) 19"],
        answer: ["C"],
        flag: "单选题"
    },
// 22.
    {
        title: "党支部书记每年应当至少参加（ ）次县级以上党组织举办的集中轮训。",
        options: ["A) 1", "B) 2", "C) 3", "D) 4"],
        answer: ["A"],
        flag: "单选题"
    },
// 23.
    {
        title: "十八届六中全会认为办好中国的事情，关键在（）。",
        options: ["A) 企业", "B) 依法治国", "C) 党的建设", "D) 党"],
        answer: ["D"],
        flag: "单选题"
    },
// 24.
    {
        title: "预备党员必须面向_______进行入党宣誓。",
        options: ["A) 党支部所有成员", "B) 党旗", "C) 党徽", "D) 支部书记"],
        answer: ["B"],
        flag: "单选题"
    },
// 25.
    {
        title: "党组织讨论决定问题，必须执行_______原则。",
        options: ["A) 少数服从多数", "B) 成员服从领导", "C) 下级服从上级", "D) 个人服从集体"],
        answer: ["A"],
        flag: "单选题"
    },
// 26.
    {
        title: "村、社区党支部委员会每届任期5年，其他基层单位党支部委员会一般每届任期（）年。",
        options: ["A) 2", "B) 3", "C) 4", "D) 5"],
        answer: ["B"],
        flag: "单选题"
    },// 27
    {
        title: "坚持( )相结合，依托党员教育管理信息化平台，开展党员信息管理、党组织活动指导管理、流动党员管理服务、发展党员管理和党费管理等业务应用，为党员提供在线学习培训、转接组织关系、参与党内事务和关怀帮扶等服务。",
        options: ["A) 线上和线下", "B) 网上和网下", "C) 中央和地方", "D) 总体和局部"],
        answer: ["B"],
        flag: "单选题"
    },

// 28
    {
        title: "党小组会一般（ ）召开1次，组织党员参加政治学习、谈心谈话、开展批评和自我批评等。",
        options: ["A) 一周", "B) 一月", "C) 三分之二", "D) 全部"],
        answer: ["B"],
        flag: "单选题"
    },

// 29
    {
        title: "党的支部委员会对申请入党的人，要注意征求党内外有关群众的意见，进行严格的审查，认为合格后直接提交_______讨论。",
        options: ["A) 上级党委", "B) 党支部大会", "C) 支部委员会", "D) 支部书记"],
        answer: ["B"],
        flag: "单选题"
    },

// 30
    {
        title: "全面依法治国，（ ）在于坚持党领导立法、保证执法、支持司法、带头守法。",
        options: ["A) 核心", "B) 关键", "C) 重点", "D) 前提"],
        answer: ["B"],
        flag: "单选题"
    },

// 31
    {
        title: "中国共产党党徽为镰刀和_______组成的图案。",
        options: ["A) 斧头", "B) 火炬", "C) 五星", "D) 锤子"],
        answer: ["D"],
        flag: "单选题"
    },

// 32
    {
        title: "新时期爱国统一战线的主体和基础是（ ）",
        options: ["A) 大陆范围内建设者和爱国者的联盟", "B) 大陆范围内全体劳动者、建设者和爱国者的联盟", "C) 大陆同台湾同胞，港澳同胞和海外侨胞的联盟", "D) 大陆范围内全体劳动者同台湾同胞和海外侨胞的联盟"],
        answer: ["B"],
        flag: "单选题"
    },

// 33
    {
        title: "中国特色社会主义进入新时代，我国社会主要矛盾已经转化为人民日益增长的（ ）需要和（ ）的发展之间的矛盾。（ ）",
        options: ["A) 美好生活 不充分不平衡", "B) 幸福生活 不平衡不充分", "C) 幸福生活 不充分不平衡", "D) 美好生活 不平衡不充分"],
        answer: ["D"],
        flag: "单选题"
    },

// 34
    {
        title: "中国共产党第十九次全国代表大会，是在全面建成小康社会决胜阶段，中国特色社会主义进入_________的关键时期召开的一次十分重要的大会。",
        options: ["A) 新时期", "B) 新阶段", "C) 新征程", "D) 新时代"],
        answer: ["D"],
        flag: "单选题"
    },

// 35
    {
        title: "（ ）是中国共产党凝聚人心、汇聚力量的政治优势和战略方针，是夺取革命、建设、改革事业胜利的重要法宝。",
        options: ["A) 改革开放", "B) 实现共同富裕", "C) 统一战线", "D) 实现社会主义现代化"],
        answer: ["C"],
        flag: "单选题"
    },

// 36
    {
        title: "“全面建设小康社会”是指_______。",
        options: ["A) 人民生活总体上达到小康水平", "B) 全面建设惠及十几亿人口的更高水平的小康社会", "C) 让先富的部分人员和部分地区更加富裕"],
        answer: ["B"],
        flag: "单选题"
    },

// 37
    {
        title: "坚持物质文明和精神文明两手抓，实行依法治国和_______相结合。",
        options: ["A) 以德治国", "B) 科教兴国", "C) 实力建国"],
        answer: ["A"],
        flag: "单选题"
    },

// 38
    {
        title: "党员的党龄，从_______之日算起。",
        options: ["A) 从递交入党志愿书", "B) 支部大会通过其为预备党员", "C) 预备期满转为正式党员"],
        answer: ["C"],
        flag: "单选题"
    },

// 39
    {
        title: "在新世纪，（ ）作为党的一个重要法宝，绝不能丢掉；作为党的一个政治优势，绝不能削弱；作为党的一项长期方针，绝不能动摇。",
        options: ["A) 党的建设", "B) 统一战线", "C) 艰苦奋斗"],
        answer: ["B"],
        flag: "单选题"
    },

// 40
    {
        title: "坚持物质文明和精神文明两手抓，实行依法治国和_______相结合。",
        options: ["A) 以德治国", "B) 科教兴国", "C) 实力建国"],
        answer: ["A"],
        flag: "单选题"
    },
// 41
    {
        title: "党员教育管理信息化，要坚持网上和网下相结合，依托党员教育管理信息化平台，开展________发展党员管理和党费管理等业务应用，为党员提供在线学习培训、转接组织关系、参与党内事务和关怀帮扶等服务。",
        options: ["A) 党员信息管理", "B) 党组织活动指导管理", "C) 流动党员管理服务", "D) 党员教育管理网站"],
        answer: ["A", "B", "C"],
        flag: "多选题"
    },

// 42
    {
        title: "党组织在纪律审查中发现党员有贪污贿赂、失职渎职等刑法规定的行为涉嫌犯罪的，应当给予：",
        options: ["A) 撤销党内职务", "B) 留党察看", "C) 严重警告", "D) 开除党籍"],
        answer: ["A", "B", "D"],
        flag: "多选题"
    },

// 43
    {
        title: "牢牢掌握意识形态工作领导权，要在以下（）方面努力。",
        options: ["A) 推进马克思主义中国化时代化大众化", "B) 加强理论指导", "C) 加快构建中国特色哲学社会科学", "D) 高度重视传播手段建设和创新"],
        answer: ["A", "B", "C", "D"],
        flag: "多选题"
    },

// 44
    {
        title: "党的十八大以来，以习近平同志为核心的党中央在（）方面提出了一系列新理念新思想新方略。",
        options: ["A) 经济建设", "B) 政治建设", "C) 文化建设", "D) 社会建设"],
        answer: ["A", "B", "C", "D"],
        flag: "多选题"
    },

// 45
    {
        title: "党的纪律主要包括：",
        options: ["A) 政治纪律、组织纪律", "B) 廉洁纪律、群众纪律", "C) 工作纪律、生活纪律", "D) 作风纪律、学习纪律"],
        answer: ["A", "B", "C"],
        flag: "多选题"
    },

// 46
    {
        title: "党员在留党察看期间，没有以下哪些权利（）。",
        options: ["A) 表决权", "B) 言论自由权", "C) 选举权", "D) 被选举权"],
        answer: ["A", "C", "D"],
        flag: "多选题"
    },

// 47
    {
        title: "地方各级党委和部门单位党组（党委）领导本地区本部门本单位党员教育管理工作，贯彻执行党中央关于党员教育管理工作的方针政策和部署要求，_____________,有针对性地提出工作措施。 ( )",
        options: ["A) 定期研究党员教育管理工作", "B) 分析党员队伍状况", "C) 组织编写全国党员教育基本教材", "D) 组织安排党员教育讲师到基层授课"],
        answer: ["A", "B"],
        flag: "多选题"
    },

// 48
    {
        title: "加强党的宗旨教育，要引导党员___________，密切联系服务群众。( )",
        options: ["A) 践行全心全意为人民服务的根本宗旨", "B) 弘扬党的优良传统", "C) 贯彻党的群众路线", "D) 提高群众工作本领"],
        answer: ["A", "C", "D"],
        flag: "多选题"
    },

// 49
    {
        title: "全面建设小康社会的含义是（）。",
        options: ["A) 人均国内生产总值达到8000美元", "B) 国内生产总值到2020年力争比2000年翻两番。", "C) 社会主义民主和法制更加完善，人民的权益得到切实尊重和保障", "D) 全民族的整体素质明显提高"],
        answer: ["B", "C", "D"],
        flag: "多选题"
    },

// 50
    {
        title: "党的纪律主要包括政治纪律、（）、生活纪律。",
        options: ["A) 组织纪律", "B) 廉洁纪律", "C) 群众纪律", "D) 工作纪律"],
        answer: ["A", "B", "C", "D"],
        flag: "多选题"
    },

// 51
    {
        title: "《党章》第三十四条规定，党的各级领导干部要加强道德修养，做        到________，反对官僚主义，反对任何滥用职权、谋求私利的不正之风。",
        options: ["A) 自重", "B) 自省", "C) 自警", "D) 自励"],
        answer:
            ["A", "B", "C", "D"],
        flag:
            "多选题"
    },

// 52
    {
        title: "有下列情形之一的，可以从轻或者减轻处分（）",
        options:
            ["A) 主动交代本人应当受到党纪处分的问题", "B) 检举同案人或者其他人应当受到党纪处分或者法律追究的问题，经查证属实的", "C) 主动挽回损失、消除不良影响或者有效阻止危害结果发生的", "D) 主动上交违纪所得的"],
        answer:
            ["A", "B", "C", "D"],
        flag:
            "多选题"
    }
    ,

// 53
    {
        title: "习近平总书记在党的十九大报告提出了“四个伟大”，分别是指()",
        options:
            ["A) 伟大斗争", "B) 伟大工程", "C) 伟大事业", "D) 伟大梦想"],
        answer:
            ["A", "B", "C", "D"],
        flag:
            "多选题"
    }
    ,

// 54
    {
        title: "党组织在纪律审查中发现党员有贪污贿赂、失职渎职等刑法规定的行为涉嫌犯罪的，应当给予（）。",
        options:
            ["A) 撤销党内职务", "B) 留党察看", "C) 严重警告", "D) 开除党籍"],
        answer:
            ["A", "B", "D"],
        flag:
            "多选题"
    }
    ,

// 55
    {
        title: "坚持和发展中国特色社会主义总任务是（）和（）。",
        options:
            ["A) 进入社会主义中级阶段", "B) 实现社会主义现代化", "C) 中华民族伟大复兴", "D) 促进共同富裕"],
        answer:
            ["B", "C"],
        flag:
            "多选题"
    }
    ,

// 56
    {
        title: "发现党员有思想、工作、生活、作风和纪律方面苗头性倾向性问题的，以及群众对其有不良反映的，党组织负责人应当及时进行( )",
        options:
            ["A) 对劝其退党", "B) 提醒谈话", "C) 抓早抓小", "D) 防微杜渐"],
        answer:
            ["B", "C", "D"],
        flag:
            "多选题"
    }
    ,

// 57
    {
        title: "突出政治教育和政治训练，严格党内政治生活锻炼，教育党员旗帜鲜明讲政治，提高政治觉悟和政治能力，严守政治纪律和政治规矩，永葆共产党人政治本色，做到“四个服从”，在_____________,同以习近平同志为核心的党中央保持高度一致。",
        options:
            ["A) 思想上", "B) 政治上", "C) 生活上", "D) 行动上"],
        answer:
            ["A", "B", "D"],
        flag:
            "多选题"
    }
    ,

// 58
    {
        title: "下列哪些情形应当从重或者加重处分?",
        options:
            ["A) 在纪律集中整饬过程中，不收敛、不收手的", "B) 强迫、唆使他人违纪的", "C) 本条例另有规定的", "D) 如实坦白交代的"],
        answer:
            ["A", "B", "C"],
        flag:
            "多选题"
    }
    ,

// 59
    {
        title: "坚持全心全意为人民服务，必须坚持______。",
        options:
            ["A) 权为民所用", "B) 情为民所系", "C) 利为民所谋", "D) 心为民所系"],
        answer:
            ["A", "B", "C"],
        flag:
            "多选题"
    }
    ,

// 60
    {
        title: "正式党员不足3人的单位，应当按照（ ）的原则，成立联合党支部。",
        options:
            ["A) 地域相邻", "B) 行业相近", "C) 规模适当", "D) 便于管理"],
        answer:
            ["A", "B", "C", "D"],
        flag:
            "多选题"
    }
]
const data_4 = [
    {
        title: "任何党员不论职务高低，都不能个人决定重大问题。",
        options: ["A) 正确", "B) 错误"],
        answer: ["A"],
        flag: "单选题"
    },
// 12
    {
        title: "乡镇、街道、国有企业、高等学校等基层党委，按照规定配备一定数量的专兼职组织员，由县级以上党委组织部门进行业务指导和管理，承担指导督促发展党员和党员教育管理等工作。（ ）",
        options: ["A) 正确", "B) 错误"],
        answer: ["A"],
        flag: "单选题"
    },
// 13
    {
        title: "为执行某项任务临时组建的机构，党员组织关系不转接的，经上级党组织批准，可以成立临时党支部。",
        options: ["A) 正确", "B) 错误"],
        answer: ["A"],
        flag: "单选题"
    },
// 14
    {
        title: "文化是一个国家、一个民族的灵魂，文化自信是一个国家、一个民族发展中更基本、更深远、更持久的力量。",
        options: ["A) 正确", "B) 错误"],
        answer: ["A"],
        flag: "单选题"
    },
// 15
    {
        title: "坚持党的领导,是党和国家的根本所在、命脉所在，是全国各族人民的利益所系、幸福所系。",
        options: ["A) 正确", "B) 错误"],
        answer: ["A"],
        flag: "单选题"
    },
// 16
    {
        title: "必须树立和践行绿水青山就是金山银山的理念，坚持节约资源和保护环境的基本国策，统筹山水林田湖草系统治理，实行最严格的生态环境保护制度，形成绿色发展方式和生活方式。",
        options: ["A) 正确", "B) 错误"],
        answer: ["A"],
        flag: "单选题"
    },
// 17
    {
        title: "党小组组长由党支部指定，也可以由所在党小组党员推荐产生。",
        options: ["A) 正确", "B) 错误"],
        answer: ["A"],
        flag: "单选题"
    },
// 18
    {
        title: "党员领导干部应当定期为基层党员讲党课，党委（党组）书记每年至少讲1次党课。",
        options: ["A) 正确", "B) 错误"],
        answer: ["A"],
        flag: "单选题"
    },
// 19
    {
        title: "党的各级委员会实行集体领导和个人分工负责相结合的制度。凡属重大问题都要由党的委员会民主讨论，作出决定。",
        options: ["A) 正确", "B) 错误"],
        answer: ["A"],
        flag: "单选题"
    },
// 20
    {
        title: "我国仍处于并将长期处于社会主义初级阶段的基本国情没有变，我国是世界最大发展中国家的国际地位没有变。",
        options: ["A) 正确", "B) 错误"],
        answer: ["A"],
        flag: "单选题"
    },
// 21
    {
        title: "《中国共产党党员教育管理工作条例》自2019年5月6日起施行。",
        options: ["A) 2019年4月5日", "B) 2019年5月6日", "C) 2019年5月7日", "D) 2019年6月5日"],
        answer: ["B"],
        flag: "单选题"
    },
// 22
    {
        title: "统一战线是中国共产党凝聚人心、汇聚力量的政治优势和战略方针，是夺取革命、建设、改革事业胜利的重要法宝。",
        options: ["A) 改革开放", "B) 实现共同富裕", "C) 统一战线", "D) 实现社会主义现代化"],
        answer: ["C"],
        flag: "单选题"
    },
// 23
    {
        title: "发展是我们党执政兴国的第一要务。",
        options: ["A) 发展", "B) 改革", "C) 反腐", "D) 革命"],
        answer: ["A"],
        flag: "单选题"
    },
// 24
    {
        title: "党员教育基本任务要进行革命传统教育，引导党员学习党史、国史、改革开放史、社会主义发展史和中华优秀传统文化，铭记党的奋斗历程，弘扬党的优良传统，传承( )，践行共产党人价值观，激发爱国主义热情。",
        options: ["A) 蓝色基因", "B) 橙色基因", "C) 红色基因", "D) 黄色基因"],
        answer: ["C"],
        flag: "单选题"
    },
// 25
    {
        title: "各级党委留存的党费主要用于教育培训党员、支持基层党组织开展组织生活。加强对革命老区、民族地区、边疆地区、贫困地区党员教育管理工作经费支持。",
        options: ["A) 西部地区", "B) 北部地区", "C) 革命老区", "D) 集中地区"],
        answer: ["C"],
        flag: "单选题"
    },
// 26
    {
        title: "乡镇、街道、国有企业、高等学校等基层党委，按照规定配备一定数量的专兼职组织员，由县级以上党委组织部门进行业务指导和管理，承担指导督促发展党员和党员教育管理等工作。",
        options: ["A) 省", "B) 自治区", "C) 直辖市", "D) 县级以上"],
        answer: ["D"],
        flag: "单选题"
    },
// 27
    {
        title: "我国“四个全面”战略布局中不包括：_____",
        options: ["A) 全面建成小康社会", "B) 全面改革开放", "C) 全面依法治国", "D) 全面从严治党"],
        answer: ["B"],
        flag: "单选题"
    },
// 28
    {
        title: "党的中央委员会每届任期5年。",
        options: ["A) 2", "B) 3", "C) 4", "D) 5"],
        answer: ["D"],
        flag: "单选题"
    },
// 29
    {
        title: "坚持四项基本原则的核心是坚持社会主义道路。",
        options: ["A) 社会主义道路", "B) 人民民主专政", "C) 中国共产党的领导", "D) 马克思列宁主义毛泽东思想"],
        answer: ["A"],
        flag: "单选题"
    },
// 30
    {
        title: "党的十六大以来，以习近平同志为核心的党中央高度重视加强党员教育管理工作，推动形成全党从严从实抓党员教育管理的良好态势。",
        options: ["A) 十六大", "B) 十七大", "C) 十八大", "D) 十九大"],
        answer: ["A"],
        flag: "单选题"
    },
// 31
    {
        title: "党支部党员大会议题提交表决前，应当经过充分讨论。表决必须有（）以上有表决权的党员到会方可进行，赞成人数超过应到会有表决权的党员的（）为通过。",
        options: ["A) 三分之一", "B) 半数", "C) 三分之二", "D) 五分之一"],
        answer: ["A"],
        flag: "单选题"
    },
// 32
    {
        title: "申请入党的人，要有（）名正式党员作为介绍人",
        options: ["A) 1", "B) 2", "C) 3", "D) 4"],
        answer: ["B"],
        flag: "单选题"
    },
// 33
    {
        title: "“十三五”时期，我国经济发展的显著特征就是进入（ ）。",
        options: ["A) 新阶段", "B) 新形态", "C) 新常态", "D) 新业态"],
        answer: ["C"],
        flag: "单选题"
    },
// 34
    {
        title: "有正式党员（ ）人以上的党支部，应当设立党支部委员会。",
        options: ["A) 4", "B) 5", "C) 6", "D) 7"],
        answer: ["D"],
        flag: "单选题"
    },
// 35
    {
        title: "凡是有正式党员（ ）人以上的，都应当成立党支部。",
        options: ["A) 2", "B) 3", "C) 4", "D) 5"],
        answer: ["B"],
        flag: "单选题"
    },
// 36
    {
        title: "以下那一项不是十九大的大会主题__________",
        options: ["A) 不忘初心，牢记使命", "B) 高举中国特色社会主义伟大旗帜", "C) 全面深化改革开放"],
        answer: ["C"],
        flag: "单选题"
    },
// 37
    {
        title: "中国共产党坚持独立自主的和平外交政策，坚持和平发展道路，坚持________的开放战略，统筹________两个大局，积极发展对外关系。",
        options: ["A) 互利共赢、国内国际", "B) 互惠互利、国内国际"],
        answer: ["A"],
        flag: "单选题"
    },
// 38
    {
        title: "党的十八大报告强调，全党必须更加自觉地把推动经济社会发展作为深入贯彻落实科学发展观的（ ）",
        options: ["A) 根本方法", "B) 核心立场", "C) 第一要义"],
        answer: ["C"],
        flag: "单选题"
    },
// 39
    {
        title: "党员的党龄，从_______之日算起。",
        options: ["A) 从递交入党志愿书", "B) 支部大会通过其为预备党员", "C) 预备期满转为正式党员"],
        answer: ["C"],
        flag: "单选题"
    },
// 40
    {
        title: "统一战线工作的根本任务是（ ），为实现党和国家的宏伟目标而团结奋斗。",
        options: ["A) 凝聚人心、汇聚力量", "B) 大团结、大联合", "C) 为社会主义的经济、政治、文化服务"],
        answer: ["A"],
        flag: "单选题"
    },
// 41
    {
        title: "流动党员较多，工作地或者居住地相对固定集中，应当由流出地党组织商流入地党组织，依托（）等成立流动党员党支部。",
        options: ["A) 社区", "B) 园区", "C) 商会", "D) 协会"],
        answer: ["B", "C", "D"],
        flag: "多选题"
    },
// 42
    {
        title: "党的建设必须坚决实现的基本要求包括：______",
        options: ["A) 坚持党的基本路线", "B) 坚持解放思想，实事求是，与时俱进，求真务实", "C) 坚持全心全意为人民服务", "D) 坚持民主集中制"],
        answer: ["A", "B", "C", "D"],
        flag: "多选题"
    },
// 43
    {
        title: "_______________是中国特色社会主义理论体系的精髓。",
        options: ["A) 解放思想", "B) 实事求是", "C) 与时俱进", "D) 求真务实"],
        answer: ["A", "B", "C", "D"],
        flag: "多选题"
    },
// 44
    {
        title: "党支部应当严格执行党的组织生活制度，经常、认真、严肃地开展批评和自我批评，增强党内政治生活的（ ）。",
        options: ["A) 政治性", "B) 时代性", "C) 原则性", "D) 战斗性"],
        answer: ["A", "B", "C", "D"],
        flag: "多选题"
    },
// 45
    {
        title: "党员享有下列哪些权利：",
        options: ["A) 参加党的会议", "B) 对党的工作提出建议和倡议", "C) 行使表决权、选举权，有被选举权", "D) 自觉遵守党的纪律"],
        answer: ["A", "B", "C"],
        flag: "多选题"
    },
// 46
    {
        title: "中国共产党要领导全国各族人民实现“两个一百年”奋斗目标，“两个一百年”指的是：______。",
        options: ["A) 抗日战争胜利一百年", "B) 建党一百年", "C) 新中国成立一百年", "D) 改革开放一百年"],
        answer: ["B", "C"],
        flag: "单选题"
    },
// 47
    {
        title: "党员在留党察看期间，没有以下哪些权利：",
        options: ["A) 表决权", "B) 言论自由权", "C) 选举权", "D) 被选举权"],
        answer: ["A", "C", "D"],
        flag: "单选题"
    },
// 48
    {
        title: "县级以上党委管理的党费每年应当按照一定比例下拨到党支部，重点支持（）等开展党的活动。",
        options: ["A) 贫困村党支部", "B) 困难国有企业党支部", "C) 非公有制经济组织和社会组织党支部", "D) 流动党员党支部"],
        answer: ["A", "B", "C", "D"],
        flag: "单选题"
    },
// 49
    {
        title: "临时党支部主要组织党员开展政治学习，（）党员，对入党积极分子进行教育培养等。",
        options: ["A) 教育", "B) 管理", "C) 监督", "D) 培养"],
        answer: ["A", "B", "C"],
        flag: "单选题"
    },
// 50
    {
        title: "党支部应当组织党员按期参加（ ）",
        options: ["A) 党员大会", "B) 党小组会", "C) 党员培训", "D) 上党课"],
        answer: ["A", "B", "D"],
        flag: "单选题"
    },
// 51
    {
        title: "注重知识技能教育，根据党员岗位职责要求和工作需要，组织引导党员学习_______ _____等，帮助党员提高综合素质和履职能力，增强服务本领。( )",
        options: ["A) 党的创新理论", "B) 掌握业务知识", "C) 科技知识", "D) 实用技术"],
        answer: ["B", "C", "D"],
        flag: "单选题"
    },
// 52
    {
        title: "全党同志要高举中国特色社会主义伟大旗帜，坚定（），贯彻党的基本理论、基本路线、基本方略",
        options: ["A) 道路自信", "B) 政治自信", "C) 理论自信", "D) 文化自信"],
        answer: ["A", "C", "D"],
        flag: "单选题"
    },
// 53
    {
        title: "有下列情形之一的，可以从轻或者减轻处分：",
        options: ["A) 主动交代本人应当受到党纪处分的问题", "B) 检举同案人或者其他人应当受到党纪处分或者法律追究的问题，经查证属实的", "C) 主动挽回损失、消除不良影响或者有效阻止危害结果发生的", "D) 主动上交违纪所得的"],
        answer: ["A", "B", "C", "D"],
        flag: "多选题"
    },
// 54
    {
        title: "文化软实力集中体现了一个国家基于文化而具有的___和___。",
        options: ["A) 创造力", "B) 软实力", "C) 凝聚力", "D) 生命力"],
        answer: ["C", "D"],
        flag: "多选题"
    },
// 55
    {
        title: "党的四项基本原则是",
        options: ["A) 坚持社会主义道路", "B) 坚持人民民主专政", "C) 坚持中国共产党的领导", "D) 坚持马克思列宁主义毛泽东思想"],
        answer: ["A", "B", "C", "D"],
        flag: "多选题"
    },
// 56
    {
        title: "以下哪些是构成新时代坚持和发展中国特色社会主义的基本方略",
        options: ["A) 坚持党对一切工作的领导。", "B) 坚持以人民为中心；", "C) 坚持全面深化改革。", "D) 坚持在社会主义核心价值体系；"],
        answer: ["A", "B", "C", "D"],
        flag: "多选题"
    },
// 57
    {
        title: "党的纪律处分工作应当坚持以下原则：",
        options: ["A) 党要管党，从严治党", "B) 党纪面前一律平等", "C) 实事求是", "D) 民主集中制"],
        answer: ["A", "B", "C", "D"],
        flag: "多选题"
    },
// 58
    {
        title: "要适应改革开放和社会主义现代化建设的要求，坚持________，加强和改善党的领导。",
        options: ["A) 科学执政", "B) 民主执政", "C) 依法执政", "D) 从严执政"],
        answer: ["A", "B", "C"],
        flag: "多选题"
    },
// 59
    {
        title: "加强政治理论教育，突出党的创新理论学习，组织党员学习党的基本理论、_____、基本方略，_______，引导党员坚定理想信念，增强党性修养，努力掌握并自觉运用马克思主义立场观点方法。",
        options: ["A) 基本思想", "B) 基本路线", "C) 强化党章党规党纪教育", "D) 学习马克思主义基本原理和党的基本知识"],
        answer: ["B", "D"],
        flag: "多选题"
    },
// 60
    {
        title: "党员廉洁自律规范包括（）。",
        options: ["A) 坚持公私分明，先公后私，克己奉公", "B) 坚持崇廉拒腐，清白做人，干净做事", "C) 坚持尚俭戒奢，艰苦朴素，勤俭节约", "D) 坚持吃苦在前，享受在后，甘于奉献"],
        answer: ["A", "B", "C", "D"],
        flag: "多选题"
    }
]
const data_5 = [
    // 11
    {
        title: "党支部应该每半年开展1次主题党日。（ ）",
        options: ["A) 正确", "B) 错误"],
        answer: ["B"],
        flag: "单选题"
    },
// 12
    {
        title: "党支部书记、副书记一般由党支部党员大会选举产生。",
        options: ["A) 正确", "B) 错误"],
        answer: ["B"],
        flag: "单选题"
    },
// 13
    {
        title: "党支部是党的基层组织，担负直接教育党员、管理党员、监督党员和组织群众、宣传群众、凝聚群众、服务群众的职责。",
        options: ["A) 正确", "B) 错误"],
        answer: ["A"],
        flag: "单选题"
    },
// 14
    {
        title: "农业农村农民问题是关系国计民生的根本性问题，必须始终把解决好'三农'问题作为全党工作重中之重。",
        options: ["A) 正确", "B) 错误"],
        answer: ["A"],
        flag: "单选题"
    },
// 15
    {
        title: "党员教育管理是党的建设基础性经常性工作。（ ）",
        options: ["A) 正确", "B) 错误"],
        answer: ["A"],
        flag: "单选题"
    },
// 16
    {
        title: "坚持党的领导是人民当家作主和依法治国有机统一的根本保证，人民当家作主是社会主义民主政治的本质特征，依法治国是党领导人民治理国家的基本方式，三者统一于我国社会主义民主政治伟大实践",
        options: ["A) 正确", "B) 错误"],
        answer: ["A"],
        flag: "单选题"
    },
// 17
    {
        title: "党员的党龄，从预备期满转为正式党员之日算起。",
        options: ["A) 正确", "B) 错误"],
        answer: ["A"],
        flag: "单选题"
    },
// 18
    {
        title: "党的十八大将生态文明建设写入党章并作出阐述，使中国特色社会主义事业总体布局更加完善，有利于全面推进中国特色社会事业。",
        options: ["A) 正确", "B) 错误"],
        answer: ["A"],
        flag: "单选题"
    },
// 19
    {
        title: "党的十九届一中全会选举习近平、李克强、栗战书、汪洋、王沪宁、赵乐际、韩正为中央政治局常委。",
        options: ["A) 正确", "B) 错误"],
        answer: ["A"],
        flag: "单选题"
    },
// 20
    {
        title: "党的最高领导机关是党的全国代表大会和它所产生的中央委员会。",
        options: ["A) 正确", "B) 错误"],
        answer: ["A"],
        flag: "单选题"
    },
// 21
    {
        title: "党员教育基本任务要求，要加强党的宗旨教育，引导党员践行( )的根本宗旨，贯彻党的群众路线，提高群众工作本领，密切联系服务群众。",
        options: [
            "A) 维护最广大人民的根本利益",
            "B) 与群众保持密切联系",
            "C) 一切为了群众,一切依靠群众",
            "D) 全心全意为人民服务"
        ],
        answer: ["D"],
        flag: "单选题"
    },
// 22
    {
        title: "基层党委履行抓党员教育管理的基本职责，推动落实上级党组织工作安排，组织做好党员（ ）、组织关系管理、表彰激励、关怀帮扶、组织处置、纪律处分等工作，指导所辖党支部做好党员日常教育管理工作。",
        options: ["A) 集中培训", "B) 学习培训", "C) 参与党内事务", "D) 教育管理"],
        answer: ["A"],
        flag: "单选题"
    },
// 23
    {
        title: "党员工作单位、经常居住地发生变动的，或者外出学习、工作、生活_____以上并且地点相对固定的，应该转移组织关系。",
        options: ["A) 1个月", "B) 3个月", "C) 6个月", "D) 1年"],
        answer: ["C"],
        flag: "单选题"
    },
// 24
    {
        title: "实现中华民族伟大复兴，就是中华民族近代以来最伟大的梦想，其本质是国家富强、民族振兴、（）",
        options: ["A) 人民幸福", "B) 共同富裕", "C) 全面小康", "D) 人民富裕"],
// 继续 24
        answer: ["A"],
        flag: "单选题"
    },
// 25
    {
        title: "强化党内监督的核心是( )。",
        options: [
            "A) 坚持思想建党与制度治党相结合",
            "B) 坚持民主集中制",
            "C) 坚持党要管党、从严治党",
            "D) 坚持强化巡视监督"
        ],
        answer: ["B"],
        flag: "单选题"
    },
// 26
    {
        title: "我们党作为执政党，面临的最大威胁就是（）",
        options: ["A) 脱离群众", "B) 能力不足", "C) 精神懈怠", "D) 腐败"],
        answer: ["D"],
        flag: "单选题"
    },
// 27
    {
        title: "目前使用的党章是________通过的。",
        options: [
            "A) 2012年11月14日",
            "B) 2017年1月1日",
            "C) 2017年10月18日",
            "D) 2017年10月24日"
        ],
        answer: ["D"],
        flag: "单选题"
    },
// 28
    {
        title: "根据（ ）和有关党内法规，制定《中国共产党支部工作条例（试行）》。",
        options: ["A) 宪法", "B) 中国共产党章程", "C) 中国纪律处分条例", "D) 制度"],
        answer: ["B"],
        flag: "单选题"
    },
// 29
    {
        title: "十九大报告提出，新时代中国特色社会主义思想的总任务是（ ）",
        options: [
            "A) 全面建成小康社会",
            "B) 实现社会主义现代化和中华民族伟大复兴",
            "C) 建设社会主义法制化国家",
            "D) 实现社会主义现代化"
        ],
        answer: ["B"],
        flag: "单选题"
    },
// 30
    {
        title: "新时代中国特色社会主义思想，明确中国特色社会主义最本质的特征是（ ）。",
        options: [
            "A) “五位一体”总体布局",
            "B) 建设中国特色社会主义法治体系",
            "C) 人民利益为根本出发点",
            "D) 中国共产党领导"
        ],
        answer: ["D"],
        flag: "单选题"
    },
    // 31. （）是我们党执政兴国的第一要务。
    {
        title: "是我们党执政兴国的第一要务。",
        options: ["A) 发展", "B) 改革", "C) 反腐", "D) 革命"],
        answer: ["A"],
        flag: "单选题"
    },
// 32. 习近平总书记在庆祝中国共产党成立95周年大会上发表的重要讲话中强调，要坚持 中国特色社会主义道路自信、理论自信、制度自信、（），坚持党的基本路线不动摇， 不断把中国特色社会主义伟大事业推向前进
    {
        title: "习近平总书记在庆祝中国共产党成立95周年大会上发表的重要讲话中强调，要坚持中国特色社会主义道路自信、理论自信、制度自信、（），坚持党的基本路线不动摇，不断把中国特色社会主义伟大事业推向前进",
        options: ["A) 民主自信", "B) 政治自信", "C) 文化自信", "D) 文明自信"],
        answer: ["C"],
        flag: "单选题"
    },
// 33. 加强( )法律法规教育，引导党员尊法学法守法用法。
    {
        title: "加强法律法规教育，引导党员尊法学法守法用法。",
        options: ["A) 刑法", "B) 民法", "C) 宪法", "D) 行政法"],
        answer: ["C"],
        flag: "单选题"
    },
// 34. 对因私出国并在国外长期定居的党员，出国学习研究超过（）年仍未返回的党员，一般予以停止党籍。停止党籍的决定由保留其组织关系的党组 织按照有关规定作出。
    {
        title: "对因私出国并在国外长期定居的党员，出国学习研究超过（）年仍未返回的党员，一般予以停止党籍。停止党籍的决定由保留其组织关系的党组织按照有关规定作出。",
        options: ["A) 4", "B) 5", "C) 6", "D) 7"],
        answer: ["B"],
        flag: "单选题"
    },
// 35. 在新世纪新时代，经济和社会发展的战略目标中包括，到建党一百年时，_________。
    {
        title: "在新世纪新时代，经济和社会发展的战略目标中包括，到建党一百年时，_________。",
        options: ["A) 基本实现小康", "B) 总体上建成小康社会", "C) 全面建成小康社会", "D) 全面建成社会主义现代化强国"],
        answer: ["C"],
        flag: "单选题"
    },
// 36. 党的十八大报告强调，我们在任何情况下都要牢牢把握社会主义初级阶段这个最大 国情，推进任何方面的改革发展都要牢牢立足社会主义初级阶段这个（）
    {
        title: "党的十八大报告强调，我们在任何情况下都要牢牢把握社会主义初级阶段这个最大国情，推进任何方面的改革发展都要牢牢立足社会主义初级阶段这个（）",
        options: ["A) 根本判断", "B) 主要国情", "C) 最大实际"],
        answer: ["C"],
        flag: "单选题"
    },
// 37. 坚持中国共产党在统一战线中的（ ）是统一战线最根本的问题。
    {
        title: "坚持中国共产党在统一战线中的（ ）是统一战线最根本的问题。",
        options: ["A) 主导地位", "B) 领导权", "C) 发言权"],
        answer: ["A"],
        flag: "单选题"
    },
// 38. 统一战线工作的根本任务是______________，为实现党和国家的宏伟目标而团结奋斗。
    {
        title: "统一战线工作的根本任务是______________，为实现党和国家的宏伟目标而团结奋斗。",
        options: ["A) 凝聚人心、汇聚力量", "B) 大团结、大联合", "C) 为社会主义的经济、政治、文化服务"],
        answer: ["C"],
        flag: "单选题"
    },
// 39. 各级党委主管统一战线工作的职能部门是（ ）。
    {
        title: "各级党委主管统一战线工作的职能部门是（ ）。",
        options: ["A) 办公厅（室）", "B) 宣传部", "C) 统战部"],
        answer: ["C"],
        flag: "单选题"
    },
// 40. 中国共产党第十八次全国代表大会，是在我国进入（）小康社会决定性阶段召开的一次十分重要的大会
    {
        title: "中国共产党第十八次全国代表大会，是在我国进入（）小康社会决定性阶段召开的一次十分重要的大会",
        options: ["A) 全面建设", "B) 全面建成", "C) 全面建立"],
        answer: ["B"],
        flag: "单选题"
    },
// 41. 弘扬理论联系实际的马克思主义学风，引导党员_____________学以致用、知行合一，提高政治站位，强化责任担当，增强过硬本领，做好本职工作，自觉做习近平新时 代中国特色社会主义思想坚定信仰者和忠实实践者。( )
    {
        title: "弘扬理论联系实际的马克思主义学风，引导党员_____________学以致用、知行合一，提高政治站位，强化责任担当，增强过硬本领，做好本职工作，自觉做习近平新时代中国特色社会主义思想坚定信仰者和忠实实践者。",
        options: ["A) 把自己摆进去", "B) 把职责摆进去", "C) 把态度摆进去", "D) 把工作摆进去"],
        answer: ["A", "B", "D"],
        flag: "多选题"
    },
// 42. 党员教育管理工作要遵循哪些原则？（ ）
    {
        title: "党员教育管理工作要遵循哪些原则？",
        options: ["A) 坚持党要管党、全面从严治党，将严的要求落实到党员教育管理工作全过程和各方面，党员领导干部带头接受教育管理；", "B) 坚持以党的政治建设为统领，突出党性教育和政治理论教育，引导党员遵守党章党规党纪，不忘初心、牢记使命；", "C) 坚持围绕中心、服务大局，注重党员教育管理质量和实效，保证党的理论和路线方针政策、党中央决策部署贯彻落实；", "D) 坚持从实际出发，加强分类指导，尊重党员主体地位，充分发挥党支部直接教育、管理、监督党员作用。"],
        answer: ["A", "B", "C", "D"],
        flag: "多选题"
    },
// 43. 国家机关和国有企事业单位党组（党委）负责本领域、本单位党外知识分子工作，组织党外知识分子参加统一战线工作和活动。在党委统一领导下，坚持（）的方针，建立由统战部牵头、党政有关部门参加、社会有关团体参与的联席会议制度，做好新的社会阶层中的党外知识分子工作。
    {
        title: "国家机关和国有企事业单位党组（党委）负责本领域、本单位党外知识分子工作，组织党外知识分子参加统一战线工作和活动。在党委统一领导下，坚持（）的方针，建立由统战部牵头、党政有关部门参加、社会有关团体参与的联席会议制度，做好新的社会阶层中的党外知识分子工作。",
        options: ["A) 充分尊重；", "B) 广泛联系；", "C) 加强团结；", "D) 热情帮助；"],
        answer: ["A", "B", "C", "D"],
        flag: "多选题"
    },
// 44. 对党员的纪律处分种类，包括（）
    {
        title: "对党员的纪律处分种类，包括（）",
        options: ["A) 警告", "B) 严重警告", "C) 撤销党内职务", "D) 留党察看"],
        answer: ["A", "B", "C", "D"],
        flag: "多选题"
    },
// 45. 党组织应当加强党员教育管理，引导党员坚定共产主义远大理想和中国特色社会主 义共同理想，增强____、坚定____、做到____，增强党性，提高素质，认真履行义务， 正确行使权利，充分发挥先锋模范作用。
    {
        title: "党组织应当加强党员教育管理，引导党员坚定共产主义远大理想和中国特色社会主义共同理想，增强____、坚定____、做到____，增强党性，提高素质，认真履行义务，正确行使权利，充分发挥先锋模范作用。",
        options: ["A) “四个意识”", "B) “两学一做”", "C) “四个自信”", "D) ”两个维护”"],
        answer: ["A", "C", "D"],
        flag: "多选题"
    },
    // 46
    {
        title: "统一战线工作范围和对象是（）。",
        options: ["A) 民主党派成员；", "B) 无党派人士；", "C) 党外知识分子；", "D) 少数民族人士；"],
        answer: ["A", "B", "C"],
        flag: "多选题"
    },
// 47
    {
        title: "党支部工作必须遵循（ ）项原则。",
        options: ["A) 坚持以马克思列宁主义、毛泽东思想等重要思想为指导，遵守党章，加强思想理论武装，坚定理想信念，不忘初心、牢记使命，始终保持先进性和纯洁性；", "B) 坚持把党的政治建设摆在首位；", "C) 坚持践行党的宗旨和群众路线；", "D) 坚持民主集中制；"],
        answer: ["A", "B", "C", "D"],
        flag: "多选题"
    },
// 48
    {
        title: "“三会一课”应当突出（ ）",
        options: ["A) 政治学习", "B) 政治意识", "C) 党性锻炼", "D) 政治教育"],
        answer: ["A", "C", "D"],
        flag: "多选题"
    },
// 49
    {
        title: "统战部应当加强同政协组织的沟通协调配合，加强对民族、宗教工作部门和参事室、文史研究馆的工作指导，支持配合（）等工作部门做好相关工作。",
        options: ["A) 外事；", "B) 对台；", "C) 侨务；", "D) 港澳；"],
        answer: ["A", "B", "C", "D"],
        flag: "多选题"
    },
// 50
    {
        title: "我国的“四个全面”战略布局包括：______",
        options: ["A) 全面建成小康社会", "B) 全面深化改革", "C) 全面依法治国", "D) 全面从严治党"],
        answer: ["A", "B", "C", "D"],
        flag: "多选题"
    },
// 51
    {
        title: "党员必须履行下列义务（）。",
        options: ["A) 认真学习马克思列宁主义、毛泽东思想、邓小平理论 ；", "B) 自觉遵守党的纪律", "C) 切实开展批评和自我批评；", "D) 发扬社会主义新风尚，弘扬社会主义核心价值观 ；"],
        answer: ["A", "B", "C", "D"],
        flag: "多选题"
    },
// 52
    {
        title: "新形势下，党面临的考验包括：____",
        options: ["A) 执政考验", "B) 改革开放考验", "C) 市场经济考验", "D) 外部环境考验"],
        answer: ["A", "B", "C", "D"],
        flag: "多选题"
    },
// 53
    {
        title: "党员领导干部应当坚持更高标准、更严要求，全面学、系统学、贯通学、深入学、跟进学，自觉用以_____、_____、_____，发挥示范带动作用。",
        options: ["A) 理论宣讲", "B) 武装头脑", "C) 指导实践", "D) 推动工作"],
        answer: ["B", "C", "D"],
        flag: "多选题"
    },
// 54
    {
        title: "改革开放以来我们取得一切成绩和进步的根本原因，归结起来就是___________。",
        options: ["A) 坚持党的基本路线", "B) 开辟了中国特色社会主义道路", "C) 形成了中国特色社会主义理论体系", "D) 坚持民主集中制"],
        answer: ["B", "C"],
        flag: "多选题"
    },
// 55
    {
        title: "党的宗教工作基本方针是（）。",
        options: ["A) 全面贯彻党的宗教信仰自由政策；", "B) 依法管理宗教事务；", "C) 坚持独立自主自办原则；", "D) 积极引导宗教与社会主义社会相适应；"],
        answer: ["A", "B", "C", "D"],
        flag: "多选题"
    },// 56（续）
    {
        title: "新时代我国社会主要矛盾是（ ），必须坚持（ ）的发展思想，不断促进（ ）。",
        options: ["A) 人民日益增长的美好生活需要和不平衡不充分的发展之间的矛盾", "B) 以人民为中心", "C) 人的全面发展和全体人民共同富裕", "D) 社会主义经济建设"],
        answer: ["A", "B", "C"],
        flag: "多选题"
    },
// 57
    {
        title: "加强县级党校（行政学校）和基层党校建设。县级党校（行政学校）应当将党员集中培训作为重要任务，有计划地组织安排党员教育讲师到基层授课。注重发挥_______的作用。",
        options: ["A) 党群服务中心", "B) 基层党组织", "C) 党员干部教育培训基地", "D) 新时代文明实践中心"],
        answer: ["A", "B", "C", "D"],
        flag: "多选题"
    },
// 58
    {
        title: "对于全面从严治党，（）是党自我净化、自我完善、自我革新、自我提高的根本途径，（）则是实现改革发展目标的根本保证，增强从严治党的系统性、预见性、创造性、实效性，锻造我们事业更加坚强的领导核心。",
        options: ["A) 改革；", "B) 经济建设；", "C) 政治建设；", "D) 党的领导；"],
        answer: ["A", "D"],
        flag: "多选题"
    },
// 59
    {
        title: "中国共产党在新时期面临的三大历史任务为( ) 。",
        options: ["A) 发展生产力", "B) 推进现代化建设", "C) 完成祖国统一", "D) 维护世界和平与促进共同发展"],
        answer: ["B", "C", "D"],
        flag: "多选题"
    },
// 60
    {
        title: "违反有关规定等，对直接责任者和领导责任者，情节较轻的，给予警告或者严重警告处分;情节较重的，给予撤销党内职务或者留党察看处分;情节严重的，给予开除党籍处分。",
        options: ["A) 自定薪酬", "B) 滥发津贴", "C) 滥发补贴", "D) 滥发奖金"],
        answer: ["A", "B", "C", "D"],
        flag: "多选题"
    }
]
const data_6 = [
// 11.
    {
        title: "根据党组织隶属关系和干部管理权限，上级党组织对任期届满的党支部，一般提前3个月以发函或者电话通知等形式，提醒做好换届准备。",
        options: ["A) 正确", "B) 错误"],
        answer: ["B"],
        flag: "单选题"
    },

// 12.
    {
        title: "党的纪律是铁的纪律，包含强制性、严肃性和统一性三个含义。",
        options: ["A) 正确", "B) 错误"],
        answer: ["A"],
        flag: "单选题"
    },

// 13.
    {
        title: "党员每年集中学习培训时间一般不少于32学时。",
        options: ["A) 正确", "B) 错误"],
        answer: ["A"],
        flag: "单选题"
    },

// 14.
    {
        title: "党员个人服从党的组织，少数服从多数，下级组织服从上级组织，全党各个组织和全体党员服从党的全国代表大会。",
        options: ["A) 正确", "B) 错误"],
        answer: ["B"],
        flag: "单选题"
    },

// 15.
    {
        title: "党支部应当组织党员按期参加党员大会、党小组会和上党课，随时召开党支部委员会会议。",
        options: ["A) 正确", "B) 错误"],
        answer: ["B"],
        flag: "单选题"
    },

// 16.
    {
        title: "党员如果没有正当理由，连续五个月不参加党的组织生活就被认为是自行脱党。",
        options: ["A) 正确", "B) 错误"],
        answer: ["B"],
        flag: "单选题"
    },

// 17.
    {
        title: "党员教育管理工作经费应当列入地方各级财政预算，结合实际按照党员数量划拨，重点保障农村、社区、非公有制经济组织和社会组织、公共就业和人才服务机构等基层党组织开展党员教育管理，形成稳定的经费保障机制。",
        options: ["A) 正确", "B) 错误"],
        answer: ["A"],
        flag: "单选题"
    },

// 18.
    {
        title: "党员如果没有正当理由，连续六个月不缴纳党费，就被认为是自行脱党。",
        options: ["A) 正确", "B) 错误"],
        answer: ["A"],
        flag: "单选题"
    },

// 19.
    {
        title: "党性和人民性从来都是一致的、统一的。",
        options: ["A) 正确", "B) 错误"],
        answer: ["A"],
        flag: "单选题"
    },

// 20.
    {
        title: "对停止党籍的党员，符合条件的，可以按照规定程序恢复党籍。对劝其退党、劝而不退除名、自行脱党除名、退党除名、开除党籍的，永远不能入党。",
        options: ["A) 正确", "B) 错误"],
        answer: ["B"],
        flag: "单选题"
    },

// 三
// 单选题
// 21.
    {
        title: "在新世纪新时代，经济和社会发展的战略目标中包括，到建党一百年时，_________。",
        options: ["A) 基本实现小康", "B) 总体上建成小康社会", "C) 全面建成小康社会", "D) 全面建成社会主义现代化强国"],
        answer: ["C"],
        flag: "单选题"
    },

// 22.
    {
        title: "十九大报告中指出，统一战线是党的事业取得胜利的重要法宝，要坚持___________统一。",
        options: ["A) 同一性和多样性", "B) 一致性和多样性", "C) 独立性和一致性", "D) 共性和个性"],
        answer: ["B"],
        flag: "单选题"
    },

// 23.
    {
        title: "我们要坚持以经济体制改革为重点，坚持社会主义市场经济改革方向，全面深化经济体制、政治体制、文化体制、社会体制、生态文明体制和党的建设制度改革。",
        options: ["A) 经济体制改革", "B) 政治体制改革", "C) 社会体制改革", "D) 党的建设制度改革"],
        answer: ["A"],
        flag: "单选题"
    },

// 24.
    {
        title: "党的全国代表大会每_____年举行一次。",
        options: ["A) 2", "B) 3", "C) 4", "D) 5"],
        answer: ["D"],
        flag: "单选题"
    },

// 25.
    {
        title: "对党员不按照规定参加党的组织生活、不按时交纳党费、流动到外地工作生活不与党组织主动保持联系的，以及存在其他与党的要求不相符合的行为，党组织应当采取适当方式及时进行批评教育，帮助其改进提高。",
        options: ["A) 情节严重的", "B) 情节较严重的", "C) 情节较轻的", "D) 情节轻微的"],
        answer: ["C"],
        flag: "单选题"
    },

// 26.
    {
        title: "2016年4月24日至26日，习近平总书记视察安徽并发表重要讲话，对安徽发展提出了明确要求，省委概括为“一大目标”和“五大任务”，这是习近平总书记赋予安徽的重大历史使命。其中，“一大目标”是中部崛起中闯出新路。",
        options: ["A) 中部崛起中闯出新路", "B) 发扬敢为人先的精神", "C) 转型升级中弯道超车", "D) 改革创新中脱颖而出"],
        answer: ["A"],
        flag: "单选题"
    },

// 27.
    {
        title: "村、社区重要事项以及与群众利益密切相关的事项，必须经过党支部党员讨论。",
        options: ["A) 所有群众", "B) 党支部领导干部", "C) 党支部党员", "D) 乡镇（街道）主要领导"],
        answer: ["C"],
        flag: "单选题"
    },

// 28.
    {
        title: "我国政府解决民族问题采取的一项基本政策是民族区域自治制度。",
        options: ["A) 民族自治制度", "B) 少数民族自治制度", "C) 民族区域自治制度", "D) 少数民族区域自治制度"],
        answer: ["C"],
        flag: "单选题"
    },

// 29.
    {
        title: "党支部党员大会是党支部的议事决策机构，由全体党员参加，一般一季度召开1次。",
        options: ["A) 一个月", "B) 一季度", "C) 半年", "D) 一年"],
        answer: ["B"],
        flag: "单选题"
    },

// 30.
    {
        title: "党支部党员大会、党支部委员会会议由书记召集并主持。",
        options: ["A) 书记", "B) 副书记", "C) 委员", "D) 党小组组长"],
        answer: ["A"],
        flag: "单选题"
    },
// 31
    {
        title: "党的基层委员会、总支部委员会、支部委员会每届任期_________",
        options: ["A) 一年至两年", "B) 两年至三年", "C) 三年至四年", "D) 三年至五年"],
        answer: ["D"],
        flag: "单选题"
    },
// 32
    {
        title: "党组织应当按照党中央部署要求，组织党员认真参加党内集中学习教育，引导党员围绕（ ）主题，深入学习党的创新理论，查找解决自身存在的突出问题。",
        options: ["A) 政治教育", "B) 学习教育", "C) 思想教育", "D) 文化教育"],
        answer: ["B"],
        flag: "单选题"
    },
// 33
    {
        title: "预备党员可以延长预备期，但不能超过_______.",
        options: ["A) 半年", "B) 一年", "C) 两年", "D) 三年"],
        answer: ["B"],
        flag: "单选题"
    },
// 34
    {
        title: "中国的参政党数量是_______",
        options: ["A) 1", "B) 3", "C) 8", "D) 9"],
        answer: ["C"],
        flag: "单选题"
    },
// 35
    {
        title: "中国特色社会主义，既坚持了科学社会主义基本原则，又根据时代特征赋予其鲜明的（ ）。",
        options: ["A) 国际特色", "B) 实践特色", "C) 中国特色", "D) 时代特色"],
        answer: ["C"],
        flag: "单选题"
    },
// 36
    {
        title: "党的十八大报告强调，我们坚定不移高举中国特色社会主义伟大旗帜，既不走封闭僵化的老路、也不走（ ）的邪路。",
        options: ["A) 资本主义", "B) 改旗易帜", "C) 改弦更张"],
        answer: ["B"],
        flag: "单选题"
    },
// 37
    {
        title: "中国共产党坚持独立自主的和平外交政策，坚持和平发展道路，坚持________的开放战略，统筹________两个大局，积极发展对外关系。",
        options: ["A) 互利共赢、国内国际", "B) 互惠互利、国内国际", "C) 互利共赢、内地外地"],
        answer: ["A"],
        flag: "单选题"
    },
// 38
    {
        title: "中国共产党坚持独立自主的和平外交政策，坚持和平发展道路，坚持________的开放战略，统筹________两个大局，积极发展对外关系。",
        options: ["A) 互利共赢、国内国际", "B) 互惠互利、国内国际", "C) 互利共赢、内地外地"],
        answer: ["A"],
        flag: "单选题"
    },
// 39
    {
        title: "坚持中国共产党在统一战线中的_________是统一战线最根本的问题。",
        options: ["A) 主导地位", "B) 领导权", "C) 发言权"],
        answer: ["A"],
        flag: "单选题"
    },
// 40
    {
        title: "从2020年到本世纪中叶的第一阶段奋斗目标是：（ ）",
        options: ["A) 初步实现社会主义现代化", "B) 基本实现社会主义现代化", "C) 全面实现社会主义现代化"],
        answer: ["B"],
        flag: "单选题"
    },
// 41
    {
        title: "健全人民当家作主制度体系，发展社会主义民主政治，必须要（ ）。",
        options: ["A) 坚持党的领导、人民当家作主、依法治国有机统一；", "B) 加强人民当家作主制度保障；", "C) 发挥社会主义协商民主重要作用；", "D) 简化机构和行政体制改革；"],
        answer: ["A", "B", "C"],
        flag: "多选题"
    },
// 42
    {
        title: "《中国共产党党员教育管理工作条例》的制定和实施，对于________,实现党伟大执政使命，具有十分重要的意义。",
        options: ["A) 提高党员队伍建设质量", "B) 激发党组织的生机活力", "C) 推动全面从严治党向纵深发展", "D) 夯实党长期执政基础"],
        answer: ["A", "B", "C", "D"],
        flag: "多选题"
    },
// 43
    {
        title: "党员应当主动学网用网，依托各类党员教育管理信息化平台，_______。",
        options: ["A) 积极参加在线学习培训", "B) 认真参加党组织的活动", "C) 做好教育培训、管理服务等工作", "D) 自觉接受党组织的教育管理"],
        answer: ["A", "B", "D"],

        flag: "多选题"
    },
// 44
    {
        title: "党员廉洁自律规范包括：",
        options: ["A) 坚持公私分明，先公后私，克己奉公", "B) 坚持崇廉拒腐，清白做人，干净做事", "C) 坚持尚俭戒奢，艰苦朴素，勤俭节约", "D) 坚持吃苦在前，享受在后，甘于奉献"],
        answer: ["A", "B", "C", "D"],
        flag: "多选题"
    },
// 45
    {
        title: "中国共产党要建设成为_______、_______、________马克思主义执政党。",
        options: ["A) 学习型", "B) 服务型", "C) 创新性", "D) 战斗型"],
        answer: ["A", "B", "C"],
        flag: "多选题"
    }
    ,
    {
        // 46
        title: "党小组组长（ ）产生",
        options: ["A) 党支部指定", "B) 群众推荐", "C) 所在党小组党员推荐", "D) 毛遂自荐"],
        answer: ["A", "C"],
        flag: "单选题"
    },
    {
        // 47
        title: "新形势下，党面临的危险包括：_____",
        options: ["A) 精神懈怠危险", "B) 能力不足危险", "C) 脱离群众危险", "D) 消极腐败危险"],
        answer: ["A", "B", "C", "D"],
        flag: "多选题"
    },
    {
        // 48
        title: "《党章》第四条规定，党员享有八项权利，下列哪些属于党员享有的权利?",
        options: ["A) 参加党的有关会议，阅读党的有关文件，接受党的教育和培训", "B) 在党的会议上和党报党刊上，参加关于党的政策问题的讨论", "C) 对党的工作提出建议和倡议", "D) 行使表决权、选举权，有被选举权"],
        answer: ["A", "B", "C", "D"],
        flag: "多选题"
    },
    {
        // 49
        title: "坚定文化自信，推动社会主义文化繁荣兴盛，要求我们党（）。",
        options: ["A) 放弃意识形态工作；", "B) 培育和践行社会主义核心价值观；", "C) 加强思想道德建设；", "D) 繁荣发展社会主义文艺；"],
        answer: ["B", "C", "D"],
        flag: "多选题"
    },
    {
        // 50
        title: "党员要加强党性锻炼，不断提高政治觉悟和政治能力，把( )作为根本政治担当，永葆共产党人政治本色。",
        options: ["A) 对党忠诚；", "B) 为党分忧；", "C) 为党尽职；", "D) 为民造福；"],
        answer: ["A", "B", "C", "D"],
        flag: "多选题"
    },
    {
        // 51
        title: "《党章》第三十一条规定，党的基层组织对要求入党的积极分子进行教育和培养，做好经常性的发展党员工作，重视在__中发展党员。",
        options: ["A) 生产第一线", "B) 先进工作者", "C) 工作第一线", "D) 青年"],
        answer: ["A", "C"],
        flag: "单选题"
    },
    {
        // 52
        title: "基层党委履行抓党员教育管理的基本职责，推动落实上级党组织工作安排，组织做好党员集中培训、组织关系管理、_____________,纪律处分等工作，指导所辖党支部做好党员日常教育管理工作。( )",
        options: ["A) 表彰激励", "B) 关怀帮扶", "C) 指导督促", "D) 组织处置"],
        answer: ["A", "B", "D"],
        flag: "多选题"
    },
    {
        // 53
        title: "党小组会一般每月召开1次，组织党员（ ）等。",
        options: ["A) 政治学习", "B) 谈心谈话", "C) 开展批评", "D) 自我批评"],
        answer: ["A", "B", "C", "D"],
        flag: "多选题"
    },
    {
        // 54
        title: "对党员的纪律处分种类，包括",
        options: ["A) 警告", "B) 严重警告", "C) 撤销党内职务", "D) 留党察看"],
        answer: ["A", "B", "C", "D"],
        flag: "多选题"
    },
    {
        // 55
        title: "中国共产党第十九次全国代表大会同意把（ ）一道写入党章",
        options: ["A) 中国特色社会主义道路", "B) 中国特色社会主义理论体系", "C) 中国特色社会主义制度", "D) 中国特色社会主义文化"],
        answer: ["A", "B", "C", "D"],
        flag: "多选题"
    },
    {
        // 56
        title: "《党章》总纲中明确指出，中国共产党的性质是",
        options: ["A) 中国共产党是中国工人阶级的先锋队", "B) 是中国特色社会主义事业的领导核心", "C) 代表中国先进生产力的发展要求", "D) 代表中国先进文化的前进方向"],
        answer: ["A", "B", "C", "D"],
        flag: "多选题"
    },
    {
        // 57


        title: "中国共产党必须不断提高党的创造力、凝聚力、战斗力，建设（）的马克思主义执政党。",
        options: ["A) 学习型；", "B) 努力型；", "C) 服务型；", "D) 创新型；"],
        answer: ["A", "C", "D"],
        flag: "多选题"
    },
    {
        // 58
        title: "习近平新时代中国特色社会主义思想是对（）的继承和发展，是马克思主义中国化最新成果，是党和人民实践经验和集体智慧的结晶。",
        options: ["A) 马克思列宁主义；", "B) 毛泽东思想", "C) 邓小平理论；", "D) “三个代表”重要思想；"],
        answer: ["A", "B", "C", "D"],
        flag: "多选题"
    },
    {
        // 59
        title: "《党章》总纲中明确指出，中国共产党的性质是()",
        options: ["A) 中国共产党是中国工人阶级的先锋队", "B) 是中国特色社会主义事业的领导核心", "C) 代表中国先进生产力的发展要求", "D) 代表中国先进文化的前进方向"],
        answer: ["A", "B", "C", "D"],
        flag: "多选题"
    },
    {
        // 60
        title: "支持民主党派和无党派人士参政的主要内容是：（）。",
        options: ["A) 参加国家政权；", "B) 监督人民代表大会；", "C) 参与国家事务的管理；", "D) 参与国家方针政策、法律法规的制定和执行；"],
        answer: ["A", "C", "D"],
        flag: "多选题"
    }
]
const data_7 = [
// 11.
    {
        title: "党组织不得无故拒转拒接党员组织关系。",
        options: ["A) 正确", "B) 错误"],
        answer: ["A"],
        flag: "单选题"
    },

// 12.
    {
        title: "党支部委员会会议必须每月召开1次，不能根据需要随时召开。",
        options: ["A) 正确", "B) 错误"],
        answer: ["B"],
        flag: "单选题"
    },

// 13.
    {
        title: "党员组织关系保留时间一般不超过2年，对符合转出组织关系条件的及时转出。",
        options: ["A) 正确", "B) 错误"],
        answer: ["A"],
        flag: "单选题"
    },

// 14.
    {
        title: "培育和弘扬社会主义核心价值观，不一定要突出道德价值的作用。",
        options: ["A) 正确", "B) 错误"],
        answer: ["B"],
        flag: "单选题"
    },

// 15.
    {
        title: "对要求入党的积极分子进行教育和培养，做好经常性的发展党员工作，发现、培养和推荐党员中的优秀人才。",
        options: ["A) 正确", "B) 错误"],
        answer: ["B"],
        flag: "单选题"
    },

// 16.
    {
        title: "民主集中制是有党的性质和其所肩负的伟大的历史使命决定的。",
        options: ["A) 正确", "B) 错误"],
        answer: ["A"],
        flag: "单选题"
    },

// 17.
    {
        title: "人民身体健康并非全面建成小康社会的重要内涵。",
        options: ["A) 正确", "B) 错误"],
        answer: ["B"],
        flag: "单选题"
    },

// 18.
    {
        title: "自预备党员转正之日起，即取得党籍。",
        options: ["A) 正确", "B) 错误"],
        answer: ["B"],
        flag: "单选题"
    },

// 19.
    {
        title: "党小组会一般每月召开1次，组织党员参加政治学习、谈心谈话、开展批评和自我批评等。",
        options: ["A) 正确", "B) 错误"],
        answer: ["A"],
        flag: "单选题"
    },

// 20.
    {
        title: "保持香港、澳门长期繁荣稳定，实现祖国完全统一，是实现中华民族伟大复兴的必然要求。",
        options: ["A) 正确", "B) 错误"],
        answer: ["A"],
        flag: "单选题"
    },

// 三
// 单选题
// 21.
    {
        title: "强化党章党规党纪教育，引导党员牢记入党誓词，坚持合格党员标准，自觉遵守党的纪律，带头践行社会主义核心价值观，培养高尚道德情操，培育良好思想作风、学风、工作作风、生活作风和家风。加强宪法法律法规教育，引导党员尊法学法守法用法。",
        options: ["A) 入党誓词", "B) 党规", "C) 党宗旨", "D) 党任务"],
        answer: ["A"],
        flag: "单选题"
    },

// 22.
    {
        title: "_______是促进人类社会向前发展的最终决定性因素。",
        options: ["A) 生产关系", "B) 生产力", "C) 生产要素", "D) 生产方式"],
        answer: ["B"],
        flag: "单选题"
    },

// 23.
    {
        title: "社会主义初级阶段基本路线的中心是经济建设。",
        options: ["A) 改革开放", "B) 经济建设", "C) 保持社会稳定", "D) 坚持走社会主义道路"],
        answer: ["B"],
        flag: "单选题"
    },

// 24.
    {
        title: "党的基层委员会、总支部委员会、支部委员会每届任期三年至五年。",
        options: ["A) 一年至两年", "B) 两年至三年", "C) 三年至四年", "D) 三年至五年"],
        answer: ["D"],
        flag: "单选题"
    },

// 25.
    {
        title: "把用习近平新时代中国特色社会主义思想武装全党作为党员教育管理的首要政治任务，引导党员充分认识学习贯彻习近平新时代中国特色社会主义思想的重大意义，自觉学懂弄通做实。",
        options: ["A) 基本政治任务", "B) 首要政治任务", "C) 根本政治任务", "D) 主要政治任务"],
        answer: ["B"],
        flag: "单选题"
    },
// 26
    {
        title: "联合党支部覆盖单位一般不超过（ ）个。",
        options: ["A) 2", "B) 3", "C) 4", "D) 5"],
        answer: ["D"],
        flag: "单选题"
    },
// 27
    {
        title: "党员受到警告处分_______内，不得在党内提升职务和向党外组织推荐担任高于其原任职务的党外职务。",
        options: ["A) 六个月", "B) 一年", "C) 一年半", "D) 两年"],
        answer: ["B"],
        flag: "单选题"
    },
// 28
    {
        title: "新世纪新阶段统一战线具有空前的广泛性、巨大的包容性、鲜明的多样性和显著的（ ）",
        options: ["A) 政治性", "B) 时代性", "C) 复杂性", "D) 社会性"],
        answer: ["D"],
        flag: "单选题"
    },
// 29
    {
        title: "党员教育基本任务中，要突出( )和政治训练，严格党内政治生活锻炼，教育党员旗帜鲜明讲政治，提高政治觉悟和政治能力，严守政治纪律和政治规矩，永葆共产党人政治本色。",
        options: ["A) 政治修养", "B) 政治教育", "C) 政治素养", "D) 政治规划"],
        answer: ["B"],
        flag: "单选题"
    },
// 30
    {
        title: "我国根本的政治制度是__________。",
        options: ["A) 政治协商制度", "B) 人民代表大会制度", "C) 多党合作制度", "D) 民主集中制"],
        answer: ["B"],
        flag: "单选题"
    },
// 31
    {
        title: "（）是共产党人精神上的“钙”。",
        options: ["A) 理想信念", "B) 政治觉悟", "C) 世界观和方法论", "D) 文化追求"],
        answer: ["A"],
        flag: "单选题"
    },
// 32
    {
        title: "（ ）是党的基础组织，是党组织开展工作的基本单元，是党在社会基层组织中的战斗堡垒，是党的全部工作和战斗力的基础。",
        options: ["A) 党小组", "B) 党支部", "C) 党总支", "D) 党委"],
        answer: ["C"],
        flag: "单选题"
    },
// 33
    {
        title: "习近平总书记“七一”重要讲话指出，在坚持马克思主义指导地位这一根本问题上，我们必须坚定不移，任何时候任何情况下都不能有丝毫动摇。同时，面对新的时代特点和实践要求，马克思主义也面临着进一步中国化、时代化、（ ）的问题。",
        options: ["A) 特色化", "B) 具体化", "C) 大众化", "D) 科学化"],
        answer: ["C"],
        flag: "单选题"
    },
// 34
    {
        title: "党员如果没有正当理由，连续_______不交纳党费，就被认为是自行脱党。",
        options: ["A) 三个月", "B) 半年", "C) 一年", "D) 两年"],
        answer: ["B"],
        flag: "单选题"
    },
// 35
    {
        title: "党支部书记应当具备良好政治素质，在党员、群众中有较高威信，一般应当具有（）年以上党龄。",
        options: ["A) 半", "B) 一", "C) 二", "D) 三"],
        answer: ["B"],
        flag: "单选题"
    },
// 36
    {
        title: "各级党委主管统一战线工作的职能部门是_________。",
        options: ["A) 办公厅（室）", "B) 宣传部", "C) 统战部"],
        answer: ["C"],
        flag: "单选题"
    },
// 37
    {
        title: "“全面建设小康社会”是指_______。",
        options: ["A) 人民生活总体上达到小康水平", "B) 全面建设惠及十几亿人口的更高水平的小康社会", "C) 让先富的部分人员和部分地区更加富裕"],
        answer: ["B"],
        flag: "单选题"
    },
// 38
    {
        title: "坚持物质文明和精神文明两手抓，实行依法治国和_______相结合。",
        options: ["A) 以德治国", "B) 科教兴国", "C) 实力建国"],
        answer: ["A"],
        flag: "单选题"
    },
// 39
    {
        title: "党员的党龄，从_______之日算起。",
        options: ["A) 从递交入党志愿书", "B) 支部大会通过其为预备党员", "C) 预备期满转为正式党员"],
        answer: ["C"],
        flag: "单选题"
    },
// 40
    {
        title: "在新世纪，（ ）作为党的一个重要法宝，绝不能丢掉；作为党的一个政治优势，绝不能削弱；作为党的一项长期方针，绝不能动摇。",
        options: ["A) 党的建设", "B) 统一战线", "C) 艰苦奋斗"],
        answer: ["B"],
        flag: "单选题"
    },
    {
        // 41
        title: "对劝其退党、_____________的，原则上不能恢复党籍，符合条件的可以重新入党。",
        options: ["A) 劝而不退出名", "B) 自行脱党除名", "C) 退党除名", "D) 开除党籍"],
        answer: ["A", "B", "C", "D"],
        flag: "多选题"
    },
    {
        // 42
        title: "组织党员读原著、学原文、悟原理，深入学习领会习近平新时代中国特色社会主义思想的___________，掌握贯穿其中的马克思主义立场观点方法，增强政治自觉、理论自信、情感融入。",
        options: ["A) 基本理论", "B) 核心要义", "C) 基本精神", "D) 实践要求"],
        answer: ["B", "C", "D"],
        flag: "多选题"
    },
    {
        // 43
        title: "基层党组织应当加强流动党员管理，对外出6个月以上并且没有转移组织关系的流动党员，应当做好哪些工作？ ( )",
        options: ["A) 保持经常联系", "B) 组织其参加组织生活或者教育培训", "C) 跟进做好教育培训", "D) 管理服务"],
        answer: ["A", "C", "D"],
        flag: "多选题"
    },
    {
        // 44
        title: "预备党员的权利，除了没有以下哪些权利以外，也同正式党员一样：",
        options: ["A) 投票权", "B) 表决权", "C) 选举权", "D) 被选举权"],
        answer: ["B", "C", "D"],
        flag: "多选题"
    },
    {
        // 45
        title: "支持民主党派和无党派人士就经济社会发展重大问题进行考察调研，发挥其（）在方面的积极作用",
        options: ["A) 反映社情民意；", "B) 协调社会关系；", "C) 维护社会稳定；", "D) 维护宪法权威；"],
        answer: ["A", "B", "C"],
        flag: "多选题"
    },
    {
        // 46
        title: "我国成功走出了一条中国特色社会主义道路，实践证明我们的__、__、__是成功的。",
        options: ["A) 方针政策", "B) 道路", "C) 理论体系", "D) 制度"],
        answer: ["B", "C", "D"],
        flag: "多选题"
    },
    {
        // 47
        title: "对存在换届选举（ ）干扰渗透等问题的，上级党组织应当及时严肃处理。",
        options: ["A) 拉票贿选", "B) 宗族宗教", "C) 黑恶势力", "D) 任人唯亲"],
        answer: ["A", "B", "C"],
        flag: "多选题"
    },
    {
        // 48
        title: "党员具有下列情形之一的，按照规定程序给予除名处置。",
        options: ["A) 理想信念缺失，政治立场动摇，已经丧失党员条件的，予以除名；", "B) 信仰宗教，经党组织帮助教育仍没有转变的，劝其退党，劝而不退的予以除名；", "C) 因思想蜕化提出退党，经教育后仍然坚持退党的，予以除名；", "D) 为了达到个人目的以退党相要挟，经教育不改的，劝其退党，劝而不退的予以除名；"],
        answer: ["A", "B", "C", "D"],
        flag: "多选题"
    },
    {
        // 49
        title: "党员受到党纪处分后，不按照干部管理权限和组织关系对受处分党员开展日常__工作的，对直接责任者和领导责任者，情节较重的，给予警告或者严重警告处分;情节严重的，给予撤销党内职务或者留党察看处分。",
        options: ["A) 教育", "B) 管理", "C) 监督", "D) 培训"],
        answer: ["A", "B", "C"],
        flag: "多选题"
    },
    {
        // 50
        title: "加强对党外代表人士的管理，重点了解掌握其（），特别是在重大原则问题上的政治立场和态度。",
        options: ["A) 政治表现；", "B) 思想状况；", "C) 履行职责；", "D) 廉洁自律情况；"],
        answer: ["A", "B", "C", "D"],
        flag: "多选题"
    },
    {
        // 51 cont.
        title: "临时党支部（ ）由批准其成立的党组织指定。",
        options: ["A) 书记", "B) 副书记", "C) 委员", "D) 组长"],
        answer: ["A", "B", "C"],
        flag: "多选题"
    },
    {
        // 52
        title: "党员犯罪，有下列哪些情形的，应当给予开除党籍处分?",
        options: ["A) 被依法判处刑法规定的主刑(含宣告缓刑)的;", "B) 被单处或者附加剥夺政治权利的;", "C) 因过失犯罪，被依法判处三年以上(不含三年)有期徒刑的。", "D) 违纪情节轻微的"],
        answer: ["A", "B", "C"],
        flag: "多选题"
    },
    {
        // 53
        title: "党的全国代表大会的职权包括：",
        options: ["A) 听取和审查中央委员会的报告", "B) 审查中央纪律检查委员会的报告", "C) 讨论并决定党的重大问题", "D) 修改党的章程"],
        answer: ["A", "B", "C", "D"],
        flag: "多选题"
    },
    {
        // 54
        title: "______个人档案资料的，给予严重警告处分;情节严重的，给予撤销党内职务或者留党察看处分。",
        options: ["A) 篡改", "B) 伪造", "C) 报告", "D) 填写"],
        answer: ["A", "B"],
        flag: "多选题"
    },
    {
        // 55
        title: "党的四项基本原则是",
        options: ["A) 坚持社会主义道路", "B) 坚持人民民主专政", "C) 坚持中国共产党的领导", "D) 坚持马克思列宁主义毛泽东思想"],
        answer: ["A", "B", "C", "D"],
        flag: "多选题"
    },
    {
        // 56
        title: "中国特色社会主义文化是中国特色社会主义的（ ），是激励全党全国人民奋勇前进的（ ）",
        options: ["A) 重要组成部分", "B) 强大精神力量", "C) 基本理论", "D) 伟大支撑"],
        answer: ["A", "B"],
        flag: "多选题"
    },
    {
        // 57
        title: "中共十九大会的主题是（）。",
        options: ["A) 不忘初心，牢记使命；", "B) 高举中国特色社会主义伟大旗帜，决胜全面建成小康社会；", "C) 健全社会主义政治制度；", "D) 夺取新时代中国特色社会主义伟大胜利，为实现中华民族伟大复兴的中国梦不懈奋斗。"],
        answer: ["A", "B", "D"],
        flag: "多选题"
    },
    {
        // 58
        title: "党员教育管理信息化，要坚持网上和网下相结合，依托党员教育管理信息化平台，开展________发展党员管理和党费管理等业务应用，为党员提供在线学习培训、转接组织关系、参与党内事务和关怀帮扶等服务。",
        options: ["A) 党员信息管理", "B) 党组织活动指导管理", "C) 流动党员管理服务", "D) 党员教育管理网站"],
        answer: ["A", "B", "C"],
        flag: "多选题"
    },
    {
        // 59
        title: "党组织在纪律审查中发现党员有贪污贿赂、失职渎职等刑法规定的行为涉嫌犯罪的，应当给予：",
        options: ["A) 撤销党内职务", "B) 留党察看", "C) 严重警告", "D) 开除党籍"],
        answer: ["A", "B", "D"],
        flag: "多选题"
    }, {
        // 60 cont.
        title: "牢牢掌握意识形态工作领导权，要在以下（）方面努力。",
        options: ["A) 推进马克思主义中国化时代化大众化；", "B) 加强理论指导；", "C) 加快构建中国特色哲学社会科学；", "D) 高度重视传播手段建设和创新；"],
        answer: ["A", "B", "C", "D"],
        flag: "多选题"
    }
]
const data_8 = [
    // 11.
    {
        title: "对经党组织同意可以不转接组织关系的党员，所在单位党组织可以将其纳入一个党支部或者党小组，参加组织生活。",
        options: ["A) 正确", "B) 错误"],
        answer: ["A"],
        flag: "单选题"
    },

// 12.
    {
        title: "联合党支部覆盖单位一般不超过5个。",
        options: ["A) 正确", "B) 错误"],
        answer: ["A"],
        flag: "单选题"
    },

// 13.
    {
        title: "党的文化建设是党的根本性建设，决定党的建设方向和效果。",
        options: ["A) 正确", "B) 错误"],
        answer: ["B"],
        flag: "单选题"
    },

// 14.
    {
        title: "中共十九大，于2017年10月18日上午9:00在人民大会堂举行。",
        options: ["A) 正确", "B) 错误"],
        answer: ["A"],
        flag: "单选题"
    },

// 15.
    {
        title: "预备党员预备期满，均可以按时转为正式党员。",
        options: ["A) 正确", "B) 错误"],
        answer: ["B"],
        flag: "单选题"
    },

// 16.
    {
        title: "弘扬理论联系实际的马克思主义学风，引导党员把自己摆进去、把职责摆进去、把工作摆进去，学以致用、知行合一，提高政治站位，强化责任担当，增强过硬本领，做好本职工作，自觉做习近平新时代中国特色社会主义思想坚定信仰者和忠实实践者。",
        options: ["A) 正确", "B) 错误"],
        answer: ["A"],
        flag: "单选题"
    },

// 17.
    {
        title: "根据工作需要，上级党委可以直接作出在基层单位成立党支部的决定。",
        options: ["A) 正确", "B) 错误"],
        answer: ["A"],
        flag: "单选题"
    },

// 18.
    {
        title: "培育和弘扬社会主义核心价值观，不一定要突出道德价值的作用。",
        options: ["A) 正确", "B) 错误"],
        answer: ["B"],
        flag: "单选题"
    },

// 19.
    {
        title: "从十九大到二十大，是“两个一百年”奋斗目标的历史交汇期。",
        options: ["A) 正确", "B) 错误"],
        answer: ["A"],
        flag: "单选题"
    },

// 20.
    {
        title: "对因党员人数或者所在单位、区域等发生变化，不再符合设立条件的党支部，上级党组织应当随后予以调整或者撤销。",
        options: ["A) 正确", "B) 错误"],
        answer: ["B"],
        flag: "单选题"
    },

// 三
// 单选题
// 21.
    {
        title: "党员必须坚持党和人民利益高于一切，吃苦在前，享受在后，克己奉公，多做贡献。",
        options: ["A) 克己奉公", "B) 廉洁自律", "C) 艰苦奋斗", "D) 艰苦创业"],
        answer: ["A"],
        flag: "单选题"
    },

// 22.
    {
        title: "坚持四项基本原则的核心是坚持中国共产党的领导。",
        options: ["A) 社会主义道路", "B) 人民民主专政", "C) 中国共产党的领导", "D) 马克思列宁主义毛泽东思想"],
        answer: ["C"],
        flag: "单选题"
    },

// 23.
    {
        title: "申请入党的人，要有2名正式党员作为介绍人。",
        options: ["A) 1", "B) 2", "C) 3", "D) 4"],
        answer: ["B"],
        flag: "单选题"
    },

// 24.
    {
        title: "十八届六中全会认为党的十八大以来，党内政治生活展现新气象，为开创党和国家事业新局面提供了重要保证。",
        options: ["A) 重要保障", "B) 重要保证", "C) 根本保证", "D) 力量源泉"],
        answer: ["B"],
        flag: "单选题"
    },
    // 25
    {
        title: "高校党组织对组织关系保留在学校的高校毕业生流动党员，应当继续履行管理职责。党员组织关系保留时间一般不超过（ ）年，对符合转出组织关系条件的及时转出。",
        options: ["A) 半年", "B) 1", "C) 2", "D) 3"],
        answer: ["C"],
        flag: "单选题"
    },
// 26
    {
        title: "党的（ ）专题研究依法治国问题，并作出我们党历史上第一个关于加强法治建设的专门决定，开启了法治建设新时代。",
        options: ["A) 十五届四中全会", "B) 十六届四中全会", "C) 十七届四中全会", "D) 十八届四中全会"],
        answer: ["D"],
        flag: "单选题"
    },
// 27
    {
        title: "从全面建成小康社会到基本实现现代化，再到全面建成（ ），是新时代中国特色社会主义发展的战略安排。",
        options: ["A) 创新型国家", "B) 社会主义现代化强国", "C) 社会主义现代化大国", "D) 世界一流强国"],
        answer: ["B"],
        flag: "单选题"
    },
// 28
    {
        title: "党支部党员人数一般不超过（ ）人。",
        options: ["A) 30", "B) 40", "C) 50", "D) 60"],
        answer: ["C"],
        flag: "单选题"
    },
// 29
    {
        title: "对出国（境）学习研究党员，由原就读高校或者工作单位党组织保留其组织关系，每半年至少与其联系( )次。出国（境）学习研究党员返回后按照规定恢复组织生活。",
        options: ["A) 1", "B) 2", "C) 3", "D) 4"],
        answer: ["A"],
        flag: "单选题"
    },
// 30
    {
        title: "我国根本的政治制度是__________。",
        options: ["A) 政治协商制度", "B) 人民代表大会制度", "C) 多党合作制度", "D) 民主集中制"],
        answer: ["B"],
        flag: "单选题"
    },
// 31
    {
        title: "以下哪一项不是统一战线工作范围和对象（ ）",
        options: ["A) 民主党派成员", "B) 少数民族人士", "C) 宗教界人士", "D) 外国友人"],
        answer: ["D"],
        flag: "单选题"
    },
// 32
    {
        title: "从（）到（），是“两个一百年”奋斗目标的历史交汇期。",
        options: ["A) 2020年 2035年", "B) 十九大 二十大", "C) 二十大 二十一大", "D) 2035年 本世纪中叶"],
        answer: ["B"],
        flag: "单选题"
    },
// 33
    {
        title: "建设中国特色社会主义，总布局是（）",
        options: ["A) “四个全面”战略布局", "B) “五位一体”总体布局", "C) “一个中心、两个基本点”", "D) “三步走”发展战略"],
        answer: ["B"],
        flag: "单选题"
    },// 34
    {
        title: "党的__________都无权剥夺党员的权利。",
        options: ["A) 上级组织", "B) 党中央", "C) 任何一级组织直至中央", "D) 地方组织"],
        answer: ["C"],
        flag: "单选题"
    },
// 35
    {
        title: "掌握贯穿其中的( )立场观点方法，增强政治自觉、理论自信、情感融入。建立以学习贯彻习近平新时代中国特色社会主义思想为中心内容的党员教育教材体系。",
        options: ["A) 三个代表", "B) 邓小平理论", "C) 马克思主义", "D) 科学发展观"],
        answer: ["C"],
        flag: "单选题"
    },
    {
        // 36 cont.
        title: "坚持物质文明和精神文明两手抓，实行依法治国和_______相结合。",
        options: ["A) 以德治国", "B) 科教兴国", "C) 实践建国"],
        answer: ["A"],
        flag: "单选题"
    },
    {
        // 37 cont.
        title: "以下那一项不是十九大的大会主题__________",
        options: ["A) 不忘初心，牢记使命", "B) 高举中国特色社会主义伟大旗帜", "C) 全面深化改革开放"],
        answer: ["C"],
        flag: "单选题"
    },
    {
        // 38 cont.
        title: "中国共产党坚持独立自主的和平外交政策，坚持和平发展道路，坚持________的开放战略，统筹________两个大局，积极发展对外关系。",
        options: ["A) 互利共赢、国内国际", "B) 互惠互利、国内国际", "C) 互利共赢、内地外地"],
        answer: ["A"],
        flag: "单选题"
    },
    {
        // 39 cont.
        title: "党的十八大报告强调，全党必须更加自觉地把推动经济社会发展作为深入贯彻落实科学发展观的（ ）",
        options: ["A) 根本方法", "B) 核心立场", "C) 第一要义"],
        answer: ["C"],
        flag: "单选题"
    },
    {
        // 40 cont.
        title: "党员的党龄，从_______之日算起。",
        options: ["A) 从递交入党志愿书", "B) 支部大会通过其为预备党员", "C) 预备期满转为正式党员"],
        answer: ["C"],
        flag: "单选题"
    },
    {
        // 41 cont.
        title: "党的十八大以来，以习近平同志为核心的党中央在（）方面提出了一系列新理念新思想新方略。",
        options: ["A) 经济建设", "B) 政治建设", "C) 文化建设", "D) 社会建设"],
        answer: ["A", "B", "C", "D"],
        flag: "多选题"
    },
    {
        // 42 cont.
        title: "党的纪律主要包括：",
        options: ["A) 政治纪律、组织纪律", "B) 廉洁纪律、群众纪律", "C) 工作纪律、生活纪律"],
        answer: ["A", "B", "C"],
        flag: "多选题"
    },
    {
        // 43 cont.
        title: "党员在留党察看期间，没有以下哪些权利（）。",
        options: ["A) 表决权", "B) 言论自由权", "C) 选举权", "D) 被选举权"],
        answer: ["A", "C", "D"],
        flag: "多选题"
    },
    {
        // 44 cont.
        title: "地方各级党委和部门单位党组（党委）领导本地区本部门本单位党员教育管理工作，贯彻执行党中央关于党员教育管理工作的方针政策和部署要求，_____________,有针对性地提出工作措施。 ( )",
        options: ["A) 定期研究党员教育管理工作", "B) 分析党员队伍状况", "C) 组织编写全国党员教育基本教材", "D) 组织安排党员教育讲师到基层授课"],
        answer: ["A", "B"],
        flag: "多选题"
    },
    {
        // 45 cont.
        title: "加强党的宗旨教育，要引导党员___________，密切联系服务群众。( )",
        options: ["A) 践行全心全意为人民服务的根本宗旨", "B) 弘扬党的优良传统", "C) 贯彻党的群众路线", "D) 提高群众工作本领"],
        answer: ["A", "C", "D"],
        flag: "多选题"
    },
    {
        // 46 cont.
        title: "全面建设小康社会的含义是（）。",
        options: ["A) 人均国内生产总值达到8000美元", "B) 国内生产总值到2020年力争比2000年翻两番。", "C) 社会主义民主和法制更加完善，人民的权益得到切实尊重和保障", "D) 全民族的整体素质明显提高"],
        answer: ["B", "C", "D"],
        flag: "多选题"
    },
    {
        // 47 cont.
        title: "党的纪律主要包括政治纪律、（）、生活纪律。",
        options: ["A) 组织纪律；", "B) 廉洁纪律；", "C) 群众纪律；", "D) 工作纪律；"],
        answer: ["A", "B", "C", "D"],
        flag: "多选题"
    },
    {
        title: "《党章》第三十四条规定，党的各级领导干部要加强道德修养，做到________，反对官僚主义，反对任何滥用职权、谋求私利的不正之风。",
        options: ["A) 自重", "B) 自省", "C) 自警", "D) 自励"],
        answer: ["A", "B", "C", "D"],
        flag: "多选题"
    },
    {
        // 49 cont.
        title: "有下列情形之一的，可以从轻或者减轻处分（）",
        options: ["A) 主动交代本人应当受到党纪处分的问题", "B) 检举同案人或者其他人应当受到党纪处分或者法律追究的问题，经查证属实的", "C) 主动挽回损失、消除不良影响或者有效阻止危害结果发生的", "D) 主动上交违纪所得的"],
        answer: ["A", "B", "C", "D"],
        flag: "多选题"
    },
    {
        // 50 cont.
        title: "习近平总书记在党的十九大报告提出了“四个伟大”，分别是指()",
        options: ["A) 伟大斗争；", "B) 伟大工程；", "C) 伟大事业；", "D) 伟大梦想；"],
        answer: ["A", "B", "C", "D"],
        flag: "多选题"
    },
    {
        // 51 cont.
        title: "党组织在纪律审查中发现党员有贪污贿赂、失职渎职等刑法规定的行为涉嫌犯罪的，应当给予（）。",
        options: ["A) 撤销党内职务", "B) 留党察看", "C) 严重警告", "D) 开除党籍"],
        answer: ["A", "B", "D"],
        flag: "多选题"
    },
    {
        // 52 cont.
        title: "坚持和发展中国特色社会主义总任务是（）和（）。",
        options: ["A) 进入社会主义中级阶段；", "B) 实现社会主义现代化；", "C) 中华民族伟大复兴；", "D) 促进共同富裕；"],
        answer: ["B", "C"],
        flag: "多选题"
    },
    {
        // 53 cont.
        title: "发现党员有思想、工作、生活、作风和纪律方面苗头性倾向性问题的，以及群众对其有不良反映的，党组织负责人应当及时进行( )",
        options: ["A) 对劝其退党", "B) 提醒谈话", "C) 抓早抓小", "D) 防微杜渐"],
        answer: ["B", "C", "D"],
        flag: "多选题"
    },
    {
        // 54 cont.
        title: "突出政治教育和政治训练，严格党内政治生活锻炼，教育党员旗帜鲜明讲政治，提高政治觉悟和政治能力，严守政治纪律和政治规矩，永葆共产党人政治本色，做到“四个服从”，在_____________,同以习近平同志为核心的党中央保持高度一致。",
        options: ["A) 思想上", "B) 政治上", "C) 生活上", "D) 行动上"],
        answer: ["A", "B", "D"],
        flag: "多选题"
    },
    {
        // 55 cont.
        title: "下列哪些情形应当从重或者加重处分?",
        options: ["A) 在纪律集中整饬过程中，不收敛、不收手的", "B) 强迫、唆使他人违纪的", "C) 本条例另有规定的", "D) 如实坦白交代的"],
        answer: ["A", "B", "C"],
        flag: "多选题"
    },
    {
        // 56 cont.
        title: "坚持全心全意为人民服务，必须坚持______。",
        options: ["A) 权为民所用", "B) 情为民所系", "C) 利为民所谋", "D) 心为民所系"],
        answer: ["A", "B", "C"],
        flag: "多选题"
    },
    {
        // 57 cont.
        title: "正式党员不足3人的单位，应当按照（ ）的原则，成立联合党支部。",
        options: ["A) 地域相邻", "B) 行业相近", "C) 规模适当", "D) 便于管理"],
        answer: ["A", "B", "C", "D"],
        flag: "多选题"
    },
    {
        // 58 cont.
        title: "流动党员较多，工作地或者居住地相对固定集中，应当由流出地党组织商流入地党组织，依托（）等成立流动党员党支部。",
        options: ["A) 社区", "B) 园区", "C) 商会", "D) 协会"],
        answer: ["B", "C", "D"],
        flag: "多选题"
    },
    {
        title: "党的建设必须坚决实现的基本要求包括：______",
        options: ["A) 坚持党的基本路线", "B) 坚持解放思想，实事求是，与时俱进，求真务实", "C) 坚持全心全意为人民服务", "D) 坚持民主集中制"],
        answer: ["A", "B", "C", "D"],
        flag: "多选题"
    },
    {
        // 60 cont.
        title: "_______________是中国特色社会主义理论体系的精髓。",
        options: ["A) 解放思想", "B) 实事求是", "C) 与时俱进", "D) 求真务实"],
        answer: ["A", "B", "C", "D"],
        flag: "多选题"
    }
]
const data_9 = [
    // 11.
    {
        title: "社会主义核心价值观是当代中国精神的集中体现，凝结着全体人民共同的价值追求。",
        options: ["A) 正确", "B) 错误"],
        answer: ["A"],
        flag: "单选题"
    },

// 12.
    {
        title: "我国社会主义政治制度优越性的一个突出特点，就是坚持党总揽全局、协调各方的领导核心地位。",
        options: ["A) 正确", "B) 错误"],
        answer: ["A"],
        flag: "单选题"
    },

// 13.
    {
        title: "党员是党的基础组织。",
        options: ["A) 正确", "B) 错误"],
        answer: ["B"],
        flag: "单选题"
    },

// 14.
    {
        title: "解放思想、实事求是、与时俱进，是马克思主义活的灵魂，是我们适应新形势、认识新事物、完成新任务的根本思想武器。",
        options: ["A) 正确", "B) 错误"],
        answer: ["A"],
        flag: "单选题"
    },

// 15.
    {
        title: "党的处分包括分为警告、严重警告、留党察看、开除党籍。",
        options: ["A) 正确", "B) 错误"],
        answer: ["B"],
        flag: "单选题"
    },

// 16.
    {
        title: "党员经过留党察看，坚持错误不改的，应当严重警告。",
        options: ["A) 正确", "B) 错误"],
        answer: ["B"],
        flag: "单选题"
    },

// 17.
    {
        title: "对因私出国并在国外长期定居的党员，出国学习研究超过5年仍未返回的党员，一般予以停止党籍。停止党籍的决定由保留其组织关系的党组织按照有关规定作出。",
        options: ["A) 正确", "B) 错误"],
        answer: ["A"],
        flag: "单选题"
    },

// 18.
    {
        title: "预备党员不履行党员义务，不具备党员条件的，应当取消预备党员资格。",
        options: ["A) 正确", "B) 错误"],
        answer: ["A"],
        flag: "单选题"
    },

// 19.
    {
        title: "统一战线，是指中国共产党领导的、以工农联盟为基础的，包括全体社会主义劳动者、社会主义事业建设者、拥护社会主义爱国者、拥护祖国统一和致力于中华民族伟大复兴爱国者的联盟。",
        options: ["A) 正确", "B) 错误"],
        answer: ["A"],
        flag: "单选题"
    },

// 20.
    {
        title: "党章规定，党的最高领导机关是党的全国代表大会。",
        options: ["A) 正确", "B) 错误"],
        answer: ["B"],
        flag: "单选题"
    }
    ,
    // 21
    {
        title: "十八届六中全会认为党要管党必须从（）管起。",
        options: ["A) 党员领导干部", "B) 个人重大事项报告", "C) 党内政治生活", "D) 中央政治局委员"],
        answer: ["C"],
        flag: "单选题"
    },
// 22
    {
        title: "开展形势政策教育，围绕贯彻执行党和国家重大决策、推进落实重大任务，宣讲党的路线方针政策，解读世情国情党情，回应党员关注的问题，引导党员正确认识形势，把（）和行动统一到党中央要求上来。",
        options: ["A) 思想", "B) 修养", "C) 素质", "D) 内涵"],
        answer: ["A"],
        flag: "单选题"
    },
// 23
    {
        title: "党章规定，申请入党的同志，必须年满_________岁。",
        options: ["A) 16", "B) 17", "C) 18", "D) 19"],
        answer: ["C"],
        flag: "单选题"
    },
// 24
    {
        title: "党支部书记每年应当至少参加（ ）次县级以上党组织举办的集中轮训。",
        options: ["A) 1", "B) 2", "C) 3", "D) 4"],
        answer: ["A"],
        flag: "单选题"
    },
// 25
    {
        title: "十八届六中全会认为办好中国的事情，关键在（）。",
        options: ["A) 企业", "B) 依法治国", "C) 党的建设", "D) 党"],
        answer: ["D"],
        flag: "单选题"
    },
// 26
    {
        title: "预备党员必须面向_______进行入党宣誓。",
        options: ["A) 党支部所有成员", "B) 党旗", "C) 党徽", "D) 支部书记"],
        answer: ["B"],
        flag: "单选题"
    },
// 27
    {
        title: "党组织讨论决定问题，必须执行_______原则。",
        options: ["A) 少数服从多数", "B) 成员服从领导", "C) 下级服从上级", "D) 个人服从集体"],
        answer: ["A"],
        flag: "单选题"
    },
// 28
    {
        title: "村、社区党支部委员会每届任期5年，其他基层单位党支部委员会一般每届任期（）年。",
        options: ["A) 2", "B) 3", "C) 4", "D) 5"],
        answer: ["B"],
        flag: "单选题"
    },
// 29
    {
        title: "坚持( )相结合，依托党员教育管理信息化平台，开展党员信息管理、党组织活动指导管理、流动党员管理服务、发展党员管理和党费管理等业务应用，为党员提供在线学习培训、转接组织关系、参与党内事务和关怀帮扶等服务。",
        options: ["A) 线上和线下", "B) 网上和网下", "C) 中央和地方", "D) 总体和局部"],
        answer: ["B"],
        flag: "单选题"
    },
// 30
    {
        title: "党小组会一般（ ）召开1次，组织党员参加政治学习、谈心谈话、开展批评和自我批评等。",
        options: ["A) 一周", "B) 一月", "C) 三分之二", "D) 全部"],
        answer: ["B"],
        flag: "单选题"
    },
// 31
    {
        title: "党的支部委员会对申请入党的人，要注意征求党内外有关群众的意见，进行严格的审查，认为合格后直接提交_______讨论。",
        options: ["A) 上级党委", "B) 党支部大会", "C) 支部委员会", "D) 支部书记"],
        answer: ["B"],
        flag: "单选题"
    },
// 32
    {
        title: "全面依法治国，（）在于坚持党领导立法、保证执法、支持司法、带头守法。",
        options: ["A) 核心", "B) 关键", "C) 重点", "D) 前提"],
        answer: ["B"],
        flag: "单选题"
    },
// 33
    {
        title: "中国共产党党徽为镰刀和_______组成的图案。",
        options: ["A) 斧头", "B) 火炬", "C) 五星", "D) 锤子"],
        answer: ["D"],
        flag: "单选题"
    },
// 34
    {
        title: "新时期爱国统一战线的主体和基础是（）",
        options: ["A) 大陆范围内建设者和爱国者的联盟", "B) 大陆范围内全体劳动者、建设者和爱国者的联盟", "C) 大陆同台湾同胞，港澳同胞和海外侨胞的联盟", "D) 大陆范围内全体劳动者者同台湾同胞和海外侨胞的联盟"],
        answer: ["B"],
        flag: "单选题"
    },
// 35
    {
        title: "中国特色社会主义进入新时代，我国社会主要矛盾已经转化为人民日益增长的（）需要和（）的发展之间的矛盾。",
        options: ["A) 美好生活 不充分不平衡", "B) 幸福生活 不平衡不充分", "C) 幸福生活 不充分不平衡", "D) 美好生活 不平衡不充分"],
        answer: ["D"],
        flag: "单选题"
    },
// 36
    {
        title: "统一战线工作的根本任务是（ ），为实现党和国家的宏伟目标而团结奋斗。",
        options: ["A) 凝聚人心、汇聚力量", "B) 大团结、大联合", "C) 为社会主义的经济、政治、文化服务"],
        answer: ["A"],
        flag: "单选题"
    },
// 37
    {
        title: "党的十八大报告强调，我们在任何情况下都要牢牢把握社会主义初级阶段这个最大国情，推进任何方面的改革发展都要牢牢立足社会主义初级阶段这个（）",
        options: ["A) 根本判断", "B) 主要国情", "C) 最大实际"],
        answer: ["C"],
        flag: "单选题"
    },
// 38
    {
        title: "坚持中国共产党在统一战线中的（ ）是统一战线最根本的问题。",
        options: ["A) 主导地位", "B) 领导权", "C) 发言权"],
        answer: ["A"],
        flag: "单选题"
    },
// 39
    {
        title: "统一战线工作的根本任务是______________，为实现党和国家的宏伟目标而团结奋斗。",
        options: ["A) 凝聚人心、汇聚力量", "B) 大团结、大联合", "C) 为社会主义的经济、政治、文化服务"],
        answer: ["C"],
        flag: "单选题"
    },
// 40
    {
        title: "各级党委主管统一战线工作的职能部门是（ ）。",
        options: ["A) 办公厅（室）", "B) 宣传部", "C) 统战部"],
        answer: ["C"],
        flag: "单选题"
    },
    // 41
    {
        title: "党支部应当严格执行党的组织生活制度，经常、认真、严肃地开展批评和自我批评，增强党内政治生活的（ ）。",
        options: ["A) 政治性", "B) 时代性", "C) 原则性", "D) 战斗性"],
        answer: ["A", "B", "C", "D"],
        flag: "多选题"
    },
// 42
    {
        title: "党员享有下列哪些权利：",
        options: ["A) 参加党的会议", "B) 对党的工作提出建议和倡议", "C) 行使表决权、选举权，有被选举权", "D) 自觉遵守党的纪律"],
        answer: ["A", "B", "C"],
        flag: "多选题"
    },
// 43
    {
        title: "中国共产党要领导全国各族人民实现“两个一百年”奋斗目标，“两个一百年”指的是：______。",
        options: ["A) 抗日战争胜利一百年", "B) 建党一百年", "C) 新中国成立一百年", "D) 改革开放一百年"],
        answer: ["B", "C"],
        flag: "多选题"
    },
// 44
    {
        title: "党员在留党察看期间，没有以下哪些权利：",
        options: ["A) 表决权", "B) 言论自由权", "C) 选举权", "D) 被选举权"],
        answer: ["A", "C", "D"],
        flag: "多选题"
    },
// 45
    {
        title: "县级以上党委管理的党费每年应当按照一定比例下拨到党支部，重点支持（ ）等开展党的活动。",
        options: ["A) 贫困村党支部", "B) 困难国有企业党支部", "C) 非公有制经济组织和社会组织党支部", "D) 流动党员党支部"],
        answer: ["A", "B", "C", "D"],
        flag: "单选题"
    },
// 46
    {
        title: "临时党支部主要组织党员开展政治学习，（ ）党员，对入党积极分子进行教育培养等。",
        options: ["A) 教育", "B) 管理", "C) 监督", "D) 培养"],
        answer: ["A", "B", "C"],
        flag: "多选题"
    },
// 47
    {
        title: "党支部应当组织党员按期参加（ ）",
        options: ["A) 党员大会", "B) 党小组会", "C) 党员培训", "D) 上党课"],
        answer: ["A", "B", "D"],
        flag: "多选题"
    },
// 48
    {
        title: "注重知识技能教育，根据党员岗位职责要求和工作需要，组织引导党员学习_______ _____等，帮助党员提高综合素质和履职能力，增强服务本领。( )",
        options: ["A) 党的创新理论", "B) 掌握业务知识", "C) 科技知识", "D) 实用技术"],
        answer: ["B", "C", "D"],
        flag: "多选题"
    },
// 49
    {
        title: "全党同志要高举中国特色社会主义伟大旗帜，坚定（ ），贯彻党的基本理论、基本路线、基本方略",
        options: ["A) 道路自信", "B) 政治自信", "C) 理论自信", "D) 文化自信"],
        answer: ["A", "C", "D"],
        flag: "多选题"
    },
// 50
    {
        title: "有下列情形之一的，可以从轻或者减轻处分：",
        options: ["A) 主动交代本人应当受到党纪处分的问题", "B) 检举同案人或者其他人应当受到党纪处分或者法律追究的问题，经查证属实的", "C) 主动挽回损失、消除不良影响或者有效阻止危害结果发生的", "D) 主动上交违纪所得的"],
        answer: ["A", "B", "C", "D"],
        flag: "多选题"
    },
// 51
    {
        title: "文化软实力集中体现了一个国家基于文化而具有的___和___。",
        options: ["A) 创造力", "B) 软实力", "C) 凝聚力", "D) 生命力"],
        answer: ["C", "D"],
        flag: "多选题"
    },
// 52
    {
        title: "党的四项基本原则是",
        options: ["A) 坚持社会主义道路", "B) 坚持人民民主专政", "C) 坚持中国共产党的领导", "D) 坚持马克思列宁主义毛泽东思想"],
        answer: ["A", "B", "C", "D"],
        flag: "多选题"
    },// 53
    {
        title: "以下哪些是构成新时代坚持和发展中国特色社会主义的基本方略",
        options: ["A) 坚持党对一切工作的领导。",
            "B) 坚持以人民为中心；",
            "C) 坚持全面深化改革。",
            "D) 坚持在社会主义核心价值体系；"],
        answer: ["A", "B", "C", "D"],
        flag: "多选题"
    },

// 54
    {
        title: "党的纪律处分工作应当坚持以下原则：",
        options: ["A) 党要管党，从严治党",
            "B) 党纪面前一律平等",
            "C) 实事求是",
            "D) 民主集中制"],
        answer: ["A", "B", "C", "D"],
        flag: "多选题"
    },

// 55
    {
        title: "要适应改革开放和社会主义现代化建设的要求，坚持________，加强和改善党的领导。",
        options: ["A) 科学执政",
            "B) 民主执政",
            "C) 依法执政",
            "D) 从严执政"],
        answer: ["A", "B", "C"],
        flag: "多选题"
    },

// 56
    {
        title: "加强政治理论教育，突出党的创新理论学习，组织党员学习党的基本理论、_____、基本方略，_______，引导党员坚定理想信念，增强党性修养，努力掌握并自觉运用马克思主义立场观点方法。",
        options: ["A) 基本思想",
            "B) 基本路线",
            "C) 强化党章党规党纪教育",
            "D) 学习马克思主义基本原理和党的基本知识"],
        answer: ["B", "D"],
        flag: "多选题"
    },

// 57
    {
        title: "党员廉洁自律规范包括（）。",
        options: ["A) 坚持公私分明，先公后私，克己奉公",
            "B) 坚持崇廉拒腐，清白做人，干净做事",
            "C) 坚持尚俭戒奢，艰苦朴素，勤俭节约",
            "D) 坚持吃苦在前，享受在后，甘于奉献"],
        answer: ["A", "B", "C", "D"],
        flag: "多选题"
    },

// 58
    {
        title: "弘扬理论联系实际的马克思主义学风，引导党员_____________学以致用、知行合一，提高政治站位，强化责任担当，增强过硬本领，做好本职工作，自觉做习近平新时代中国特色社会主义思想坚定信仰者和忠实实践者。( )",
        options: ["A) 把自己摆进去",
            "B) 把职责摆进去",
            "C) 把态度摆进去",
            "D) 把工作摆进去"],
        answer: ["A", "B", "D"],
        flag: "多选题"
    },

// 59
    {
        title: "党员教育管理工作要遵循哪些原则？（ ）",
        options: ["A) 坚持党要管党、全面从严治党，将严的要求落实到党员教育管理工作全过程和各方面，党员领导干部带头接受教育管理；",
            "B) 坚持以党的政治建设为统领，突出党性教育和政治理论教育，引导党员遵守党章党规党纪，不忘初心、牢记使命；",
            "C) 坚持围绕中心、服务大局，注重党员教育管理质量和实效，保证党的理论和路线方针政策、党中央决策部署贯彻落实；",
            "D) 坚持从实际出发，加强分类指导，尊重党员主体地位，充分发挥党支部直接教育、管理、监督党员作用。"],
        answer: ["A", "B", "C", "D"],
        flag: "多选题"
    },

// 60
    {
        title: "国家机关和国有企事业单位党组（党委）负责本领域、本单位党外知识分子工作，组织党外知识分子参加统一战线工作和活动。在党委统一领导下，坚持（）的方针，建立由统战部牵头、党政有关部门参加、社会有关团体参与的联席会议制度，做好新的社会阶层中的党外知识分子工作。",
        options: ["A) 充分尊重；",
            "B) 广泛联系；",
            "C) 加强团结；",
            "D) 热情帮助；"],
        answer: ["A", "B", "C", "D"],
        flag: "多选题"
    }

]
const data_10 = [
    // 11.
    {
        title: "我国是由工人阶级领导的、以工农联盟为基础的人民民主专政的社会主义国家。",
        options: ["A) 正确", "B) 错误"],
        answer: ["A"],
        flag: "单选题"
    },

// 12.
    {
        title: "崇高的理想和坚定的信念是青年大学生成才的关键。",
        options: ["A) 正确", "B) 错误"],
        answer: ["A"],
        flag: "单选题"
    },

// 13.
    {
        title: "中国共产党的性质是中国工人阶级的先锋队，同时是中国人民和中华民族的先锋队，是中国特色社会主义事业的领导核心，代表中国先进生产力的发展要求，代表中国先进文化的前进方向，代表中国最广大人民的根本利益。",
        options: ["A) 正确", "B) 错误"],
        answer: ["A"],
        flag: "单选题"
    },

// 14.
    {
        title: "任何一个时代，青年都是社会上最富有朝气、最富有创造性、最富有生命力的群体，都担负着自身的历史使命。",
        options: ["A) 正确", "B) 错误"],
        answer: ["A"],
        flag: "单选题"
    },

// 15.
    {
        title: "党支部党员大会议题提交表决前，可以不讨论。",
        options: ["A) 正确", "B) 错误"],
        answer: ["B"],
        flag: "单选题"
    },

// 16.
    {
        title: "对与党组织失去联系12个月以上、通过各种方式查找仍然没有取得联系的党员，予以停止党籍。",
        options: ["A) 正确", "B) 错误"],
        answer: ["B"],
        flag: "单选题"
    },

// 17.
    {
        title: "预备党员的义务同正式党员一样。",
        options: ["A) 正确", "B) 错误"],
        answer: ["A"],
        flag: "单选题"
    },

// 18.
    {
        title: "实现'两个一百年'奋斗目标、实现中华民族伟大复兴的中国梦，不断提高人民生活水平，必须坚定不移把改革作为党执政兴国的第一要务，坚持解放和发展社会生产力，坚持社会主义市场经济改革方向，推动经济持续健康发展。",
        options: ["A) 正确", "B) 错误"],
        answer: ["B"],
        flag: "单选题"
    },

// 19.
    {
        title: "篡改、伪造个人档案资料的，给予严重警告处分;情节严重的，给予撤销党内职务或者留党察看处分。",
        options: ["A) 正确", "B) 错误"],
        answer: ["A"],
        flag: "单选题"
    },

// 20.
    {
        title: "科学发展观的第一要义是科学。",
        options: ["A) 正确", "B) 错误"],
        answer: ["B"],
        flag: "单选题"
    }
    ,// 21
    {
        title: "中国共产党第十九次全国代表大会，是在全面建成小康社会决胜阶段，中国特色社会主义进入_________的关键时期召开的一次十分重要的大会。",
        options: ["A) 新时期", "B) 新阶段", "C) 新征程", "D) 新时代"],
        answer: ["D"],
        flag: "单选题"
    },
// 22
    {
        title: "（）是中国共产党凝聚人心、汇聚力量的政治优势和战略方针，是夺取革命、建设、改革事业胜利的重要法宝。",
        options: ["A) 改革开放", "B) 实现共同富裕", "C) 统一战线", "D) 实现社会主义现代化"],
        answer: ["C"],
        flag: "单选题"
    },
// 23
    {
        title: "《中国共产党党员教育管理工作条例》自（ ）起施行。",
        options: ["A) 2019年4月5日", "B) 2019年5月6日", "C) 2019年5月7日", "D) 2019年6月5日"],
        answer: ["B"],
        flag: "单选题"
    },
// 24
    {
        title: "（）是中国共产党凝聚人心、汇聚力量的政治优势和战略方针，是夺取革命、建设、改革事业胜利的重要法宝。",
        options: ["A) 改革开放", "B) 实现共同富裕", "C) 统一战线", "D) 实现社会主义现代化"],
        answer: ["C"],
        flag: "单选题"
    },
// 25
    {
        title: "_______是我们党执政兴国的第一要务。",
        options: ["A) 发展", "B) 改革", "C) 反腐", "D) 革命"],
        answer: ["A"],
        flag: "单选题"
    },
// 26
    {
        title: "党员教育基本任务要进行革命传统教育，引导党员学习党史、国史、改革开放史、社会主义发展史和中华优秀传统文化，铭记党的奋斗历程，弘扬党的优良传统，传承( )，践行共产党人价值观，激发爱国主义热情。",
        options: ["A) 蓝色基因", "B) 橙色基因", "C) 红色基因", "D) 黄色基因"],
        answer: ["C"],
        flag: "单选题"
    },
// 27
    {
        title: "各级党委留存的党费主要用于教育培训党员、支持基层党组织开展组织生活。加强对( )、民族地区、边疆地区、贫困地区党员教育管理工作经费支持。",
        options: ["A) 西部地区", "B) 北部地区", "C) 革命老区", "D) 集中地区"],
        answer: ["C"],
        flag: "单选题"
    },
// 28
    {
        title: "乡镇、街道、国有企业、高等学校等基层党委，按照规定配备一定数量的专兼职组织员，由（ ）党委组织部门进行业务指导和管理，承担指导督促发展党员和党员教育管理等工作。",
        options: ["A) 省", "B) 自治区", "C) 直辖市", "D) 县级以上"],
        answer: ["D"],
        flag: "单选题"
    },
// 29
    {
        title: "我国“四个全面”战略布局中不包括：_____",
        options: ["A) 全面建成小康社会", "B) 全面改革开放", "C) 全面依法治国", "D) 全面从严治党"],
        answer: ["B"],
        flag: "单选题"
    },
// 30
    {
        title: "党的中央委员会每届任期______年。",
        options: ["A) 2", "B) 3", "C) 4", "D) 5"],
        answer: ["D"],
        flag: "单选题"
    },
// 31
    {
        title: "坚持四项基本原则的核心是坚持__________。",
        options: ["A) 社会主义道路", "B) 人民民主专政", "C) 中国共产党的领导", "D) 马克思列宁主义毛泽东思想"],
        answer: ["C"],
        flag: "单选题"
    },
// 32
    {
        title: "党的( )以来，以习近平同志为核心的党中央高度重视加强党员教育管理工作，推动形成全党从严从实抓党员教育管理的良好态势。",
        options: ["A) 十六大", "B) 十七大", "C) 十八大", "D) 十九大"],
        answer: ["A"],
        flag: "单选题"
    },
// 33
    {
        title: "党支部党员大会议题提交表决前，应当经过充分讨论。表决必须有（ ）以上有表决权的党员到会方可进行，赞成人数超过应到会有表决权的党员的（ ）为通过。",
        options: ["A) 三分之一", "B) 半数", "C) 三分之二", "D) 五分之一"],
        answer: ["A"],
        flag: "单选题"
    },
// 34
    {
        title: "申请入党的人，要有（ ）名正式党员作为介绍人",
        options: ["A) 1", "B) 2", "C) 3", "D) 4"],
        answer: ["B"],
        flag: "单选题"
    },
// 35
    {
        title: "“十三五”时期，我国经济发展的显著特征就是进入（ ）。",
        options: ["A) 新阶段", "B) 新形态", "C) 新常态", "D) 新业态"],
        answer: ["C"],
        flag: "单选题"
    },
// 36
    {
        title: "中国共产党第十八次全国代表大会，是在我国进入（ ）小康社会决定性阶段召开的一次十分重要的大会",
        options: ["A) 全面建设", "B) 全面建成", "C) 全面建立"],
        answer: ["B"],
        flag: "单选题"
    },
// 37
    {
        title: "党的十八大报告强调，我们坚定不移高举中国特色社会主义伟大旗帜，既不走封闭僵化的老路、也不走（）的邪路。",
        options: ["A) 资本主义", "B) 改旗易帜", "C) 改弦更张"],
        answer: ["B"],
        flag: "单选题"
    },
// 38
    {
        title: "中国共产党坚持独立自主的和平外交政策，坚持和平发展道路，坚持________的开放战略，统筹________两个大局，积极发展对外关系。",
        options: ["A) 互利共赢、国内国际", "B) 互惠互利、国内国际", "C) 互利共赢、内地外地"],
        answer: ["A"],
        flag: "单选题"
    },
// 39
    {
        title: "中国共产党坚持独立自主的和平外交政策，坚持和平发展道路，坚持________的开放战略，统筹________两个大局，积极发展对外关系。",
        options: ["A) 互利共赢、国内国际", "B) 互惠互利、国内国际", "C) 互利共赢、内地外地"],
        answer: ["A"],
        flag: "单选题"
    },
// 40
    {
        title: "坚持中国共产党在统一战线中的_________是统一战线最根本的问题。",
        options: ["A) 主导地位", "B) 领导权", "C) 发言权"],
        answer: ["A"],
        flag: "单选题"
    }
    ,// 41
    {
        title: "对党员的纪律处分种类，包括（）",
        options: ["A) 警告",
            "B) 严重警告",
            "C) 撤销党内职务",
            "D) 留党察看"],
        answer: ["A", "B", "C", "D"],
        flag: "多选题"
    },

// 42
    {
        title: "党组织应当加强党员教育管理，引导党员坚定共产主义远大理想和中国特色社会主义共同理想，增强____、坚定____、做到____，增强党性，提高素质，认真履行义务，正确行使权利，充分发挥先锋模范作用。",
        options: ["A) “四个意识”",
            "B) “两学一做”",
            "C) “四个自信”",
            "D) ”两个维护”"],
        answer: ["A", "C", "D"],
        flag: "多选题"
    },

// 43
    {
        title: "统一战线工作范围和对象是（）。",
        options: ["A) 民主党派成员；",
            "B) 无党派人士；",
            "C) 党外知识分子；",
            "D) 少数民族人士；"],
        answer: ["A", "B", "C"],
        flag: "多选题"
    },

// 44
    {
        title: "党支部工作必须遵循（ ）项原则。",
        options: ["A) 坚持以马克思列宁主义、毛泽东思想等重要思想为指导，遵守党章，加强思想理论武装，坚定理想信念，不忘初心、牢记使命，始终保持先进性和纯洁性。",
            "B) 坚持把党的政治建设摆在首位",
            "C) 坚持践行党的宗旨和群众路线",
            "D) 坚持民主集中制"],
        answer: ["A", "B", "C", "D"],
        flag: "多选题"
    },

// 45
    {
        title: "“三会一课”应当突出（ ）",
        options: ["A) 政治学习",
            "B) 政治意识",
            "C) 党性锻炼",
            "D) 政治教育"],
        answer: ["A", "C", "D"],
        flag: "多选题"
    },

// 46
    {
        title: "统战部应当加强同政协组织的沟通协调配合，加强对民族、宗教工作部门和参事室、文史研究馆的工作指导，支持配合（）等工作部门做好相关工作。",
        options: ["A) 外事；",
            "B) 对台；",
            "C) 侨务；",
            "D) 港澳；"],
        answer: ["A", "B", "C", "D"],
        flag: "多选题"
    },

// 47
    {
        title: "我国的“四个全面”战略布局包括：______",
        options: ["A) 全面建成小康社会",
            "B) 全面深化改革",
            "C) 全面依法治国",
            "D) 全面从严治党"],
        answer: ["A", "B", "C", "D"],
        flag: "多选题"
    },

// 48
    {
        title: "党员必须履行下列义务（）。",
        options: ["A) 认真学习马克思列宁主义、毛泽东思想、邓小平理论 ；",
            "B) 自觉遵守党的纪律",
            "C) 切实开展批评和自我批评；",
            "D) 发扬社会主义新风尚，弘扬社会主义核心价值观 ；"],
        answer: ["A", "B", "C", "D"],
        flag: "多选题"
    },

// 49
    {
        title: "新形势下，党面临的考验包括：____",
        options: ["A) 执政考验",
            "B) 改革开放考验",
            "C) 市场经济考验",
            "D) 外部环境考验"],
        answer: ["A", "B", "C", "D"],
        flag: "多选题"
    },

// 50
    {
        title: "党员领导干部应当坚持更高标准、更严要求，全面学、系统学、贯通学、深入学、跟进学，自觉用以_____、_____、_____，发挥示范带动作用。",
        options: ["A) 理论宣讲",
            "B) 武装头脑",
            "C) 指导实践",
            "D) 推动工作"],
        answer: ["B", "C", "D"],
        flag: "多选题"
    },

// 51
    {
        title: "改革开放以来我们取得一切成绩和进步的根本原因，归结起来就是___________。",
        options: ["A) 坚持党的基本路线",
            "B) 开辟了中国特色社会主义道路",
            "C) 形成了中国特色社会主义理论体系",
            "D) 坚持民主集中制"],
        answer: ["B", "C"],
        flag: "多选题"
    },

// 52
    {
        title: "党的宗教工作基本方针是（）。",
        options: ["A) 全面贯彻党的宗教信仰自由政策；",
            "B) 依法管理宗教事务；",
            "C) 坚持独立自主自办原则；",
            "D) 积极引导宗教与社会主义社会相适应；"],
        answer: ["A", "B", "C", "D"],
        flag: "多选题"
    },

// 53
    {
        title: "新时代我国社会主要矛盾是（ ），必须坚持（ ）的发展思想，不断促进（ ）。",
        options: ["A) 人民日益增长的美好生活需要和不平衡不充分的发展之间的矛盾",
            "B) 以人民为中心",
            "C) 人的全面发展和全体人民共同富裕",
            "D) 社会主义经济建设"],
        answer: ["A", "B", "C"],
        flag: "多选题"
    },

// 54
    {
        title: "加强县级党校（行政学校）和基层党校建设。县级党校（行政学校）应当将党员集中培训作为重要任务，有计划地组织安排党员教育讲师到基层授课。注重发挥_______的作用。",
        options: ["A) 党群服务中心",
            "B) 基层党组织",
            "C) 党员干部教育培训基地",
            "D) 新时代文明实践中心"],
        answer: ["A", "B", "C", "D"],
        flag: "多选题"
    },

// 55
    {
        title: "对于全面从严治党，（）是党自我净化、自我完善、自我革新、自我提高的根本途径，（）则是实现改革发展目标的根本保证，增强从严治党的系统性、预见性、创造性、实效性，锻造我们事业更加坚强的领导核心。",
        options: ["A) 改革；",
            "B) 经济建设；",
            "C) 政治建设；",
            "D) 党的领导；"],
        answer: ["A", "D"],
        flag: "多选题"
    },

// 56
    {
        title: "中国共产党在新时期面临的三大历史任务为( )。",
        options: ["A) 发展生产力",
            "B) 推进现代化建设",
            "C) 完成祖国统一",
            "D) 维护世界和平与促进共同发展"],
        answer: ["B", "C", "D"],
        flag: "多选题"
    },

// 57
    {
        title: "违反有关规定等，对直接责任者和领导责任者，情节较轻的，给予警告或者严重警告处分;情节较重的，给予撤销党内职务或者留党察看处分;情节严重的，给予开除党籍处分。",
        options: ["A) 自定薪酬",
            "B) 滥发津贴",
            "C) 滥发补贴",
            "D) 滥发奖金"],
        answer: ["A", "B", "C", "D"],
        flag: "多选题"
    },

// 58
    {
        title: "健全人民当家作主制度体系，发展社会主义民主政治，必须要（）。",
        options: ["A) 坚持党的领导、人民当家作主、依法治国有机统一；",
            "B) 加强人民当家作主制度保障；",
            "C) 发挥社会主义协商民主重要作用；",
            "D) 简化机构和行政体制改革；"],
        answer: ["A", "B", "C"],
        flag: "多选题"
    },

// 59
    {
        title: "《中国共产党党员教育管理工作条例》的制定和实施，对于________,实现党伟大执政使命，具有十分重要的意义。",
        options: ["A) 提高党员队伍建设质量",
            "B) 激发党组织的生机活力",
            "C) 推动全面从严治党向纵深发展",
            "D) 夯实党长期执政基础"],
        answer: ["A", "B", "C", "D"],
        flag: "多选题"
    },

// 60
    {
        title: "党员应当主动学网用网，依托各类党员教育管理信息化平台，_______。",
        options: ["A) 积极参加在线学习培训",
            "B) 认真参加党组织的活动",
            "C) 做好教育培训、管理服务等工作",
            "D) 自觉接受党组织的教育管理"],
        answer: ["A", "B", "D"],
        flag: "多选题"
    }

]
const data_11 =  [
// 12
    {
        title: "临时党支部一般不发展党员、处分处置党员，不收缴党费，不选举党代表大会代表和进行换届。",
        options: ["A) 正确", "B) 错误"],
        answer: ["A"],
        flag: "单选题"
    },
// 13
    {
        title: "对缺乏革命意志，不履行党员义务，不符合党员条件，但本人能够正确认识错误、愿意接受教育管理并且决心改正的党员，党组织应当作出限期改正处置，限期改正时间不超过2年。对给予限期改正处置的党员应当采取帮助教育措施。",
        options: ["A) 正确", "B) 错误"],
        answer: ["B"],
        flag: "单选题"
    },
// 14
    {
        title: "中国特色社会主义的本质要求和重要保障是全面深化改革。",
        options: ["A) 正确", "B) 错误"],
        answer: ["B"],
        flag: "单选题"
    },
// 15
    {
        title: "中国共产党领导的多党合作和政治协商制度是我国的一项根本政治制度。中国共产党同各民主党派实行长期共存、互相监督、肝胆相照、荣辱与共的基本方针。",
        options: ["A) 正确", "B) 错误"],
        answer: ["B"],
        flag: "单选题"
    },
// 16
    {
        title: "不履行党的义务，不符合党员条件的党员被劝告退党后坚持不退，不能讲其除名。",
        options: ["A) 正确", "B) 错误"],
        answer: ["A"],
        flag: "单选题"
    },
// 17
    {
        title: "坚持党的基本路线不动摇，关键是坚持以经济建设中心不动摇",
        options: ["A) 正确", "B) 错误"],
        answer: ["A"],
        flag: "单选题"
    },
// 18
    {
        title: "预备党员的预备期是从写入党志愿书当天算起。",
        options: ["A) 正确", "B) 错误"],
        answer: ["B"],
        flag: "单选题"
    },
// 19
    {
        title: "党支部党员大会是党支部的议事决策机构，由主要党员参加，一般每季度召开1次。",
        options: ["A) 正确", "B) 错误"],
        answer: ["B"],
        flag: "单选题"
    },
// 20
    {
        title: "预备党员的预备期一般为一年。",
        options: ["A) 正确", "B) 错误"],
        answer: ["A"],
        flag: "单选题"
    },
// 21
    {
        title: "民族工作的根本要求是：坚定不移走中国特色解决民族问题的正确道路，坚持中国共产党的领导，坚持中国特色社会主义道路，坚持维护祖国统一，坚持各民族一律平等，坚持和完善民族区域自治制度。",
        options: ["A) 正确", "B) 错误"],
        answer: ["A"],
        flag: "单选题"
    }

]
const data_12 =[
    {
        // 11
        title: "发现党员有思想、工作、生活、作风和纪律方面苗头性倾向性问题的，以及群众对其有不良反映的，党组织负责人应当及时进行提醒谈话，抓早抓小、防微杜渐。",
        options: ["A) 正确", "B) 错误"],
        answer: ["A"],
        flag: "单选题"
    },
    {
        // 12
        title: "临时党支部主要组织党员开展政治学习，教育、管理、监督党员，对入党积极分子进行教育培养等，一般不发展党员、处分处置党员，不收缴党费，不选举党代表大会代表和进行换届。",
        options: ["A) 正确", "B) 错误"],
        answer: ["A"],
        flag: "单选题"
    },
    {
        // 13
        title: "非公有制经济组织、社会组织，一般从管理层中选任党支部书记，应当注重从业务骨干中选拔党支部书记。",
        options: ["A) 正确", "B) 错误"],
        answer: ["A"],
        flag: "单选题"
    },
    {
        // 14
        title: "抓党支部建设情况应当列入各级党委书记抓基层党建工作述职评议考核的重要内容，作为评判其履行管党治党政治责任情况的重要依据。",
        options: ["A) 正确", "B) 错误"],
        answer: ["A"],
        flag: "单选题"
    },
    {
        // 15
        title: "企业、农村、机关、学校、科研院所、社区、社会组织、人民解放军和武警部队连（中）队以及其他基层单位，凡是有正式党员2人以上的，都应当成立党支部。",
        options: ["A) 正确", "B) 错误"],
        answer: ["B"],
        flag: "单选题"
    },
    {
        // 16
        title: "为期3个月以上的工程、工作项目等，符合条件的，应当成立党支部。",
        options: ["A) 正确", "B) 错误"],
        answer: ["B"],
        flag: "单选题"
    },
    {
        // 17
        title: "村、社区党支部书记纳入县级党委组织部备案管理。",
        options: ["A) 正确", "B) 错误"],
        answer: ["A"],
        flag: "单选题"
    },
    {
        // 18
        title: "中央纪委国家监察机关主要负责党员纪律作风教育，指导开展党员监督，查处党员违犯党的纪律和职务违法、职务犯罪行为。",
        options: ["A) 正确", "B) 错误"],
        answer: ["B"],
        flag: "单选题"
    },
    {
        // 19
        title: "中国共产党在领导社会主义事业中，必须坚持以从严治党为中心。",
        options: ["A) 正确", "B) 错误"],
        answer: ["B"],
        flag: "单选题"
    },
    {
        // 20
        title: "党员领导干部必须接受党内外群众的监督，普通党员则不必接受监督。",
        options: ["A) 正确", "B) 错误"],
        answer: ["B"],
        flag: "单选题"
    }

]
const data_13 =[
    {
        // 11
        title: "创新是引领发展的第一动力，是建设现代化经济体系的战略支撑。",
        options: ["A) 正确", "B) 错误"],
        answer: ["A"],
        flag: "单选题"
    },
    {
        // 12
        title: "对组织关系不在本党支部的流动党员民主评议等情况，应当通报其组织关系所在党支部。",
        options: ["A) 正确", "B) 错误"],
        answer: ["A"],
        flag: "单选题"
    },
    {
        // 13
        title: "党支部每年至少召开1次组织生活会，也可以根据工作需要随时召开，一般以党员大会、党支部委员会会议或者党小组会形式进行。",
        options: ["A) 正确", "B) 错误"],
        answer: ["A"],
        flag: "单选题"
    },
    {
        // 14
        title: "正式党员不足7人的党支部，设1名书记，必要时可以设1名副书记。",
        options: ["A) 正确", "B) 错误"],
        answer: ["A"],
        flag: "单选题"
    },
    {
        // 15
        title: "不忘本来才能开辟未来，善于继承才能更好创新。",
        options: ["A) 正确", "B) 错误"],
        answer: ["A"],
        flag: "单选题"
    },
    {
        // 16
        title: "民主评议党员跟组织生活会必须分开进行。",
        options: ["A) 正确", "B) 错误"],
        answer: ["B"],
        flag: "单选题"
    },
    {
        // 17
        title: "预备党员也可以作入党介绍人。",
        options: ["A) 正确", "B) 错误"],
        answer: ["B"],
        flag: "单选题"
    },
    {
        // 18
        title: "预备党员的预备期，从支部大会通过他为预备党员之日算起。",
        options: ["A) 正确", "B) 错误"],
        answer: ["A"],
        flag: "单选题"
    },
    {
        // 19
        title: "实现中华民族伟大复兴是近代以来中国是近代中华民族最伟大的梦想",
        options: ["A) 正确", "B) 错误"],
        answer: ["A"],
        flag: "单选题"
    },
    {
        // 20
        title: "党支部的成立，一般由基层单位提出申请，县委组织部召开会议研究决定并批复。",
        options: ["A) 正确", "B) 错误"],
        answer: ["B"],
        flag: "单选题"
    }

]
const data_14 =[
    {
        // 11
        title: "党支部委员之间、党支部委员和党员之间、党员和党员之间，每年谈心谈话一般不少于2次。",
        options: ["A) 正确", "B) 错误"],
        answer: ["B"],
        flag: "单选题"
    },
    {
        // 12
        title: "坚持党的领导,是党和国家的根本所在、命脉所在，是全国各族人民的利益所系、幸福所系。",
        options: ["A) 正确", "B) 错误"],
        answer: ["A"],
        flag: "单选题"
    },
    {
        // 13
        title: "为了达到个人目的以退党相要挟，经教育不改的，劝其退党，劝而不退的予以除名。",
        options: ["A) 正确", "B) 错误"],
        answer: ["A"],
        flag: "单选题"
    },
    {
        // 14
        title: "党员没有无义务的权利，但有无权利的义务。",
        options: ["A) 正确", "B) 错误"],
        answer: ["B"],
        flag: "单选题"
    },
    {
        // 15
        title: "领导干部手中的权力是人民赋予的，只能用来为人民谋利益。",
        options: ["A) 正确", "B) 错误"],
        answer: ["A"],
        flag: "单选题"
    },
    {
        // 16
        title: "村、社区重要事项以及与群众利益密切相关的事项，必须经过党支部党员大会讨论。",
        options: ["A) 正确", "B) 错误"],
        answer: ["A"],
        flag: "单选题"
    },
    {
        // 17
        title: "经济体制改革必须以完善产权制度和要素市场化配置为重点，实现产权有效激励、要素自由流动、价格反应灵活、竞争公平有序、企业优胜劣汰。",
        options: ["A) 正确", "B) 错误"],
        answer: ["A"],
        flag: "单选题"
    },
    {
        // 18
        title: "对出国（境）学习研究党员，由原就读高校或者工作单位党组织保留其组织关系，每半年至少与其联系1次。出国（境）学习研究党员返回后按照规定恢复组织生活。",
        options: ["A) 正确", "B) 错误"],
        answer: ["A"],
        flag: "单选题"
    },
    {
        // 19
        title: "党组织应当教育引导党员严格规范网络行为，敢于同网上错误言论作斗争，不得制作、发布、传播违反党的纪律规定和国家法律法规的信息内容。",
        options: ["A) 正确", "B) 错误"],
        answer: ["A"],
        flag: "单选题"
    },
    {
        // 20
        title: "任何党员不论职务高低，都不能个人决定重大问题。",
        options: ["A) 正确", "B) 错误"],
        answer: ["A"],
        flag: "单选题"
    }

]
const data_15 =[
    {
        // 11
        title: "乡镇、街道、国有企业、高等学校等基层党委，按照规定配备一定数量的专兼职组织员，由县级以上党委组织部门进行业务指导和管理，承担指导督促发展党员和党员教育管理等工作。",
        options: ["A) 正确", "B) 错误"],
        answer: ["A"],
        flag: "单选题"
    },
    {
        // 12
        title: "为执行某项任务临时组建的机构，党员组织关系不转接的，经上级党组织批准，可以成立临时党支部。",
        options: ["A) 正确", "B) 错误"],
        answer: ["A"],
        flag: "单选题"
    },
    {
        // 13
        title: "文化是一个国家、一个民族的灵魂，文化自信是一个国家、一个民族发展中更基本、更深远、更持久的力量。",
        options: ["A) 正确", "B) 错误"],
        answer: ["A"],
        flag: "单选题"
    },
    {
        // 14
        title: "坚持党的领导,是党和国家的根本所在、命脉所在，是全国各族人民的利益所系、幸福所系。",
        options: ["A) 正确", "B) 错误"],
        answer: ["A"],
        flag: "单选题"
    },
    {
        // 15
        title: "必须树立和践行绿水青山就是金山银山的理念，坚持节约资源和保护环境的基本国策，统筹山水林田湖草系统治理，实行最严格的生态环境保护制度，形成绿色发展方式和生活方式。",
        options: ["A) 正确", "B) 错误"],
        answer: ["A"],
        flag: "单选题"
    },
    {
        // 16
        title: "党小组组长由党支部指定，也可以由所在党小组党员推荐产生。",
        options: ["A) 正确", "B) 错误"],
        answer: ["A"],
        flag: "单选题"
    },
    {
        // 17
        title: "党员领导干部应当定期为基层党员讲党课，党委（党组）书记每年至少讲1次党课。",
        options: ["A) 正确", "B) 错误"],
        answer: ["A"],
        flag: "单选题"
    },
    {
        // 18
        title: "党的各级委员会实行集体领导和个人分工负责相结合的制度。凡属重大问题都要由党的委员会民主讨论，作出决定。",
        options: ["A) 正确", "B) 错误"],
        answer: ["A"],
        flag: "单选题"
    },
    {
        // 19
        title: "我国仍处于并将长期处于社会主义初级阶段的基本国情没有变，我国是世界最大发展中国家的国际地位没有变。",
        options: ["A) 正确", "B) 错误"],
        answer: ["A"],
        flag: "单选题"
    },
    {
        // 20
        title: "党支部应该每半年开展1次主题党日。",
        options: ["A) 正确", "B) 错误"],
        answer: ["B"],
        flag: "单选题"
    }

]
const data_16 =[
    {
        // 11
        title: "党支部书记、副书记一般由党支部党员大会选举产生。",
        options: ["A) 正确", "B) 错误"],
        answer: ["B"],
        flag: "单选题"
    },
    {
        // 12
        title: "党支部是党的基层组织，担负直接教育党员、管理党员、监督党员和组织群众、宣传群众、凝聚群众、服务群众的职责。",
        options: ["A) 正确", "B) 错误"],
        answer: ["A"],
        flag: "单选题"
    },
    {
        // 13
        title: "农业农村农民问题是关系国计民生的根本性问题，必须始终把解决好\"三农\"问题作为全党工作重中之重。",
        options: ["A) 正确", "B) 错误"],
        answer: ["A"],
        flag: "单选题"
    },
    {
        // 14
        title: "党员教育管理是党的建设基础性经常性工作。",
        options: ["A) 正确", "B) 错误"],
        answer: ["A"],
        flag: "单选题"
    },
    {
        // 15
        title: "坚持党的领导是人民当家作主和依法治国有机统一的根本保证，人民当家作主是社会主义民主政治的本质特征，依法治国是党领导人民治理国家的基本方式，三者统一于我国社会主义民主政治伟大实践。",
        options: ["A) 正确", "B) 错误"],
        answer: ["A"],
        flag: "单选题"
    },
    {
        // 16
        title: "党员的党龄，从预备期满转为正式党员之日算起。",
        options: ["A) 正确", "B) 错误"],
        answer: ["A"],
        flag: "单选题"
    },
    {
        // 17
        title: "党的十八大将生态文明建设写入党章并作出阐述，使中国特色社会主义事业总体布局更加完善，有利于全面推进中国特色社会事业。",
        options: ["A) 正确", "B) 错误"],
        answer: ["A"],
        flag: "单选题"
    },
    {
        // 18
        title: "党的十九届一中全会选举习近平、李克强、栗战书、汪洋、王沪宁、赵乐际、韩正为中央政治局常委。",
        options: ["A) 正确", "B) 错误"],
        answer: ["A"],
        flag: "单选题"
    },
    {
        // 19
        title: "党的最高领导机关是党的全国代表大会和它所产生的中央委员会。",
        options: ["A) 正确", "B) 错误"],
        answer: ["A"],
        flag: "单选题"
    },
    {
        // 20
        title: "根据党组织隶属关系和干部管理权限，上级党组织对任期届满的党支部，一般提前3个月以发函或者电话通知等形式，提醒做好换届准备。",
        options: ["A) 正确", "B) 错误"],
        answer: ["B"],
        flag: "单选题"
    }

]
const data_17 =[
    {
        // 11
        title: "党的纪律是铁的纪律，包含强制性、严肃性和统一性三个含义。",
        options: ["A) 正确", "B) 错误"],
        answer: ["A"],
        flag: "单选题"
    },
    {
        // 12
        title: "党员每年集中学习培训时间一般不少于32学时。",
        options: ["A) 正确", "B) 错误"],
        answer: ["A"],
        flag: "单选题"
    },
    {
        // 13
        title: "党员个人服从党的组织，少数服从多数，下级组织服从上级组织，全党各个组织和全体党员服从党的全国代表大会。",
        options: ["A) 正确", "B) 错误"],
        answer: ["B"],
        flag: "单选题"
    },
    {
        // 14
        title: "党支部应当组织党员按期参加党员大会、党小组会和上党课，随时召开党支部委员会会议。",
        options: ["A) 正确", "B) 错误"],
        answer: ["B"],
        flag: "单选题"
    },
    {
        // 15
        title: "党员如果没有正当理由，连续五个月不参加党的组织生活就被认为是自行脱党。",
        options: ["A) 正确", "B) 错误"],
        answer: ["B"],
        flag: "单选题"
    },
    {
        // 16
        title: "党员教育管理工作经费应当列入地方各级财政预算，结合实际按照党员数量划拨，重点保障农村、社区、非公有制经济组织和社会组织、公共就业和人才服务机构等基层党组织开展党员教育管理，形成稳定的经费保障机制。",
        options: ["A) 正确", "B) 错误"],
        answer: ["A"],
        flag: "单选题"
    },
    {
        // 17
        title: "党员如果没有正当理由，连续六个月不缴纳党费，就被认为是自行脱党。",
        options: ["A) 正确", "B) 错误"],
        answer: ["A"],
        flag: "单选题"
    },
    {
        // 18
        title: "党性和人民性从来都是一致的、统一的。",
        options: ["A) 正确", "B) 错误"],
        answer: ["A"],
        flag: "单选题"
    },
    {
        // 19
        title: "对停止党籍的党员，符合条件的，可以按照规定程序恢复党籍。对劝其退党、劝而不退除名、自行脱党除名、退党除名、开除党籍的，永远不能入党。",
        options: ["A) 正确", "B) 错误"],
        answer: ["B"],
        flag: "单选题"
    },
    {
        // 20
        title: "党组织不得无故拒转拒接党员组织关系。",
        options: ["A) 正确", "B) 错误"],
        answer: ["A"],
        flag: "单选题"
    }

]
const data_18 =[
    {
        // 11
        title: "党支部委员会会议必须每月召开1次，不能根据需要随时召开",
        options: ["A) 正确", "B) 错误"],
        answer: ["B"],
        flag: "单选题"
    },
    {
        // 12
        title: "党员组织关系保留时间一般不超过2年，对符合转出组织关系条件的及时转出。",
        options: ["A) 正确", "B) 错误"],
        answer: ["A"],
        flag: "单选题"
    },
    {
        // 13
        title: "培育和弘扬社会主义核心价值观，不一定要突出道德价值的作用。",
        options: ["A) 正确", "B) 错误"],
        answer: ["B"],
        flag: "单选题"
    },
    {
        // 14
        title: "对要求入党的积极分子进行教育和培养，做好经常性的发展党员工作，发现、培养和推荐党员中的优秀人才。",
        options: ["A) 正确", "B) 错误"],
        answer: ["B"],
        flag: "单选题"
    },
    {
        // 15
        title: "民主集中制是有党的性质和其所肩负的伟大的历史使命决定的。",
        options: ["A) 正确", "B) 错误"],
        answer: ["A"],
        flag: "单选题"
    },
    {
        // 16
        title: "人民身体健康并非全面建成小康社会的重要内涵。",
        options: ["A) 正确", "B) 错误"],
        answer: ["B"],
        flag: "单选题"
    },
    {
        // 17
        title: "自预备党员转正之日起，即取得党籍。",
        options: ["A) 正确", "B) 错误"],
        answer: ["B"],
        flag: "单选题"
    },
    {
        // 18
        title: "党小组会一般每月召开1次，组织党员参加政治学习、谈心谈话、开展批评和自我批评等。",
        options: ["A) 正确", "B) 错误"],
        answer: ["A"],
        flag: "单选题"
    },
    {
        // 19
        title: "保持香港、澳门长期繁荣稳定，实现祖国完全统一，是实现中华民族伟大复兴的必然要求。",
        options: ["A) 正确", "B) 错误"],
        answer: ["A"],
        flag: "单选题"
    },
    {
        // 20
        title: "对经党组织同意可以不转接组织关系的党员，所在单位党组织可以将其纳入一个党支部或者党小组，参加组织生活。",
        options: ["A) 正确", "B) 错误"],
        answer: ["A"],
        flag: "单选题"
    }

]
const data_19 =[
    {
        // 11
        title: "联合党支部覆盖单位一般不超过5个。",
        options: ["A) 正确", "B) 错误"],
        answer: ["A"],
        flag: "单选题"
    },
    {
        // 12
        title: "党的文化建设是党的根本性建设，决定党的建设方向和效果。",
        options: ["A) 正确", "B) 错误"],
        answer: ["B"],
        flag: "单选题"
    },
    {
        // 13
        title: "中共十九大，于2017年10月18日上午9:00在人民大会堂举行。",
        options: ["A) 正确", "B) 错误"],
        answer: ["A"],
        flag: "单选题"
    },
    {
        // 14
        title: "预备党员预备期满，均可以按时转为正式党员。",
        options: ["A) 正确", "B) 错误"],
        answer: ["B"],
        flag: "单选题"
    },
    {
        // 15
        title: "弘扬理论联系实际的马克思主义学风，引导党员把自己摆进去、把职责摆进去、把工作摆进去，学以致用、知行合一，提高政治站位，强化责任担当，增强过硬本领，做好本职工作，自觉做习近平新时代中国特色社会主义思想坚定信仰者和忠实实践者。",
        options: ["A) 正确", "B) 错误"],
        answer: ["A"],
        flag: "单选题"
    },
    {
        // 16
        title: "根据工作需要，上级党委可以直接作出在基层单位成立党支部的决定。",
        options: ["A) 正确", "B) 错误"],
        answer: ["A"],
        flag: "单选题"
    },
    {
        // 17
        title: "培育和弘扬社会主义核心价值观，不一定要突出道德价值的作用。",
        options: ["A) 正确", "B) 错误"],
        answer: ["B"],
        flag: "单选题"
    },
    {
        // 18
        title: "从十九大到二十大，是“两个一百年”奋斗目标的历史交汇期。",
        options: ["A) 正确", "B) 错误"],
        answer: ["A"],
        flag: "单选题"
    },
    {
        // 19
        title: "对因党员人数或者所在单位、区域等发生变化，不再符合设立条件的党支部，上级党组织应当随后予以调整或者撤销。",
        options: ["A) 正确", "B) 错误"],
        answer: ["B"],
        flag: "单选题"
    },
    {
        // 20
        title: "社会主义核心价值观是当代中国精神的集中体现，凝结着全体人民共同的价值追求。",
        options: ["A) 正确", "B) 错误"],
        answer: ["A"],
        flag: "单选题"
    }

]
const data_20 =[
    {
        // 11
        title: "我国社会主义政治制度优越性的一个突出特点，就是坚持党总揽全局、协调各方的领导核心地位",
        options: ["A) 正确", "B) 错误"],
        answer: ["A"],
        flag: "单选题"
    },
    {
        // 12
        title: "党员是党的基础组织",
        options: ["A) 正确", "B) 错误"],
        answer: ["B"],
        flag: "单选题"
    },
    {
        // 13
        title: "解放思想、实事求是、与时俱进，是马克思主义活的灵魂，是我们适应新形势、认识新事物、完成新任务的根本思想武器。",
        options: ["A) 正确", "B) 错误"],
        answer: ["A"],
        flag: "单选题"
    },
    {
        // 14
        title: "党的处分包括分为警告、严重警告、留党察看、开除党籍。",
        options: ["A) 正确", "B) 错误"],
        answer: ["B"],
        flag: "单选题"
    },
    {
        // 15
        title: "党员经过留党察看，坚持错误不改的，应当严重警告。",
        options: ["A) 正确", "B) 错误"],
        answer: ["B"],
        flag: "单选题"
    },
    {
        // 16
        title: "对因私出国并在国外长期定居的党员，出国学习研究超过5年仍未返回的党员，一般予以停止党籍。停止党籍的决定由保留其组织关系的党组织按照有关规定作出。",
        options: ["A) 正确", "B) 错误"],
        answer: ["A"],
        flag: "单选题"
    },
    {
        // 17
        title: "预备党员不履行党员义务，不具备党员条件的，应当取消预备党员资格。",
        options: ["A) 正确", "B) 错误"],
        answer: ["A"],
        flag: "单选题"
    },
    {
        // 18
        title: "统一战线，是指中国共产党领导的、以工农联盟为基础的，包括全体社会主义劳动者、社会主义事业建设者、拥护社会主义爱国者、拥护祖国统一和致力于中华民族伟大复兴爱国者的联盟。",
        options: ["A) 正确", "B) 错误"],
        answer: ["A"],
        flag: "单选题"
    },
    {
        // 19
        title: "党章规定，党的最高领导机关是党的全国代表大会。",
        options: ["A) 正确", "B) 错误"],
        answer: ["B"],
        flag: "单选题"
    },
    {
        // 20
        title: "我国是由工人阶级领导的、以工农联盟为基础的人民民主专政的社会主义国家。",
        options: ["A) 正确", "B) 错误"],
        answer: ["A"],
        flag: "单选题"
    }

]
const allTestPaperTopTenQuestions = [
    ...data_1.slice(0, 10),
    ...data_2.slice(0, 10),
    ...data_3.slice(0, 10),
    ...data_4.slice(0, 10),
    ...data_5.slice(0, 10),
    ...data_6.slice(0, 10),
    ...data_7.slice(0, 10),
    ...data_8.slice(0, 10),
    ...data_9.slice(0, 10),
    ...data_10.slice(0, 10),
]
const allTestPaperTopTenQuestions2 = [
    ...data_11.slice(0, 10),
    ...data_12.slice(0, 10),
    ...data_13.slice(0, 10),
    ...data_14.slice(0, 10),
    ...data_15.slice(0, 10),
    ...data_16.slice(0, 10),
    ...data_17.slice(0, 10),
    ...data_18.slice(0, 10),
    ...data_19.slice(0, 10),
    ...data_20.slice(0, 10),
]
const data = JSON.parse('[{"title": "11.民族工作的根本要求是：坚定不移走中国特色解决民族问题的正确道路，坚持中国共产党的领导，坚持中国特色社会主义道路，坚持维护祖国统一，坚持各民族一律平等，坚持和完善民族区域自治制度。", "options": ["A)正确", "B)错误"], "answer": ["A"], "flag": "单选题"}, {"title": "12.发现党员有思想、工作、生活、作风和纪律方面苗头性倾向性问题的，以及群众对其有不良反映的，党组织负责人应当及时进行提醒谈话，抓早抓小、防微杜渐。()", "options": ["A)正确", "B)错误"], "answer": ["A"], "flag": "单选题"}, {"title": "13.临时党支部主要组织党员开展政治学习，教育、管理、监督党员，对入党积极分子进行教育培养等，一般不发展党员、处分处置党员，不收缴党费，不选举党代表大会代表和进行换届。", "options": ["A)正确", "B)错误"], "answer": ["A"], "flag": "单选题"}, {"title": "14.非公有制经济组织、社会组织，一般从管理层中选任党支部书记，应当注重从业务骨干中选拔党支部书记。", "options": ["A)正确", "B)错误"], "answer": ["A"], "flag": "单选题"}, {"title": "15.抓党支部建设情况应当列入各级党委书记抓基层党建工作述职评议考核的重要内容，作为评判其履行管党治党政治责任情况的重要依据。", "options": ["A)正确", "B)错误"], "answer": ["A"], "flag": "单选题"}, {"title": "16.企业、农村、机关、学校、科研院所、社区、社会组织、人民解放军和武警部队连（中）队以及其他基层单位，凡是有正式党员2人以上的，都应当成立党支部。", "options": ["A)正确", "B)错误"], "answer": ["B"], "flag": "单选题"}, {"title": "17.为期3个月以上的工程、工作项目等，符合条件的，应当成立党支部。", "options": ["A)正确", "B)错误"], "answer": ["B"], "flag": "单选题"}, {"title": "18.村、社区党支部书记纳入县级党委组织部备案管理。", "options": ["A)正确", "B)错误"], "answer": ["A"], "flag": "单选题"}, {"title": "19.中央纪委国家监察机关主要负责党员纪律作风教育，指导开展党员监督，查处党员违犯党的纪律和职务违法、职务犯罪行为。()", "options": ["A)正确", "B)错误"], "answer": ["B"], "flag": "单选题"}, {"title": "20.中国共产党在领导社会主义事业中，必须坚持以从严治党为中心。", "options": ["A)正确", "B)错误"], "answer": ["B"], "flag": "单选题"}, {"title": "21.社会主义初级阶段基本路线的中心是__________。", "options": ["A)改革开放", "B)经济建设", "C)保持社会稳定", "D)坚持走社会主义道路"], "answer": ["B"], "flag": "单选题"}, {"title": "22.党的基层委员会、总支部委员会、支部委员会每届任期（）", "options": ["A)一年至两年", "B)两年至三年", "C)三年至四年", "D)三年至五年"], "answer": ["D"], "flag": "单选题"}, {"title": "23.把用习近平新时代中国特色社会主义思想武装全党作为党员教育管理的()，引导党员充分认识学习贯彻习近平新时代中国特色社会主义思想的重大意义，自觉学懂弄通做实。", "options": ["A)基本政治任务", "B)首要政治任务", "C)根本政治任务", "D)主要政治任务"], "answer": ["B"], "flag": "单选题"}, {"title": "24.联合党支部覆盖单位一般不超过（）个。", "options": ["A)2", "B)3", "C)4", "D)5"], "answer": ["D"], "flag": "单选题"}, {"title": "25.党员受到警告处分_______内，不得在党内提升职务和向党外组织推荐担任高于其原任职务的党外职务。", "options": ["A)六个月", "B)一年", "C)一年半", "D)两年"], "answer": ["B"], "flag": "单选题"}, {"title": "26.新世纪新阶段统一战线具有空前的广泛性、巨大的包容性、鲜明的多样性和显著的（）", "options": ["A)政治性", "B)时代性", "C)复杂性", "D)社会性"], "answer": ["D"], "flag": "单选题"}, {"title": "27.党员教育基本任务中，要突出()和政治训练，严格党内政治生活锻炼，教育党员旗帜鲜明讲政治，提高政治觉悟和政治能力，严守政治纪律和政治规矩，永葆共产党人政治本色。", "options": ["A)政治修养", "B)政治教育", "C)政治素养", "D)政治规划"], "answer": ["B"], "flag": "单选题"}, {"title": "28.我国根本的政治制度是__________。", "options": ["A)政治协商制度", "B)人民代表大会制度", "C)多党合作制度", "D)民主集中制"], "answer": ["B"], "flag": "单选题"}, {"title": "29.（）是共产党人精神上的“钙”。", "options": ["A)理想信念", "B)政治觉悟", "C)世界观和方法论", "D)文化追求"], "answer": ["A"], "flag": "单选题"}, {"title": "30.（）是党的基础组织，是党组织开展工作的基本单元，是党在社会基层组织中的战斗堡垒，是党的全部工作和战斗力的基础。", "options": ["A)党小组", "B)党支部", "C)党总支", "D)党委"], "answer": ["C"], "flag": "单选题"}, {"title": "31.习近平总书记“七一”重要讲话指出，在坚持马克思主义指导地位这一根本问题上，我们必须坚定不移，任何时候任何情况下都不能有丝毫动摇。同时，面对新的时代特点和实践要求，马克思主义也面临着进一步中国化、时代化、（）的问题。", "options": ["A)特色化", "B)具体化", "C)大众化", "D)科学化"], "answer": ["C"], "flag": "多选题"}, {"title": "32.党员如果没有正当理由，连续_______不交纳党费，就被认为是自行脱党。", "options": ["A)三个月", "B)半年", "C)一年", "D)两年"], "answer": ["B"], "flag": "多选题"}, {"title": "33.党支部书记应当具备良好政治素质，在党员、群众中有较高威信，一般应当具有（）年以上党龄。", "options": ["A)半", "B)一", "C)二", "D)三"], "answer": ["B"], "flag": "多选题"}, {"title": "34.党员必须坚持党和人民利益高于一切，吃苦在前，享受在后，_______，多做贡献。", "options": ["A)克己奉公", "B)廉洁自律", "C)艰苦奋斗", "D)艰苦创业"], "answer": ["A"], "flag": "多选题"}, {"title": "35.坚持四项基本原则的核心是坚持__________。", "options": ["A)社会主义道路", "B)人民民主专政", "C)中国共产党的领导", "D)马克思列宁主义毛泽东思想"], "answer": ["C"], "flag": "多选题"}, {"title": "36.坚持中国共产党在统一战线中的（）是统一战线最根本的问题。", "options": ["A)主导地位", "B)领导权", "C)发言权"], "answer": ["A"], "flag": "多选题"}, {"title": "37.统一战线工作的根本任务是______________，为实现党和国家的宏伟目标而团结奋斗。", "options": ["A)凝聚人心、汇聚力量", "B)大团结、大联合", "C)为社会主义的经济、政治、文化服务"], "answer": ["C"], "flag": "多选题"}, {"title": "38.各级党委主管统一战线工作的职能部门是（）。", "options": ["A)办公厅（室）", "B)宣传部", "C)统战部"], "answer": ["C"], "flag": "多选题"}, {"title": "39.中国共产党第十八次全国代表大会，是在我国进入（）小康社会决定性阶段召开的一次十分重要的大会", "options": ["A)全面建设", "B)全面建成", "C)全面建立"], "answer": ["B"], "flag": "多选题"}, {"title": "40.党的十八大报告强调，我们坚定不移高举中国特色社会主义伟大旗帜，既不走封闭僵化的老路、也不走（）的邪路。", "options": ["A)资本主义", "B)改旗易帜", "C)改弦更张"], "answer": ["B"], "flag": "多选题"}, {"title": "41.对于全面从严治党，（）是党自我净化、自我完善、自我革新、自我提高的根本途径，（）则是实现改革发展目标的根本保证，增强从严治党的系统性、预见性、创造性、实效性，锻造我们事业更加坚强的领导核心。", "options": ["A)改革；", "B)经济建设；", "C)政治建设；", "D)党的领导；"], "answer": ["A", "D"], "flag": "多选题"}, {"title": "42.中国共产党在新时期面临的三大历史任务为()。", "options": ["A)发展生产力", "B)推进现代化建设", "C)完成祖国统一", "D)维护世界和平与促进共同发展"], "answer": ["B", "C", "D"], "flag": "多选题"}, {"title": "43.违反有关规定等，对直接责任者和领导责任者，情节较轻的，给予警告或者严重警告处分;情节较重的，给予撤销党内职务或者留党察看处分;情节严重的，给予开除党籍处分。", "options": ["A)自定薪酬", "B)滥发津贴", "C)滥发补贴", "D)滥发奖金"], "answer": ["A", "B", "C", "D"], "flag": "多选题"}, {"title": "44.健全人民当家作主制度体系，发展社会主义民主政治，必须要（）。", "options": ["A)坚持党的领导、人民当家作主、依法治国有机统一；", "B)加强人民当家作主制度保障；", "C)发挥社会主义协商民主重要作用；", "D)简化机构和行政体制改革；"], "answer": ["A", "B", "C"], "flag": "多选题"}, {"title": "45.《中国共产党党员教育管理工作条例》的制定和实施，对于________,实现党伟大执政使命，具有十分重要的意义。", "options": ["A)提高党员队伍建设质量", "B)激发党组织的生机活力", "C)推动全面从严治党向纵深发展", "D)夯实党长期执政基础"], "answer": ["A", "B", "C", "D"], "flag": "多选题"}, {"title": "46.党员应当主动学网用网，依托各类党员教育管理信息化平台，_______。", "options": ["A)积极"], "answer": ["B", "C", "D", "A", "B", "D"], "flag": "多选题"}, {"title": "47.党员廉洁自律规范包括：", "options": ["A)坚持公私分明，先公后私，克己奉公", "B)坚持崇廉拒腐，清白做人，干净做事", "C)坚持尚俭戒奢，艰苦朴素，勤俭节约", "D)坚持吃苦在前，享受在后，甘于奉献"], "answer": ["A", "B", "C", "D"], "flag": "多选题"}, {"title": "48.中国共产党要建设成为_______、_______、________马克思主义执政党。", "options": ["A)学习型", "B)服务型", "C)创新性", "D)战斗型"], "answer": ["A", "B", "C"], "flag": "多选题"}, {"title": "49.党小组组长（）产生", "options": ["A)党支部指定", "B)群众推荐", "C)所在党小组党员推荐", "D)毛遂自荐"], "answer": ["A", "C"], "flag": "多选题"}, {"title": "50.新形势下，党面临的危险包括：_____", "options": ["A)精神懈怠危险", "B)能力不足危险", "C)脱离群众危险", "D)消极腐败危险"], "answer": ["A", "B", "C", "D"], "flag": "多选题"}, {"title": "51.《党章》第四条规定，党员享有八项权利，下列哪些属于党员享有的权利?", "options": ["A)"], "answer": ["B", "C", "D", "A", "B", "C", "D"], "flag": "多选题"}, {"title": "52.坚定文化自信，推动社会主义文化繁荣兴盛，要求我们党（）。", "options": ["A)放弃意识形态工作；", "B)培育和践行社会主义核心价值观；", "C)加强思想道德建设；", "D)繁荣发展社会主义文艺；"], "answer": ["B", "C", "D"], "flag": "多选题"}, {"title": "53.党员要加强党性锻炼，不断提高政治觉悟和政治能力，把()作为根本政治担当，永葆共产党人政治本色。", "options": ["A)对党忠诚；", "B)为党分忧；", "C)为党尽职；", "D)为民造福；"], "answer": ["A", "B", "C", "D"], "flag": "多选题"}, {"title": "54.《党章》第三十一条规定，党的基层组织对要求入党的积极分子进行教育和培养，做好经常性的发展党员工作，重视在__中发展党员。", "options": ["A)生产第一线", "B)先进工作者", "C)工作第一线", "D)青年"], "answer": ["A", "C"], "flag": "多选题"}, {"title": "55.基层党委履行抓党员教育管理的基本职责，推动落实上级党组织工作安排，组织做好党员集中培训、组织关系管理、_____________,纪律处分等工作，指导所辖党支部做好党员日常教育管理工作。()", "options": ["A)表彰激励", "B)关怀帮扶", "C)指导督促", "D)组织处置"], "answer": ["A", "B", "D"], "flag": "多选题"}, {"title": "56.党小组会一般每月召开1次，组织党员（）等。", "options": ["A)政治学习", "B)谈心谈话", "C)开展批评", "D)自我批评"], "answer": ["A", "B", "C", "D"], "flag": "多选题"}, {"title": "57.对党员的纪律处分种类，包括", "options": ["A)警告", "B)严重警告", "C)撤销党内职务", "D)留党察看"], "answer": ["A", "B", "C", "D"], "flag": "多选题"}, {"title": "58.中国共产党第十九次全国代表大会同意把（）一道写入党章", "options": ["A)中国特色社会主义道路", "B)中国特色社会主义理论体系", "C)中国特色社会主义制度", "D)中国特色社会主义文化"], "answer": ["A", "B", "C", "D"], "flag": "多选题"}, {"title": "59.《党章》总纲中明确指出，中国共产党的性质是", "options": ["A)中国共产党是中国工人阶级的先锋队", "B)是中国特色社会主义事业的领导核心", "C)代表中国先进生产力的发展要求", "D)代表中国先进文化的前进方向"], "answer": ["A", "B", "C", "D"], "flag": "多选题"}, {"title": "60.中国共产党必须不断提高党的创造力、凝聚力、战斗力，建设（）的马克思主义执政党。", "options": ["A)学习型；", "B)努力型；", "C)服务型；", "D)创新型；"], "answer": ["A", "C", "D"], "flag": "多选题"}]')
