const chapter_one = [
    {
        "title": "中国的近现代史，是指（  ）",
        "options": [
            "A) 1840年以来中国的历史",
            "B) 1911年以来中国的历史",
            "C) 1919年以来中国的历史",
            "D) 1949年以来中国的历史"
        ],
        "answer": [
            "A"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "日本在甲午中日战争后迫使清政府签订了（   ）",
        "options": [
            "A) 《天津条约》",
            "B) 《北京条约》",
            "C) 《马关条约》",
            "D) 《辛丑条约》"
        ],
        "answer": [
            "C"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "（   ）被称为近代中国睁眼看世界的第一人。",
        "options": [
            "A) 林则徐",
            "B) 魏源",
            "C) 康有为",
            "D) 梁启超"
        ],
        "answer": [
            "A"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "近代中国社会最主要的矛盾是（  ）",
        "options": [
            "A) 地主阶级和农民阶级的矛盾",
            "B) 资产阶级和无产阶级的矛盾",
            "C) 帝国主义和中华民族的矛盾",
            "D) 封建主义和人民大众的矛盾"
        ],
        "answer": [
            "C"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "1894年11月喊出了“振兴中华”这个时代最强音的人是（   ）",
        "options": [
            "A) 洪秀全",
            "B) 严复",
            "C) 孙中山",
            "D) 康有为"
        ],
        "answer": [
            "C"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "（  ）在其所著的《盛世危言》中提出要大力发展民族工商业，同西方国家进行“商战”。",
        "options": [
            "A) 郑观应",
            "B) 王韬",
            "C) 薛福成",
            "D) 马建忠"
        ],
        "answer": [
            "A"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "孙中山先生曾说，“用大刀，肉体和联军相搏，虽然被联军打死了几万人，伤亡枕藉，还是前仆后继，其勇锐之气殊不可挡，真是令人惊奇佩服。所以经过那次血战之后，外国人才知道中国还有民族思想，这种民族是不可消灭的”。这里孙中山先生所说的“那次血战”指的是（  ）",
        "options": [
            "A) 三元里人民抗英运动",
            "B) 义和团运动",
            "C) 太平天国运动",
            "D) 辛亥革命"
        ],
        "answer": [
            "B"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "19世纪初，世界资本主义最强大的国家是（  ），建立了号称“日不落”的殖民大帝国。",
        "options": [
            "A) 日本",
            "B) 英国",
            "C) 美国",
            "D) 法国"
        ],
        "answer": [
            "B"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "帝国主义瓜分中国图谋破产的根本原因是（   ）",
        "options": [
            "A) 列强之间的矛盾和相互制约",
            "B) 中华民族不屈不挠的反侵略斗争",
            "C) 帝国主义国家中正义力量的干涉",
            "D) 中国自给自足的经济社会结构"
        ],
        "answer": [
            "B"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "中国近代史的起点是（  ）",
        "options": [
            "A) 虎门硝烟",
            "B) 第一次鸦片战争",
            "C) 洋务运动",
            "D) 中华民国建立"
        ],
        "answer": [
            "B"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "中国的现代史，是指（  ）",
        "options": [
            "A) 1840年以来中国的历史",
            "B) 1911年以来中国的历史",
            "C) 1919年以来中国的历史",
            "D) 1949年以来中国的历史"
        ],
        "answer": [
            "D"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "中国封建社会政治的基本特征是实行高度中央集权的（  ）",
        "options": [
            "A) 封建君主专制制度",
            "B) 君主立宪制度",
            "C) 民主共和制度",
            "D) 酋长制度"
        ],
        "answer": [
            "A"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "近代中国社会的性质是（  ）",
        "options": [
            "A) 半殖民地社会",
            "B) 半封建社会",
            "C) 半殖民地半封建社会",
            "D) 殖民地社会"
        ],
        "answer": [
            "C"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "近代中国最革命的阶级是（  ）",
        "options": [
            "A) 工人阶级",
            "B) 农民阶级",
            "C) 地主阶级",
            "D) 资产阶级"
        ],
        "answer": [
            "A"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "中国民主革命的主力军是（  ）",
        "options": [
            "A) 民族资产阶级",
            "B) 城市小资产阶级",
            "C) 工人阶级",
            "D) 农民阶级"
        ],
        "answer": [
            "D"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "近代中国诞生的新兴的被压迫阶级是（   ）",
        "options": [
            "A) 工人阶级",
            "B) 农民阶级",
            "C) 地主阶级",
            "D) 资产阶级"
        ],
        "answer": [
            "A"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "中国最早的一批产业工人产生在（  ）",
        "options": [
            "A) 洋务企业中",
            "B) 外国资本经营的在华企业",
            "C) 民族资本主义企业中",
            "D) 私人小作坊中"
        ],
        "answer": [
            "B"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "中国封建社会的正统思想是（  ）",
        "options": [
            "A) 法家思想",
            "B) 道家思想",
            "C) 儒家思想",
            "D) 墨家思想"
        ],
        "answer": [
            "C"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "（  ）不属于19世纪中期资本-帝国主义对中国进行的军事侵略的主要形式之一。",
        "options": [
            "A) 发动侵略战争，屠杀中国人民",
            "B) 侵占中国领土，划分势力范围",
            "C) 控制中国的内政、外交",
            "D) 勒索赔款，抢劫财物"
        ],
        "answer": [
            "C"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "为了统治中国，资本-帝国主义列强在政治上采取的主要方式是（    ）",
        "options": [
            "A) 控制中国的内政、外交",
            "B) 发动侵略战争，划分势力范围",
            "C) 镇压中国人民的反抗",
            "D) 扶植、收买代理人"
        ],
        "answer": [
            "A",
            "C",
            "D"
        ],
        "flag": "多选题（4选项） / answer.length: 3"
    },
    {
        "title": "中国近代社会的主要矛盾是（   ）",
        "options": [
            "A) 中华民族和帝国主义的矛盾",
            "B) 资产阶级与地主阶级的矛盾",
            "C) 封建主义和人民大众的矛盾",
            "D) 无产阶级和资产阶级的矛盾"
        ],
        "answer": [
            "A",
            "C"
        ],
        "flag": "多选题（4选项） / answer.length: 2"
    },
    {
        "title": "近代中国社会的两大历史任务是（   ）",
        "options": [
            "A) 实现共产主义",
            "B) 实现国家富强和人民幸福",
            "C) 建设社会主义",
            "D) 争取民族独立和人民解放"
        ],
        "answer": [
            "B",
            "D"
        ],
        "flag": "多选题（4选项） / answer.length: 2"
    }
]
const chapter_two = [
    {
        "title": "戊戌政变后，新政措施大都被废除，被保留下来的是（）",
        "options": [
            "A) 京师大学堂",
            "B) 准许旗人自谋生计",
            "C) 改革财政",
            "D) 改革行政机构"
        ],
        "answer": [
            "A"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "从1898年6月11日到9月21日，光绪帝颁布了一系列变法上谕，史称（  ）",
        "options": [
            "A) 公车上书",
            "B) 自强求富",
            "C) 戊戌政变",
            "D) 百日维新"
        ],
        "answer": [
            "D"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "（  ）是最能体现太平天国社会理想和这次农民起义特色的纲领性文件。",
        "options": [
            "A) 《资政新篇》",
            "B) 《海国图志》",
            "C) 《天朝田亩制度》",
            "D) 《中华民国临时约法》"
        ],
        "answer": [
            "C"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "洋务运动失败的标志是（  ）",
        "options": [
            "A) 中法战争中国的不败而败",
            "B) 维新派和守旧派论战中守旧派的失败",
            "C) 甲午战争中北洋海军全军覆没",
            "D) 《辛丑条约》的签订"
        ],
        "answer": [
            "C"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "在洋务运动中，洋务派通过所掌握的国家权力，集中力量优先发展（  ）",
        "options": [
            "A) 民用企业",
            "B) 军事工业",
            "C) 资本主义工商业",
            "D) 新式农业"
        ],
        "answer": [
            "B"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "太平天国由盛转衰的分水岭是（  ）",
        "options": [
            "A) 北伐失利",
            "B) 天京事变",
            "C) 安庆失守",
            "D) 天京被围"
        ],
        "answer": [
            "B"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "太平天国后期，（  ）提出《资政新篇》。",
        "options": [
            "A) 洪秀全",
            "B) 杨秀清",
            "C) 洪仁玕",
            "D) 石达开"
        ],
        "answer": [
            "C"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "1853年3月，太平军占领南京，定为首都，改名为（）",
        "options": [
            "A) 西京",
            "B) 北京",
            "C) 天京",
            "D) 金陵"
        ],
        "answer": [
            "C"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "维新变法时期，维新派提出的中国理想政治方案（  ）",
        "options": [
            "A) 君主立宪",
            "B) 民主共和",
            "C) 人民民主",
            "D) 宪政民主"
        ],
        "answer": [
            "A"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "太平天国农民战争爆发的标志是（  ）",
        "options": [
            "A) 金田起义",
            "B) 永安建制",
            "C) 长沙战役",
            "D) 南京定都"
        ],
        "answer": [
            "A"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "百日维新中，光绪皇帝颁布的政令要求裁减旧式绿营兵，改练（ ）",
        "options": [
            "A) 新式海军",
            "B) 新式陆军",
            "C) 新式炮兵",
            "D) 新式骑兵"
        ],
        "answer": [
            "B"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "百日维新中，光绪皇帝颁布的政令要求各省书院改为（ ）",
        "options": [
            "A) 预备学校",
            "B) 私塾",
            "C) 高等学堂",
            "D) 专业学会"
        ],
        "answer": [
            "C"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "洋务运动时期，清政府的海军主力是（）",
        "options": [
            "A) 福建水师",
            "B) 北洋水师",
            "C) 广东水师",
            "D) 南洋水师"
        ],
        "answer": [
            "B"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "（  ）是中国旧式农民战争的最高峰。",
        "options": [
            "A) 三元里人民抗英斗争",
            "B) 辛亥革命",
            "C) 太平天国运动",
            "D) 义和团运动"
        ],
        "answer": [
            "C"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "天京事变后，洪秀全为挽救太平天国而提拔的年轻将领主要是陈玉成和（  ）",
        "options": [
            "A) 李秀成",
            "B) 石达开",
            "C) 洪仁玕",
            "D) 杨秀清"
        ],
        "answer": [
            "A"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "对洋务派兴办洋务事业的指导思想最先做出比较完整表述的是（  ）",
        "options": [
            "A) 奕訢",
            "B) 曾国藩",
            "C) 冯桂芬",
            "D) 李鸿章"
        ],
        "answer": [
            "C"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "（  ）标志着中国民族资产阶级开始登上政治舞台。",
        "options": [
            "A) 洋务运动",
            "B) 戊戌维新运动",
            "C) 辛亥革命",
            "D) 保路运动"
        ],
        "answer": [
            "B"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "1853年3月，洪秀全领导的太平天国建都（  ），后改称天京，正式宣告太平天国农民政权的建立。",
        "options": [
            "A) 金田",
            "B) 武昌",
            "C) 安庆",
            "D) 南京"
        ],
        "answer": [
            "D"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "戊戌维新时期，康有为主持的重要学堂是（）",
        "options": [
            "A) 京师大学堂",
            "B) 广方言馆",
            "C) 时务学堂",
            "D) 广州万木草堂"
        ],
        "answer": [
            "D"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "1851年1月，洪秀全在广西领导农民起义的地点是（  ）",
        "options": [
            "A) 金田村",
            "B) 永安",
            "C) 安庆",
            "D) 武昌"
        ],
        "answer": [
            "A"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "洋务运动中，曾国藩率领的用洋枪装备的军队是（）",
        "options": [
            "A) 鄂军",
            "B) 淮军",
            "C) 湘军",
            "D) 川军"
        ],
        "answer": [
            "C"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "太平天国不可磨灭的历史功绩和重大的历史意义表现在（  ）",
        "options": [
            "A) 沉重打击了封建统治阶级，强烈撼动了清政府的统治根基",
            "B) 是中国旧式农民战争的最高峰",
            "C) 冲击了孔子和儒家经典的正统权威",
            "D) 有力地打击了外国侵略势力"
        ],
        "answer": [
            "A",
            "B",
            "C",
            "D"
        ],
        "flag": "多选题（4选项） / answer.length: 4"
    },
    {
        "title": "从19世纪60年代到90年代，洋务派举办的洋务事业主要有（  ）",
        "options": [
            "A) 兴办近代企业",
            "B) 建立新式海军",
            "C) 创办新式学堂",
            "D) 派遣留学生"
        ],
        "answer": [
            "A",
            "B",
            "C",
            "D"
        ],
        "flag": "多选题（4选项） / answer.length: 4"
    },
    {
        "title": "在中国近代史上，对国家出路早期探索的大事件指的是（   ）",
        "options": [
            "A) 太平天国运动",
            "B) 戊戌变法",
            "C) 洋务运动",
            "D) 辛亥革命"
        ],
        "answer": [
            "A",
            "B",
            "C"
        ],
        "flag": "多选题（4选项） / answer.length: 3"
    }
]
const chapter_three = [
    {
        "title": "辛亥革命的高潮是（  ）",
        "options": [
            "A) 保路运动",
            "B) 黄花岗起义",
            "C) 武昌起义",
            "D) 中华民国成立"
        ],
        "answer": [
            "C"
        ],
        "flag": "单选题（4选1）"
    },
    {
        "title": "清政府宣布实行“新政”的时间是（ ）",
        "options": [
            "A) 1901年",
            "B) 1902年",
            "C) 1903年",
            "D) 1904年"
        ],
        "answer": [
            "A"
        ],
        "flag": "单选题（4选1）"
    },
    {
        "title": "20世纪中国的第一次历史性巨变是（  ）",
        "options": [
            "A) 太平天国农民战争",
            "B) 辛亥革命",
            "C) 戊戌变法",
            "D) 义和团运动"
        ],
        "answer": [
            "B"
        ],
        "flag": "单选题（4选1）"
    },
    {
        "title": "武昌起义的导火线是( )",
        "options": [
            "A) 黄花岗起义",
            "B) 萍浏醴起义",
            "C) 保路运动",
            "D) 镇南关起义"
        ],
        "answer": [
            "C"
        ],
        "flag": "单选题（4选1）"
    },
    {
        "title": "中国一次比较完全意义上的资产阶级民主革命是（  ）",
        "options": [
            "A) 辛亥革命",
            "B) 太平天国农民战争",
            "C) 洋务运动",
            "D) 戊戌变法"
        ],
        "answer": [
            "A"
        ],
        "flag": "单选题（4选1）"
    },
    {
        "title": "中国历史上第一部具有资产阶级共和国宪法性质的法典是（  ）",
        "options": [
            "A) 《中华民国临时约法》",
            "B) 《钦定宪法大纲》",
            "C) 《中华民国约法》",
            "D) 《中华民国宪法》"
        ],
        "answer": [
            "A"
        ],
        "flag": "单选题（4选1）"
    },
    {
        "title": "孙中山所说的政治革命是( )",
        "options": [
            "A) 民生主义",
            "B) 民族主义",
            "C) 民权主义",
            "D) 平均地权"
        ],
        "answer": [
            "C"
        ],
        "flag": "单选题（4选1）"
    },
    {
        "title": "民族主义包括“驱除鞑虏，恢复中华”两项内容，也就是要( )",
        "options": [
            "A) 结束清政府的专制统治及其媚外政策",
            "B) 凡为国民皆平等以有参政权",
            "C) 敢有帝制自为者，天下共击之",
            "D) 打击封建军阀"
        ],
        "answer": [
            "A"
        ],
        "flag": "单选题（4选1）"
    },
    {
        "title": "清政府于1906年宣布“预备仿行宪政”，并于1908年颁布了（  ）",
        "options": [
            "A) 《钦定宪法大纲》",
            "B) 《中华民国临时约法》",
            "C) 《明定国是》",
            "D) 《商律》"
        ],
        "answer": [
            "A"
        ],
        "flag": "单选题（4选1）"
    },
    {
        "title": "北洋军阀政府代表的是（ ）",
        "options": [
            "A) 民族资产阶级",
            "B) 大地主和买办资产阶级",
            "C) 小资产阶级知识分子利益",
            "D) 工农利益"
        ],
        "answer": [
            "B"
        ],
        "flag": "单选题（4选1）"
    },
    {
        "title": "武昌起义胜利后，革命党人拥戴（ ）为军政府大都督",
        "options": [
            "A) 袁世凯",
            "B) 孙中山",
            "C) 黎元洪",
            "D) 黄兴"
        ],
        "answer": [
            "C"
        ],
        "flag": "单选题（4选1）"
    },
    {
        "title": "中国近代第一个领导资产阶级革命的全国性政党是（  ）",
        "options": [
            "A) 兴中会",
            "B) 光复会",
            "C) 中国同盟会",
            "D) 国民党"
        ],
        "answer": [
            "C"
        ],
        "flag": "单选题（4选1）"
    },
    {
        "title": "同盟会成立后，将（ ）作为自己的机关报",
        "options": [
            "A) 《民报》",
            "B) 《新民丛报》",
            "C) 《万国公报》",
            "D) 《顺天时报》"
        ],
        "answer": [
            "A"
        ],
        "flag": "单选题（4选1）"
    },
    {
        "title": "中华民国元年是( )",
        "options": [
            "A) 1910年",
            "B) 1911年",
            "C) 1912年",
            "D) 1913年"
        ],
        "answer": [
            "C"
        ],
        "flag": "单选题（4选1）"
    },
    {
        "title": "资产阶级革命派的阶级基础是（  ）",
        "options": [
            "A) 大地主大资产阶级",
            "B) 民族资产阶级",
            "C) 工人阶级",
            "D) 农民阶级"
        ],
        "answer": [
            "B"
        ],
        "flag": "单选题（4选1）"
    },
    {
        "title": "民生主义在当时指的是“平均地权”，也就是孙中山所说的( )",
        "options": [
            "A) 政治革命",
            "B) 民族革命",
            "C) 社会革命",
            "D) 思想革命"
        ],
        "answer": [
            "C"
        ],
        "flag": "单选题（4选1）"
    },
    {
        "title": "袁世凯为了复辟帝制，他竟然基本接受严重损害中国权益的 （ ）",
        "options": [
            "A) “西原借款”",
            "B) “二十一条”",
            "C) “善后大借款”",
            "D) 《天津条约》"
        ],
        "answer": [
            "B"
        ],
        "flag": "单选题（4选1）"
    },
    {
        "title": "清末“预备立宪”的根本目的在于( )",
        "options": [
            "A) 仿效欧美政体",
            "B) 发展资本主义",
            "C) 延续反动统治",
            "D) 缓和阶级矛盾"
        ],
        "answer": [
            "C"
        ],
        "flag": "单选题（4选1）"
    },
    {
        "title": "1904年，孙中山指出只有推翻清政府，建立“中华民国”，才能真正解决中国问题的文章是（  ）",
        "options": [
            "A) 《革命军》",
            "B) 《警世钟》",
            "C) 《驳康有为论革命书》",
            "D) 《中国问题的真解决》"
        ],
        "answer": [
            "D"
        ],
        "flag": "单选题（4选1）"
    },
    {
        "title": "袁世凯复辟帝制，举行登基大典是在（  ）",
        "options": [
            "A) 1915 年",
            "B) 1916年",
            "C) 1917 年",
            "D) 1918年"
        ],
        "answer": [
            "B"
        ],
        "flag": "单选题（4选1）"
    },
    {
        "title": "资产阶级革命派传播革命思想的代表著作有（）",
        "options": [
            "A) 《驳康有为论革命书》",
            "B) 《革命军》",
            "C) 《警世钟》",
            "D) 《猛回头》"
        ],
        "answer": [
            "A",
            "B",
            "C",
            "D"
        ],
        "flag": "多选题（4选项）"
    },
    {
        "title": "孙中山为了防止袁世凯专制而提出的条件有（  ）",
        "options": [
            "A) 以南京为首都",
            "B) 总统在南京就职",
            "C) 遵守约法",
            "D) 清帝退位"
        ],
        "answer": [
            "A",
            "B",
            "C"
        ],
        "flag": "多选题（4选项）"
    },
    {
        "title": "革命派和维新派论战的问题有（  ）",
        "options": [
            "A) 要不要以革命的手段推翻清政府",
            "B) 要不要推翻帝制，实行共和",
            "C) 要不要进行社会革命",
            "D) 要不要废八股、改科举和兴学堂"
        ],
        "answer": [
            "A",
            "B",
            "C"
        ],
        "flag": "多选题（4选项）"
    },
    {
        "title": "孙中山等革命党人为维护资产阶级民主革命成果进行的一系列奋斗有（）",
        "options": [
            "A) 护国运动",
            "B) 第一次护法运动",
            "C) 二次革命",
            "D) 第二次护法运动"
        ],
        "answer": [
            "A",
            "B",
            "C",
            "D"
        ],
        "flag": "多选题（4选项）"
    },
    {
        "title": "中国同盟会的政治纲领包括（   )",
        "options": [
            "A) 驱逐鞑虏，恢复中华",
            "B) 创立民国",
            "C) 平均地权",
            "D) 节制资本"
        ],
        "answer": [
            "A",
            "B",
            "C"
        ],
        "flag": "多选题（4选项）"
    },
    {
        "title": "资产阶级革命派的骨干力量是（ ）",
        "options": [
            "A) 地主阶级",
            "B) 资产阶级知识分子",
            "C) 小资产阶级知识分子",
            "D) 工农阶级"
        ],
        "answer": [
            "B",
            "C"
        ],
        "flag": "多选题（4选项）"
    },
    {
        "title": "1911年武昌起义的具体组织者和发动者是()",
        "options": [
            "A) 兴中会",
            "B) 文学社",
            "C) 华兴会",
            "D) 共进会"
        ],
        "answer": [
            "B",
            "D"
        ],
        "flag": "多选题（4选项）"
    }
]
const chapter_four = [
    {
        "title": "新文化运动的基本口号是（   ）",
        "options": [
            "A) 反对旧文学提倡新文学",
            "B) 反对旧道德提倡新道德",
            "C) 民主与科学",
            "D) 民主与法制"
        ],
        "answer": [
            "C"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "1920年8月，（   ）翻译的《共产党宣言》中文全译本公开出版。",
        "options": [
            "A) 戴季陶",
            "B) 陈望道",
            "C) 陈独秀",
            "D) 李达"
        ],
        "answer": [
            "B"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "中国共产党组织领导的第一个农民协会是（   ）",
        "options": [
            "A) 衙前村农民协会",
            "B) 海陆丰农民协会",
            "C) 汕头农民协会",
            "D) 井冈山农民协会"
        ],
        "answer": [
            "A"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "国共两党实现第一次合作的政治基础是 (   )",
        "options": [
            "A) 三民主义",
            "B) 反帝反封建",
            "C) 新三民主义",
            "D) 共产党民主革命纲领"
        ],
        "answer": [
            "C"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "五四运动的第一段，斗争中心在 (   )",
        "options": [
            "A) 上海",
            "B) 北京",
            "C) 广州",
            "D) 天津"
        ],
        "answer": [
            "B"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "1921年7月出席中共一大的长沙代表是 (   )",
        "options": [
            "A) 李达、李汉俊",
            "B) 毛泽东、李达",
            "C) 毛泽东、何叔衡",
            "D) 毛泽东、董必武"
        ],
        "answer": [
            "C"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "在新文化运动中，把白话文的形式和反封建的内容结合起来的是 (   )",
        "options": [
            "A) 陈独秀",
            "B) 李大钊",
            "C) 胡适",
            "D) 鲁迅"
        ],
        "answer": [
            "D"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "在马克思主义传播的基础上，各地共产主义小组先后建立。中国最早建立的共产主义小组是（   ）",
        "options": [
            "A) 北京小组",
            "B) 上海小组",
            "C) 武汉小组",
            "D) 长沙小组"
        ],
        "answer": [
            "B"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "新文化运动把反对儒家传统道德作为矛头所向，其根本原因是（   ）",
        "options": [
            "A) 儒家思想阻碍中国资本主义的发展",
            "B) 当时北洋军阀政府推崇儒家思想",
            "C) 儒家思想比资产阶级文化落后",
            "D) 儒家思想是维护封建统治的理论基础"
        ],
        "answer": [
            "D"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "新文化运动兴起的标志是（   ）",
        "options": [
            "A) 蔡元培就任北京大学校长",
            "B) 鲁迅发表《狂人日记》",
            "C) 陈独秀在上海创办《青年杂志》",
            "D) 胡适发表《文学改良刍议》"
        ],
        "answer": [
            "C"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "早期新文化运动的性质是 (   )",
        "options": [
            "A) 资产阶级旧民主主义的思想文化运动",
            "B) 新民主主义性质的思想文化运动",
            "C) 无产阶级思想文化运动",
            "D) 马克思主义思想文化运动"
        ],
        "answer": [
            "A"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "下列不属于中共二大通过的党纲内容是(    )",
        "options": [
            "A) 消除内乱，打倒军阀",
            "B) 推翻帝国主义压迫",
            "C) 联合第三国际",
            "D) 统一中国为真正的民主共和国"
        ],
        "answer": [
            "C"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "中共一大选举产生了以（    ）为书记的中央局。",
        "options": [
            "A) 李达",
            "B) 张国焘",
            "C) 毛泽东",
            "D) 陈独秀"
        ],
        "answer": [
            "D"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "曾任黄埔军校政治部主任的是 (    )",
        "options": [
            "A) 蒋介石",
            "B) 廖仲恺",
            "C) 周恩来",
            "D) 李大钊"
        ],
        "answer": [
            "C"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "国民革命时期,全国范围的大革命高潮的起点是(    )",
        "options": [
            "A) 省港大罢工",
            "B) 五卅运动",
            "C) 青岛日资纱厂工人罢工",
            "D) 安源路矿工人大罢工"
        ],
        "answer": [
            "B"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "从1922年1月香港海员罢工到1923年2月 (   )，掀起了中国工人运动的第一个高潮。",
        "options": [
            "A) 长辛店工人罢工",
            "B) 京汉铁路工人罢工",
            "C) 上海工人罢工",
            "D) 二七惨案"
        ],
        "answer": [
            "B"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "共产党早期组织领导的第一个工会是(   )",
        "options": [
            "A) 上海机器工会",
            "B) 长辛店铁路工会",
            "C) 天津机械工会",
            "D) 上海印刷工会"
        ],
        "answer": [
            "A"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "标志着中国新民主主义革命开端的历史事件是 (   )",
        "options": [
            "A) 辛亥革命",
            "B) 中华民国成立",
            "C) 五四运动",
            "D) 中国共产党成立"
        ],
        "answer": [
            "C"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "1919年五四运动爆发的导火索是（    ）",
        "options": [
            "A) 日本提出灭亡中国的“二十一条”",
            "B) 民族矛盾和阶级矛盾的日益激化",
            "C) 十月革命的影响",
            "D) 巴黎和会上中国政府的外交失败"
        ],
        "answer": [
            "D"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "中国先进分子真正了解马克思主义是在（   ）",
        "options": [
            "A) 俄国十月革命后",
            "B) 五四爱国运动后",
            "C) 新文化运动兴起",
            "D) 中国共产党成立后"
        ],
        "answer": [
            "A"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "关于国民革命失败的原因，以下错误的表述是（   ）",
        "options": [
            "A) 帝国主义与国内封建主义、买办势力勾结，反革命力量强大",
            "B) 国民党右派叛变革命",
            "C) 中共党不善于把马克思主义理论与中国实际结合",
            "D) 中共中央出现“左”倾教条主义错误"
        ],
        "answer": [
            "D"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "李大钊讴歌十月革命的著作有 （  ）",
        "options": [
            "A) 《法俄革命之比较观》",
            "B) 《庶民的胜利》",
            "C) 《Bolshevism的胜利》",
            "D) 《我的马克思主义观》"
        ],
        "answer": [
            "A",
            "B",
            "C"
        ],
        "flag": "多选题（4选项） / answer.length: 3"
    },
    {
        "title": "下列著作中特别深地铭刻在毛泽东心中并使他建立起对马克思主义信仰的有  (  )",
        "options": [
            "A) 《共产党宣言》",
            "B) 《阶级斗争》",
            "C) 《唯物主义解说》",
            "D) 《社会主义史》"
        ],
        "answer": [
            "A",
            "B",
            "D"
        ],
        "flag": "多选题（4选项） / answer.length: 3"
    },
    {
        "title": "五四运动的直接结果有 (  )",
        "options": [
            "A) 释放被捕学生",
            "B) 罢免亲日派官僚曹汝霖、章宗祥、陆宗舆",
            "C) 中国政府代表没有出席巴黎和约签字仪式",
            "D) 实现了反帝斗争目标"
        ],
        "answer": [
            "A",
            "B",
            "C"
        ],
        "flag": "多选题（4选项） / answer.length: 3"
    }
]
const chapter_five = [
    {
        "title": "大革命失败后，中国国内阶级关系发生变化，这主要是指（   ）",
        "options": [
            "A) 国共对峙取代了南北对峙",
            "B) 国民党新军阀统治取代了北洋军阀统治",
            "C) 民族资产阶级成为革命的对象",
            "D) 封建军阀已经被打倒"
        ],
        "answer": [
            "A"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "中国民主革命的基本问题（   ）",
        "options": [
            "A) 武装斗争问题",
            "B) 党的建设问题",
            "C) 统一战线问题",
            "D) 农民问题"
        ],
        "answer": [
            "D"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "中国革命历史上制定的第一个土地法是（   ）",
        "options": [
            "A) 兴国土地法",
            "B) 井冈山土地法",
            "C) 中国土地法大纲",
            "D) 土地问题"
        ],
        "answer": [
            "B"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "“因为中国资产阶级根本上与剥削农民的豪绅地主相联结相温和，中国革命要推翻豪绅地主阶级，便不能不同时推翻资产阶级。”这一观点的主要错误是（   ）",
        "options": [
            "A) 忽视了反对帝国主义的必要性",
            "B) 不承认中国资产阶级与地主阶级的区别",
            "C) 混淆了民主革命和社会主义革命的任务",
            "D) 未能区分中国资产阶级的两部分"
        ],
        "answer": [
            "C"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "下列事件中，没有共产国际代表直接参与的是（   ）",
        "options": [
            "A) 中国共产党成立",
            "B) 红军第五次反“围剿”",
            "C) 南昌起义",
            "D) 广州起义"
        ],
        "answer": [
            "C"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "第二次国内革命战争时期，中国共产党领导的土地革命取得胜利的根本保证是（   ）",
        "options": [
            "A) 制定了正确的土地革命路线",
            "B) 调动了一切反封建的因素",
            "C) 得到了广大农民的拥护",
            "D) 消灭了土地私有制"
        ],
        "answer": [
            "A"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "1928年召开的中共“六大”认为，民族资产阶级是最危险的敌人之一，国民党的各个派别都是一样的反革命。这一观点表明（   ）",
        "options": [
            "A) 大会仍未肃清“左”倾思想",
            "B) 中共着力纠正“左”倾思想",
            "C) 中共认清了革命的对象与动力",
            "D) 大会纠正了右倾主义路线"
        ],
        "answer": [
            "A"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "南昌起义、秋收起义、广州起义最重要的意义是（   ）",
        "options": [
            "A) 打响了反抗国民党统治的第一枪",
            "B) 建立了第一个苏维埃政权",
            "C) 中共开始有了独立武装力量",
            "D) 确立了党对军队的绝对领导"
        ],
        "answer": [
            "C"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "20世纪30年代，中国共产党内最早提出反对教条主义任务的领导人是（   ）",
        "options": [
            "A) 毛泽东",
            "B) 刘少奇",
            "C) 周恩来",
            "D) 张闻天"
        ],
        "answer": [
            "A"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "中国革命必须走农村包围城市最后夺取城市这样一条道路，主要取决于（   ）",
        "options": [
            "A) 中国农民人口多",
            "B) 中国革命的发展趋势",
            "C) 中国半殖民地半封建社会性质",
            "D) 敌人在农村力量薄弱"
        ],
        "answer": [
            "C"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "从1927年到1930年上半年，中国共产党领导的农村革命根据地和红军得到了迅速发展，其根本措施是（  ）",
        "options": [
            "A) 肃清右倾投降主义路线",
            "B) 工农武装割据波浪式推向全国",
            "C) 纠正“左”倾军事冒险计划",
            "D) 开展“打土豪、分田地”的土地革命"
        ],
        "answer": [
            "D"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "井冈山根据地的建立与巩固（   ）",
        "options": [
            "A) 开辟了农村包围城市武装夺取政权的道路",
            "B) 确立党对军队的绝对领导",
            "C) 是中共独立领导武装斗争的开端",
            "D) 是土地革命战争时期的开始标志"
        ],
        "answer": [
            "A"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "毛泽东实际上否定了“城市中心论”，确立了“以乡村为中心”的思想的文章是（   ）",
        "options": [
            "A) 《星星之火，可以燎原》",
            "B) 《中国的红色政权为什么能够存在》",
            "C) 《反对本本主义》",
            "D) 《井冈山的斗争》"
        ],
        "answer": [
            "A"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "确立党对人民军队的绝对领导这个根本原则是在（   ）",
        "options": [
            "A) 古田会议",
            "B) 三湾改编",
            "C) 《中国革命战争的战略问题》",
            "D) 《战争和战略问题》"
        ],
        "answer": [
            "A"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "南昌起义、秋收起义、广州起义中得出的深刻教训是（   ）",
        "options": [
            "A) 必须武装反抗国民党反动派",
            "B) 必须建立党对军队的绝对领导",
            "C) 必须建立新型的人民军队",
            "D) 走适合中国国情的革命道路"
        ],
        "answer": [
            "D"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "陈独秀的右倾投降主义和王明“左”倾冒险主义都给中国带来严重危害，这两次错误路线产生的根源在于（  ）",
        "options": [
            "A) 共产国际错误指导",
            "B) 错误领导人排挤毛泽东",
            "C) 中共处于幼年时期，理论思想尚不成熟",
            "D) 国民党分化破坏活动"
        ],
        "answer": [
            "C"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "30年代初，中国共产党在土地革命中建立起来的农村土地所有制实质上是（   ）",
        "options": [
            "A) 初步社会主义性质的所有制关系",
            "B) 劳动农民的集中土地公有制",
            "C) 苏维埃政权的土地公有制",
            "D) 劳动农民个体土地所有制"
        ],
        "answer": [
            "D"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "毛泽东在《中国的红色政权为什么能够存在》一文中提出了（   ）",
        "options": [
            "A) 以农村包围城市，武装夺取政权道路的理论",
            "B) 工农武装割据的思想",
            "C) 以乡村为中心的思想",
            "D) 实行党对军队绝对领导的原则"
        ],
        "answer": [
            "B"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "“共产党现时最主要的任务是有系统地有计划地尽可能在广大区域中准备农民总暴动……工人阶级应时刻领导并参加武装暴动。”上述中国共产党“八七”会议决议表明（   ）",
        "options": [
            "A) 中国共产党的工作重心由城市转入农村",
            "B) 中国共产党正式确立了工人阶级的领导地位",
            "C) 中国共产党确定了武装反抗国民党的方针",
            "D) 中国共产党的思想理论基础发生了根本变化"
        ],
        "answer": [
            "C"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "1927年下半年，中国革命呈现出的根本趋势是（    ）",
        "options": [
            "A) 中共的工作重心开始由城市转移到农村",
            "B) 中共发动武装起义夺取城市",
            "C) 中共发动了一系列罢工，反对国民党统治",
            "D) 中共党内出现了“左”倾机会主义错误"
        ],
        "answer": [
            "A"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "1927年南昌起义的最大意义在于（   ）",
        "options": [
            "A) 开始与国民党反动派武装对抗",
            "B) 确立党对军队的绝对领导",
            "C) 建立了第一个无产阶级革命政权",
            "D) 开创了“工农武装割据”的革命道路"
        ],
        "answer": [
            "A"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "中国工农红军“长征”的胜利是（   ）",
        "options": [
            "A) 不怕牺牲革命精神的胜利",
            "B) 革命乐观主义的胜利",
            "C) 艰苦奋斗革命精神的胜利",
            "D) 毛泽东思想的胜利"
        ],
        "answer": [
            "A",
            "B",
            "C",
            "D"
        ],
        "flag": "多选题（4选项） / answer.length: 4"
    },
    {
        "title": "下列关于“八七”会议的表述正确的是（    ）",
        "options": [
            "A) 纠正了陈独秀的右倾投降主义错误",
            "B) 会议确定土地革命和武装斗争的方针",
            "C) 毛泽东提出“政权是由枪杆子中取得的”",
            "D) 会议避免了“左”的错误"
        ],
        "answer": [
            "A",
            "B",
            "C"
        ],
        "flag": "多选题（4选项） / answer.length: 3"
    },
    {
        "title": "在新民主主义革命时期，中国共产党的建设面临的特殊困难是（   ）",
        "options": [
            "A) 党的理论长时期准备不足",
            "B) 中国社会封建思想的影响",
            "C) 农民和小资产阶级出身的革命者大量入党，使党处于小资产阶级思想的包围之中",
            "D) 共产国际在一段时期内存在的教条主义倾向对中国共产党的影响"
        ],
        "answer": [
            "A",
            "B",
            "C",
            "D"
        ],
        "flag": "多选题（4选项） / answer.length: 4"
    }
]
const chapter_six = [
    {
        "title": "抗日战争进入相持阶段后，日本帝国主义对国民党采取的方针是 （ 　）。",
        "options": [
            "A) 军事打击为主，政治诱降为辅",
            "B) 政治诱降为主，军事打击为辅",
            "C) 军事打击和政治诱降相结合",
            "D) 政治诱降取代军事进攻"
        ],
        "answer": [
            "B"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "百团大战的直接指挥者是（  ）",
        "options": [
            "A) 朱德",
            "B) 林彪",
            "C) 贺龙",
            "D) 彭德怀"
        ],
        "answer": [
            "D"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "确立毛泽东思想为全党的指导思想的会议是（  ）",
        "options": [
            "A) 遵义会议",
            "B) 瓦窑堡会议",
            "C) 洛川会议",
            "D) 中共七大"
        ],
        "answer": [
            "D"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "1939年，国民党制定“防共、限共、溶共、反共”方针的会议是（ ）",
        "options": [
            "A) 五届三中全会",
            "B) 五届四中全会",
            "C) 五届五中全会",
            "D) 五届六中全会"
        ],
        "answer": [
            "C"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "1937年8月，陕北红军奉命改编为国民革命军第八路军，其正、副总指挥分别是 (  )",
        "options": [
            "A) 朱德、彭德怀",
            "B) 叶挺、项英",
            "C) 朱德、刘伯承",
            "D) 朱德、贺龙"
        ],
        "answer": [
            "A"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "1937年8月，中国共产党制定《抗日救国十大纲领》的会议是（ ）",
        "options": [
            "A) 瓦窑堡会议",
            "B) 中共七大",
            "C) 洛川会议",
            "D) 中共扩大的六届六中全会"
        ],
        "answer": [
            "C"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "1935年8月1日，中共驻共产国际代表团发表(  )，呼吁一致抗日。",
        "options": [
            "A) 《停止内战一致抗日》",
            "B) 《为抗日救国告全体同胞书》",
            "C) 《停战议和一致抗日》",
            "D) 《反日反蒋的初步协定》"
        ],
        "answer": [
            "B"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "1927年日本召开“东方会议”，制定了（  ）",
        "options": [
            "A) 《对华政策纲要》",
            "B) 《昭和十二年度对华作战计划》",
            "C) 《反共产国际协定》",
            "D) 《大陆政策》"
        ],
        "answer": [
            "A"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "抗日战争进入相持阶段的时间是（   ）",
        "options": [
            "A) 1937年7月",
            "B) 1938年5月",
            "C) 1938年10月",
            "D) 1941年12月"
        ],
        "answer": [
            "C"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "（ ）标志着日本变中国为其独占殖民地的阶段由此开始。",
        "options": [
            "A) 甲午中日战争",
            "B) 日俄战争",
            "C) 九一八事变",
            "D) 七七事变"
        ],
        "answer": [
            "C"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "1935年12月,中共中央提出抗日民族统一战线的政策的会议是（ ）",
        "options": [
            "A) 洛川会议",
            "B) 瓦窑堡会议",
            "C) 八七会议",
            "D) 十二月会议"
        ],
        "answer": [
            "B"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "毛泽东明确地提出“马克思主义的中国化”这个命题是在中国共产党的（ ）",
        "options": [
            "A) 中共二大",
            "B) 中共七大",
            "C) 六届六中全会",
            "D) 八七会议"
        ],
        "answer": [
            "C"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "下列关于抗战历史意义的表述，不恰当的是（  ）",
        "options": [
            "A) 是中国人民近百年来第一次取得的反对帝国主义侵略斗争的完全胜利",
            "B) 增强了全国人民的自尊心和自信心",
            "C) 是世界反法西斯战争的重要组成部分",
            "D) 结束了中国半殖民地半封建社会的历史"
        ],
        "answer": [
            "D"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "抗日战争时期，中国共产党解决农民问题的基本政策是（  ）",
        "options": [
            "A) 土地国有",
            "B) 没收地主土地",
            "C) 减租减息",
            "D) 按人口平均分配土地"
        ],
        "answer": [
            "C"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "从1937年卢沟桥事变到1938年10月广州、武汉失守，中国抗日战争处于（ ）",
        "options": [
            "A) 战略防御阶段",
            "B) 战略相持阶段",
            "C) 战略反攻阶段",
            "D) 战略决战阶段"
        ],
        "answer": [
            "A"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "毛泽东在《论持久战》中分析交战的中日双方存在着相互矛盾的特点是(  )",
        "options": [
            "A) 敌强我弱；敌退步我进步；敌小国我大国；敌寡助我多助",
            "B) 抗日战争是持久战，最后胜利是中国的",
            "C) 战争要经过战略防御、战略相持、战略反攻三个阶段",
            "D) 中国是正义战争，日本是侵略战争"
        ],
        "answer": [
            "A"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "毛泽东论述新民主主义革命三大法宝的著作是 (  )",
        "options": [
            "A) 《中国革命和中国共产党》",
            "B) 《(共产党人)发刊词》",
            "C) 《新民主主义论》",
            "D) 《论持久战》"
        ],
        "answer": [
            "B"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "在淞沪会战中，（  ）率孤军据守四行仓库，被上海市民誉为“八百壮士”。",
        "options": [
            "A) 谢晋元",
            "B) 戴安澜",
            "C) 赵登禹",
            "D) 佟麟阁"
        ],
        "answer": [
            "A"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "促进中华民族觉醒,标志着中国人民抗日救亡运动新高潮到来的是（ ）",
        "options": [
            "A) 一二•九运动",
            "B) 五卅运动",
            "C) 五四运动",
            "D) 一二•一运动"
        ],
        "answer": [
            "A"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "全国抗战爆发后，国民党正面战场取得的第一个大的胜利是（ ）。",
        "options": [
            "A) 平型关战役",
            "B) 枣宜战役",
            "C) 豫湘桂战役",
            "D) 台儿庄战役"
        ],
        "answer": [
            "D"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "揭开全国性抗战序幕的是（ ）",
        "options": [
            "A) 一二八抗战",
            "B) 长城抗战",
            "C) 卢沟桥抗战",
            "D) 八一三抗战"
        ],
        "answer": [
            "C"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "在战略防御阶段,国民党军队在正面战场担负了抗击日军进攻的主要任务,国民党军队先后组织了一系列战役,主要有( ）",
        "options": [
            "A) 淞沪战役",
            "B) 忻口战役",
            "C) 徐州会战",
            "D) 武汉会战"
        ],
        "answer": [
            "A",
            "B",
            "C",
            "D"
        ],
        "flag": "多选题（4选项） / answer.length: 4"
    },
    {
        "title": "延安整风运动的主要内容是（ ）",
        "options": [
            "A) 反对主观主义以整顿学风",
            "B) 反对宗派主义以整顿党风",
            "C) 反对党八股以整顿文风",
            "D) 反对官僚主义以整顿浮夸风"
        ],
        "answer": [
            "A",
            "B",
            "C"
        ],
        "flag": "多选题（4选项） / answer.length: 3"
    },
    {
        "title": "伟大的抗战精神包括（ ）",
        "options": [
            "A) 天下兴亡、匹夫有责的爱国情怀",
            "B) 视死如归、宁死不屈的民族气节",
            "C) 不畏强暴、血战到底的英雄气概",
            "D) 百折不挠、坚忍不拔的必胜信念"
        ],
        "answer": [
            "A",
            "B",
            "C",
            "D"
        ],
        "flag": "多选题（4选项） / answer.length: 4"
    }
]
const chapter_seven = [
    {
        "title": "有人说：“民盟被迫解散，是民盟史上的一大挫折，但也正是民盟转变的起点。”这里“转变”的根本涵义指的是  (  )",
        "options": [
            "A) 由公开斗争转入地下斗争",
            "B) 由合法斗争转入武装斗争",
            "C) 站到新民主主义的立场并承认中国共产党的领导",
            "D) 对国共双方采取中立态度"
        ],
        "answer": [
            "C"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "毛泽东第一次公开使用“人民民主专政”概念的文献是（  ）",
        "options": [
            "A) 1948年9月中共中央政治会议的报告",
            "B) 《将革命进行到底》",
            "C) 七届二中全会报告",
            "D) 《论人民民主专政》"
        ],
        "answer": [
            "B"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "参加1945年8月重庆谈判的中共代表是：（   ）",
        "options": [
            "A) 毛泽东、叶剑英、秦邦宪",
            "B) 毛泽东、周恩来、王若飞",
            "C) 毛泽东、周恩来、王稼祥",
            "D) 毛泽东、叶剑英、张闻天"
        ],
        "answer": [
            "B"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "解放战争时期，国民党统治区人民民主运动高涨的根本原因是  (  )",
        "options": [
            "A) 中国共产党组织了反蒋统治的第二条战线",
            "B) 上海学生举行了声势浩大的“三反”斗争",
            "C) 国民党蒋介石集团的经济崩溃和政治危机",
            "D) 民主党派的联合斗争和人民起义遍及各地"
        ],
        "answer": [
            "C"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "1945年7月，与毛泽东谈到“其兴也悖焉，其亡也忽焉”周期率的人是 （   ）",
        "options": [
            "A) 郭沫若",
            "B) 黄炎培",
            "C) 陈铭枢",
            "D) 张治中"
        ],
        "answer": [
            "B"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "第二条战线是指  (   )",
        "options": [
            "A) 国统区民主党派的斗争",
            "B) 国统区广大人民的起义",
            "C) 国民党与共产党的军事对立",
            "D) 国统区的民主运动"
        ],
        "answer": [
            "D"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "千里跃进大别山的是  (  )",
        "options": [
            "A) 陈、谢率领的晋冀鲁豫解放军一部",
            "B) 陈、粟率领的华东解放军主力",
            "C) 刘、邓率领的晋冀鲁豫解放军主力",
            "D) 彭德怀率领的西北野战军主力"
        ],
        "answer": [
            "C"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "1949年蒋介石元旦“求和”声明的直接意图是  (  )",
        "options": [
            "A) 缓兵之计",
            "B) 屈服求和",
            "C) 划江而治",
            "D) 国共合作"
        ],
        "answer": [
            "A"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "国民政府解散民盟的真正原因是     (  )",
        "options": [
            "A) 民盟与共产党一起组织武装，共同参加人民解放战争",
            "B) 民盟企图推翻国民政府，取代国民党在中国的统治地位",
            "C) 民盟反对国民党的内战独裁",
            "D) 国民党发动的内战进展顺利，民盟已没有利用价值"
        ],
        "answer": [
            "C"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "抗日战争胜利后，某些民主党派的领导人物曾坚持“中间路线”，其实质是  (  )",
        "options": [
            "A) 介于国民党与共产党之间的第三势力",
            "B) 以实现政治民主化，军队国家化为目标",
            "C) 仿效西方民主，走旧民主主义的道路",
            "D) 反对暴力革命，主张和平改良"
        ],
        "answer": [
            "C"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "标志着国民党政权在大陆统治覆灭的重大事件是  (  )",
        "options": [
            "A) 1949年南京解放",
            "B) 1949年北平解放",
            "C) 1949年上海解放",
            "D) 1949年中共开国大典"
        ],
        "answer": [
            "A"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "解放战争时期，毛泽东提出十大军事原则的核心是（  ）",
        "options": [
            "A) 在运动中歼灭敌人",
            "B) 集中优势兵力，各个歼灭敌人",
            "C) 夺取中小城市和乡村",
            "D) 利用战争间隙休整部队"
        ],
        "answer": [
            "B"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "毛泽东明确而完整地提出建立新民主主义共和国方案的著作\n是（  ）",
        "options": [
            "A) 《&lt;共产党人&gt;发刊词》<!--共产党人--><!--共产党人-->",
            "B) 《论联合政府》",
            "C) 《新民主主义论》",
            "D) 《论人民民主专政》"
        ],
        "answer": [
            "C"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "抗战胜利后，美国帮助蒋介石将大后方的军队运送到内地，其直接目的是(  )",
        "options": [
            "A) 帮助蒋介石打内战",
            "B) 扶蒋反共",
            "C) 阻止共产党完全控制中国",
            "D) 在中国建立一个亲美反共政府"
        ],
        "answer": [
            "C"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "在1945年重庆谈判期间，我党粉碎国民党军队向我解放区进攻，促进了《双十协定》签订的战役是：（   ）",
        "options": [
            "A) 上党战役",
            "B) 苏北战役",
            "C) 鲁西南战役",
            "D) 邯郸战役"
        ],
        "answer": [
            "A"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "1947年，国民党战略进攻的重点是  (  )",
        "options": [
            "A) 全面进攻解放区",
            "B) 重点进攻山东和陕北解放区",
            "C) 抢占战略要地和交通线",
            "D) 集中兵力防守战略要地"
        ],
        "answer": [
            "B"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "1946年，全面内战爆发的标志是  (  )",
        "options": [
            "A) 国民党军进攻中原解放区",
            "B) 国民党军进攻延安",
            "C) 国民党限令撤销中共驻南京、上海、重庆代表",
            "D) 国民党军进攻陕北和山东解放区"
        ],
        "answer": [
            "A"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "解放战争时期制定的《中国土地法大纲》规定  (  )",
        "options": [
            "A) 实现土地国有",
            "B) 调整减租减息政策",
            "C) 按贫雇农人口分配土地",
            "D) 废除封建土地私有制"
        ],
        "answer": [
            "D"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "决定党的工作中心开始由乡村转入城市的会议是  (  )",
        "options": [
            "A) 十二月会议",
            "B) 中共七届二中全会",
            "C) 中国人民政治协商会议",
            "D) 全国土地会议"
        ],
        "answer": [
            "B"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "抗日战争胜利后国内的主要矛盾是（  ）",
        "options": [
            "A) 工人同农民的矛盾",
            "B) 工人阶级同资产阶级的矛盾",
            "C) 国民党反动集团同中国人民的矛盾",
            "D) 农民同资产阶级的矛盾"
        ],
        "answer": [
            "C"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "解放战争第二年的基本任务是  (  )",
        "options": [
            "A) 人民解放军转入战略反攻",
            "B) 同敌人进行战略决战",
            "C) 粉碎国民党军队的重点进攻",
            "D) 歼灭敌人的有生力量"
        ],
        "answer": [
            "A"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "下列事件发生在1947年的是  (  )",
        "options": [
            "A) 一·二一运动",
            "B) 民盟被解散",
            "C) 《中国土地法大纲》的制定",
            "D) 五二0运动"
        ],
        "answer": [
            "B",
            "C",
            "D"
        ],
        "flag": "多选题（4选项） / answer.length: 3"
    },
    {
        "title": "促使民主党派与蒋介石集团决裂，同中国共产党并肩战斗的原因有  (  )",
        "options": [
            "A) 国民党撕毁协议，发动全面内战",
            "B) 蒋介石非法召开“国民大会”，制定伪宪法",
            "C) 人民解放军转入进攻，国统区反蒋斗争高涨",
            "D) 三大战役胜利，全国解放在望"
        ],
        "answer": [
            "A",
            "B",
            "C"
        ],
        "flag": "多选题（4选项） / answer.length: 3"
    },
    {
        "title": "1945年重庆谈判前，中共中央提出的三大口号是  (  )",
        "options": [
            "A) 和平",
            "B) 民主",
            "C) 统一",
            "D) 团结"
        ],
        "answer": [
            "A",
            "B",
            "D"
        ],
        "flag": "多选题（4选项） / answer.length: 3"
    }
]
const chapter_eight = [
    {
        "title": "1949年中华人民共和国成立，标志着中国进入了（  ）",
        "options": [
            "A) 社会主义社会",
            "B) 新民主主义社会",
            "C) 资本主义社会",
            "D) 共产主义社会"
        ],
        "answer": [
            "B"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "1956年底社会主义制度在我国基本建立，这一结论的主要依据是（  ）",
        "options": [
            "A) 第一届全国人民代表大会召开",
            "B) 社会主义政治制度确立",
            "C) 第一个五年计划基本完成",
            "D) 公有制经济占主导地位"
        ],
        "answer": [
            "D"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "客观上宣告了“文化大革命”的理论和实践失败的是（  ）",
        "options": [
            "A) 中共九届二中全会的召开",
            "B) 各省市自治区革命委员会的成立",
            "C) 林彪反革命集团阴谋夺取最高权力. 策动反革命武装政变事件的发生",
            "D) 江青反革命集团加紧进行阴谋夺取最高权力的活动"
        ],
        "answer": [
            "C"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "毛泽东在中共八届九中全会上号召全党大兴调查研究之风，搞一个实事求是年，这一年是（  ）",
        "options": [
            "A) 1959年",
            "B) 1960年",
            "C) 1961年",
            "D) 1962年"
        ],
        "answer": [
            "C"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "毛泽东在《论十大关系》中提出的中国社会主义建设的基本方针是（  ）",
        "options": [
            "A) 不要四面出击",
            "B) 调整. 巩固. 充实. 提高",
            "C) 积极引导，稳步前进",
            "D) 调动一切积极因素为社会主义事业服务"
        ],
        "answer": [
            "D"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "1953年9月，彭德怀在一份报告中说，抗美援朝战争的胜利证明：西方侵略者几百年来只要在东方一个海岸上架起几尊大炮就可霸占一个国家的时代一去不复返了。这场战争的胜利（  ）",
        "options": [
            "A) 结束了西方列强霸权主义的历史",
            "B) 打破了美国军队不可战胜的神话",
            "C) 奠定了民族独立人民解放的基础",
            "D) 赢得了近代以来中华民族反抗外敌入侵的第一次完全胜利"
        ],
        "answer": [
            "B"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "1967年2月，谭震林等老一辈无产阶级革命家对“文化大革命”的错误做法提出了强烈的批评，却被江青等人诬蔑为（  ）",
        "options": [
            "A) “二月逆流”",
            "B) “三月逆流”",
            "C) “四月逆流”",
            "D) “六月逆流”"
        ],
        "answer": [
            "A"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "对农业进行社会主义改造的途径是（  ）",
        "options": [
            "A) 公私合营",
            "B) 合作化",
            "C) 国家资本主义",
            "D) 和平赎买"
        ],
        "answer": [
            "B"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "1961年我国对国民经济实行“调整. 巩固. 充实. 提高”的方针，主要是为了（  ）",
        "options": [
            "A) 克服严重的自然灾害",
            "B) 巩固“反右倾”斗争的成果",
            "C) 解决农副产品供应紧张问题",
            "D) 纠正“大跃进”运动的错误"
        ],
        "answer": [
            "D"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "国家实现独立富强的首要条件是（  ）",
        "options": [
            "A) 社会主义工业化",
            "B) 生产资料公有制",
            "C) 社会主义改造",
            "D) 发展资本主义经济"
        ],
        "answer": [
            "A"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "《人民日报》连续发表“人有多大胆，地有多大产”和“小麦亩产12万斤”. “皮棉亩产5000斤”. “一棵白菜500斤”等文章，宣传全国各地大放“卫星”这一现象发生在（  ）",
        "options": [
            "A) 建国初期",
            "B) 大跃进时期",
            "C) 文化大革命时期",
            "D) 改革开放新时期"
        ],
        "answer": [
            "B"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "1966~1976年给党和国家带来了深重灾难的运动是（  ）",
        "options": [
            "A) “文化大革命”",
            "B) “大跃进”运动",
            "C) 反右斗争",
            "D) 三大改造运动"
        ],
        "answer": [
            "A"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "1970年~1971年发生了（  ）阴谋夺取最高权力，策动反革命武装政变的事件",
        "options": [
            "A) 江青反革命集团",
            "B) 康生反革命集团",
            "C) 林彪反革命集团",
            "D) 姚文元反革命集团"
        ],
        "answer": [
            "C"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "中华人民共和国成立后，中国社会开始了（  ）",
        "options": [
            "A) 从旧民主主义向新民主主义的过渡",
            "B) 从资本主义向社会主义的过渡",
            "C) 从新民主主义向社会主义的过渡",
            "D) 从社会主义向共产主义的过渡"
        ],
        "answer": [
            "C"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "在中共八大上作《政治报告》的是 （  ）",
        "options": [
            "A) 毛泽东",
            "B) 刘少奇",
            "C) 周恩来",
            "D) 朱德"
        ],
        "answer": [
            "B"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "较早觉察到“大跃进”和人民公社化运动中出现尖锐问题并立即着手纠正的人是（  ）",
        "options": [
            "A) 毛泽东",
            "B) 刘少奇",
            "C) 彭德怀",
            "D) 邓小平"
        ],
        "answer": [
            "A"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "中国进入社会主义社会最主要的标志是（  ）",
        "options": [
            "A) 建立社会主义经济制度",
            "B) 建立社会主义政治制度",
            "C) 颁布《中华人民共和国宪法》",
            "D) 中华人民共和国成立"
        ],
        "answer": [
            "A"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "1950年，率领中国人民志愿军赴朝鲜，与朝鲜人民并肩反击美国侵略的司令员是（  ）",
        "options": [
            "A) 彭德怀",
            "B) 聂荣臻",
            "C) 刘伯承",
            "D) 贺龙"
        ],
        "answer": [
            "A"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "我国的根本政治制度是（  ）",
        "options": [
            "A) 民族区域自治制度",
            "B) 中国共产党领导的多党合作和政治协商制度",
            "C) 人民代表大会制度",
            "D) 基层社会管理制度"
        ],
        "answer": [
            "C"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "人民公社的基本特点是（  ）",
        "options": [
            "A) 政社合一",
            "B) 一大二公",
            "C) 高指标. 瞎指挥",
            "D) 浮夸风. 共产风"
        ],
        "answer": [
            "B"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "向全党提出实现马克思主义与中国实际“第二次结合”任务的是（  ）",
        "options": [
            "A) 毛泽东",
            "B) 周恩来",
            "C) 刘少奇",
            "D) 邓小平"
        ],
        "answer": [
            "A"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "我国在1951年底到1952年，开展的“三反”运动的内容是（  ）",
        "options": [
            "A) 反贪污",
            "B) 反浪费",
            "C) 反官僚主义",
            "D) 反冒险主义"
        ],
        "answer": [
            "A",
            "B",
            "C"
        ],
        "flag": "多选题（4选项） / answer.length: 3"
    },
    {
        "title": "《关于正确处理人民内部矛盾的问题》提出的两类不同性质的矛盾是（  ）",
        "options": [
            "A) 敌我之间的矛盾",
            "B) 人民内部的矛盾",
            "C) 中华民族同国际帝国主义的矛盾",
            "D) 社会主义同资本主义的矛盾"
        ],
        "answer": [
            "A",
            "B"
        ],
        "flag": "多选题（4选项） / answer.length: 2"
    },
    {
        "title": "“一五”时期到1976年，涌现出大量英雄模范人物，他们是（  ）",
        "options": [
            "A) 焦裕禄",
            "B) 孔繁森",
            "C) 王进喜",
            "D) 雷锋"
        ],
        "answer": [
            "A",
            "C",
            "D"
        ],
        "flag": "多选题（4选项） / answer.length: 3"
    }
]
const chapter_nine = [
    {
        "title": "《反分裂国家法》通过的时间是（ ）",
        "options": [
            "A) 十届全国人大一次会议",
            "B) 十届全国人大二次会议",
            "C) 十届全国人大三次会议",
            "D) 十届全国人大四次会议"
        ],
        "answer": [
            "C"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "（ ）提出构建社会主义和谐社会的战略任务",
        "options": [
            "A) 十六大",
            "B) 十六届三中全会",
            "C) 十六届四中全会",
            "D) 十六届五中全会"
        ],
        "answer": [
            "C"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "1978年12月13日，邓小平在中央工作会议闭幕会上发表讲话的题目是（ ）",
        "options": [
            "A) 《完整地准确地理解毛泽东思想》",
            "B) 《尊重知识，尊重人才》",
            "C) 《解放思想，实事求是，团结一致向前看》",
            "D) 《实现四化，永不称霸》"
        ],
        "answer": [
            "C"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "科学地评价了毛泽东和毛泽东思想的历史地位的会议是( )",
        "options": [
            "A) 中共十一届三中全会",
            "B) 中共十一届四中全会",
            "C) 中共十一届五中全会",
            "D) 中共十一届六中全会"
        ],
        "answer": [
            "D"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "1987年10月，中国共产党第十三次全国代表大会提出的党在社会主义初级阶段的基本路线被概括为（ ）",
        "options": [
            "A) “一个中心. 两个基本点”",
            "B) “一化三改”",
            "C) “一体两翼”",
            "D) “三步走”"
        ],
        "answer": [
            "A"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "（ ）成功开创了中国特色社会主义",
        "options": [
            "A) 以毛泽东同志为核心的党的第一代领导集体带领全党各族人民",
            "B) 以邓小平同志为核心的党的第二代领导集体带领全党各族人民",
            "C) 以江泽民同志为核心的党的第三代领导集体带领全党各族人民",
            "D) 以胡锦涛同志为核心的党的第四代领导集体带领全党各族人民"
        ],
        "answer": [
            "B"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "中国恢复在联合国的合法席位的时间是( )",
        "options": [
            "A) 1969年",
            "B) 1970年",
            "C) 1971年",
            "D) 1972年"
        ],
        "answer": [
            "C"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "中国社会主义改革开放和现代化建设的总设计师邓小平逝世于（ ）",
        "options": [
            "A) 1995年2月19日",
            "B) 1996年2月19日",
            "C) 1997年2月19日",
            "D) 1998年2月19日"
        ],
        "answer": [
            "C"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "1980年2月，中共十一届五中全会决定予以彻底平反并恢复名誉的党和国家领导人是（ ）",
        "options": [
            "A) 彭德怀",
            "B) 邓小平",
            "C) 薄一波",
            "D) 刘少奇"
        ],
        "answer": [
            "D"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "1989年6月，中共十三届四中全会选举的中共中央总书记是（ ）",
        "options": [
            "A) 胡耀邦",
            "B) 赵紫阳",
            "C) 李鹏",
            "D) 江泽民"
        ],
        "answer": [
            "D"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "“三个代表”重要思想写入党章的时间是（ ）",
        "options": [
            "A) 十五大",
            "B) 十六大",
            "C) 十七大",
            "D) 十八大"
        ],
        "answer": [
            "B"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "坚持四项基本原则,最核心的是坚持( )",
        "options": [
            "A) 人民民主专政",
            "B) 中国共产党的领导",
            "C) 毛泽东思想",
            "D) 社会主义道路"
        ],
        "answer": [
            "B"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "1992年6月9日，江泽民在中央党校省部级干部进修班上发表的讲话，明确提出的一个重要论断是（ ）",
        "options": [
            "A) 创新的关键在人才",
            "B) “社会主义市场经济体制”",
            "C) 充分保证人民依法享受人权",
            "D) “高增长，低通胀”"
        ],
        "answer": [
            "B"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "1992年召开的中共十四大明确提出，我国经济体制改革的目标是建立（ ）",
        "options": [
            "A) 社会主义市场经济体制",
            "B) 社会主义有计划商品经济体制",
            "C) 计划为主，市场为辅的经济体制",
            "D) 市场为主，计划为辅的经济体制"
        ],
        "answer": [
            "A"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "中国共产党在社会主义初级阶段的基本路线是“一个中心. 两个基本点” 其中“一个中心”是指以( )为中心",
        "options": [
            "A) 政治建设",
            "B) 文化建设",
            "C) 经济建设",
            "D) 社会建设"
        ],
        "answer": [
            "C"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "1992年，以邓小平南方谈话和中共十四大为标志，中国社会主义改革开放和现代化建设事业所进入的新的发展阶段是（ ）",
        "options": [
            "A) 从计划经济体制向多种经济体制转变",
            "B) 从多种经济体制向单一经济体制转变",
            "C) 从计划经济体制向社会主义市场经济体制转变",
            "D) 从新民主主义经济体制向社会主义市场经济体制转变"
        ],
        "answer": [
            "C"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "1982年9月在中国共产党第十二次全国代表大会开幕词中，邓小平明确提出的重大命题是（ ）",
        "options": [
            "A) 坚持四项基本原则",
            "B) 发展社会主义市场经济",
            "C) 建设有中国特色社会主义",
            "D) 没有民主就没有社会主义"
        ],
        "answer": [
            "C"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "党的第一个关于精神文明建设的纲领性文件是（ ），为我国精神文明建设的健康发展提供了基本指导方针",
        "options": [
            "A) 《全民科学素质行动计划纲要》",
            "B) 《新时代公民道德实施纲要》",
            "C) 《公民道德实施纲要》",
            "D) 《中共中央关于社会主义精神文明建设指导方针的决议》"
        ],
        "answer": [
            "D"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "邓小平提出中国社会主义农业的发展会有两个飞跃，第一个飞跃是废除人民公社，实行家庭联产承包为主的责任制，第二个飞跃是（ ）",
        "options": [
            "A) 发展集体经济",
            "B) 发展个体经济",
            "C) 发展国有经济",
            "D) 发展合作经济"
        ],
        "answer": [
            "A"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "1992年10月，中国共产党第十四次全国代表大会确立的在全党具有指导地位的理论是（ ）",
        "options": [
            "A) 邓小平建设有中国特色社会主义理论",
            "B) 社会主义初级阶段理论",
            "C) 社会主义市场经济理论",
            "D) 社会主义改革开放理论"
        ],
        "answer": [
            "A"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "1977年8月召开的，宣告“文化大革命”结束，又继续肯定“文化大革命”的错误理论和实践的全国代表大会是（ ）",
        "options": [
            "A) 中共十大",
            "B) 中共十一大",
            "C) 中共二十大",
            "D) 中共十三大"
        ],
        "answer": [
            "B"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "中共十三大的理路成果和规划包括（ ）",
        "options": [
            "A) 社会主义初级阶段理论",
            "B) 党的基本路线",
            "C) 建设有中国特色的社会主义理论",
            "D) 制定了“三步走”战略"
        ],
        "answer": [
            "A",
            "B",
            "D"
        ],
        "flag": "多选题（4选项） / answer.length: 3"
    },
    {
        "title": "关于真理标准问题讨论的论述正确的有（  ）",
        "options": [
            "A) 坚持了“两个凡是”的方针",
            "B) 重新确立了实事求是的思想路线",
            "C) 为改革开放做了思想理论准备",
            "D) 标志改革开放的开始"
        ],
        "answer": [
            "B",
            "C"
        ],
        "flag": "多选题（4选项） / answer.length: 2"
    },
    {
        "title": "在政治体制改革方面，干部队伍建设实行下列哪些？",
        "options": [
            "A) 革命化",
            "B) 年轻化",
            "C) 知识化",
            "D) 专业化"
        ],
        "answer": [
            "A",
            "B",
            "C",
            "D"
        ],
        "flag": "多选题（4选项） / answer.length: 4"
    },
    {
        "title": "中共十一届三中全会的意义有（ ）",
        "options": [
            "A) 否定了“以阶级斗争为纲”的指导思想",
            "B) 中国开始进入改革开放时期",
            "C) 形成了有中国特色的社会主义建设理论",
            "D) 形成了以邓小平为核心的党的中央领导集体"
        ],
        "answer": [
            "A",
            "B",
            "D"
        ],
        "flag": "多选题（4选项） / answer.length: 3"
    },
    {
        "title": "根据科学发展观，发展应该是包括下列哪几点的发展？ ( )",
        "options": [
            "A) 全面的",
            "B) 协调的",
            "C) 迅速的",
            "D) 可持续的"
        ],
        "answer": [
            "A",
            "B",
            "D"
        ],
        "flag": "多选题（4选项） / answer.length: 3"
    },
    {
        "title": "下列哪些是经济体制改革的重大举措？",
        "options": [
            "A) 家庭联产承包责任制",
            "B) 政社合一",
            "C) 扩大国有企业经营自主权",
            "D) 政企分开"
        ],
        "answer": [
            "A",
            "C",
            "D"
        ],
        "flag": "多选题（4选项） / answer.length: 3"
    },
    {
        "title": "“三个代表”重要思想的概念是（ ）",
        "options": [
            "A) 代表中国先进生产力的发展要求",
            "B) 代表中国先进文化的前进方向",
            "C) 代表中国工人阶级的根本利益",
            "D) 代表中国最广大人民的根本利益"
        ],
        "answer": [
            "A",
            "B",
            "D"
        ],
        "flag": "多选题（4选项） / answer.length: 3"
    }
]
const chapter_ten = [
    {
        "title": "( )是推进全面依法治国的根本保证.",
        "options": [
            "A) 党的领导",
            "B) 人民当家作主",
            "C) 社会和谐稳定",
            "D) 经济社会发展"
        ],
        "answer": [
            "A"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "确立习近平新时代中国特色社会主义思想的历史地位是在（ ）",
        "options": [
            "A) 党的十六大",
            "B) 党的十七大",
            "C) 党的十八大",
            "D) 党的十九大"
        ],
        "answer": [
            "D"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "( ）是最大的民生。",
        "options": [
            "A) 卫生",
            "B) 教育",
            "C) 就业",
            "D) 三农问题"
        ],
        "answer": [
            "C"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "党的十九大报告指出:“中国特色社会主义进入新时代,我国社会主要矛盾已经转化为人民日益增长的美好生活需要和（ ）的发展之间的矛盾。”",
        "options": [
            "A) 不平衡",
            "B) 不平衡不全面",
            "C) 不充分",
            "D) 不平衡不充分"
        ],
        "answer": [
            "D"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "中国特色社会主义的总依据是( ）",
        "options": [
            "A) 中国梦的提出",
            "B) 全面建成小康社会",
            "C) 社会主义初级阶段",
            "D) 全面建设社会主义现代化国家"
        ],
        "answer": [
            "C"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "（ ）是“四个全面”战略布局中具有突破性和先导性的关键环节。",
        "options": [
            "A) 全面建成小康社会",
            "B) 全面深化改革",
            "C) 全面依法治国",
            "D) 全面从严治"
        ],
        "answer": [
            "B"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "中国共产党作为马克思主义政党，其最大的政治优势是（ ）.",
        "options": [
            "A) 一切从实际出发",
            "B) 理论联系实际",
            "C) 密切联系群众",
            "D) 批评与自我批评"
        ],
        "answer": [
            "C"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "中国特色社会主义最本质的特征是（）.",
        "options": [
            "A) 共同富裕",
            "B) 中国共产党的领导",
            "C) 社会主义市场经济",
            "D) 现代化建设"
        ],
        "answer": [
            "B"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "实现（ ）不仅是经济问题，而且是关系中国共产党的执政基础的重大政治问题。",
        "options": [
            "A) 民族复兴",
            "B) 人民幸福",
            "C) 社会和谐",
            "D) 共同富裕"
        ],
        "answer": [
            "D"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "( )是党的基础性建设.",
        "options": [
            "A) 思想建设",
            "B) 组织建设",
            "C) 政治建设",
            "D) 作风建设"
        ],
        "answer": [
            "A"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "实现“两个一百年”奋斗目标、实现中华民族伟大复兴的中国梦，不断提高人民生活水平,必须坚定不移把(  ）作为党执政兴国的第一要务。",
        "options": [
            "A) 创新",
            "B) 改革",
            "C) 发展",
            "D) 开放"
        ],
        "answer": [
            "C"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "从( ）开局之年开始，我国开启全面建设社会主义现代化国家新征程.",
        "options": [
            "A) “十二五”",
            "B) “十三五”",
            "C) “十四五”",
            "D) “十五五”"
        ],
        "answer": [
            "C"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "( )，习近平先后提出共建“丝绸之路经济带”和“21世纪海上丝\n绸之路”的重大倡议。",
        "options": [
            "A) 2015年9月和10月",
            "B) 2014年9月和 10月",
            "C) 2013年9月和10月",
            "D) 2012年9月和10月"
        ],
        "answer": [
            "C"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "中共十八届四中全会通过的《中共中央关于全面推进依法治国若干重大问题的决定》提出,全面推进依法治国,总目标是（ ）",
        "options": [
            "A) 建设中国特色社会主义法治体系,建设社会主义法治国家",
            "B) 建设中国特色社会主义法治体系,建设社会主义法制国家",
            "C) 建设中国特色社会主义法制体系,建设社会主义法制国家",
            "D) 建设中国特色社会主义法制体系,建设社会主义法治国家"
        ],
        "answer": [
            "A"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "全面深化改革的总目标是完善和发展中国特色社会主义制度,推进国家治理体系和治理能力( )",
        "options": [
            "A) 合理化",
            "B) 信息化",
            "C) 现代化",
            "D) 科学化"
        ],
        "answer": [
            "C"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "（ ）是“四个全面”战略布局的根本保证，是党的十八大以来党中央抓党的建设的鲜明主题。",
        "options": [
            "A) 全面建成小康社会",
            "B) 全面深化改革",
            "C) 全面依法治国",
            "D) 全面从严治党"
        ],
        "answer": [
            "D"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "我国经济已由（ ）阶段转向（ ）阶段,正处在转变发展方式、优化经济结构、转换增长动力的攻关期,建设现代化经济体系是跨越关口的迫切要求和我国发展的战略目标。",
        "options": [
            "A) 高速增长 &nbsp; &nbsp;高水平发展",
            "B) 高速发展 &nbsp; 高水平发展",
            "C) 高速增长 &nbsp; 高质量发展",
            "D) 高速发展 &nbsp; 高质量发展"
        ],
        "answer": [
            "C"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "到2035年，中国将基本实现(  )",
        "options": [
            "A) 社会主义现代化",
            "B) 社会主义现代化强国",
            "C) 社会主义发达国家水平",
            "D) 社会主义科技强国"
        ],
        "answer": [
            "A"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    },
    {
        "title": "与西方国家现代化有根本不同，我国的现代化是社会主义现代化，（ ）是\n本质要求.",
        "options": [
            "A) 民族复兴",
            "B) 人民幸福",
            "C) 社会和谐",
            "D) 共同富裕"
        ],
        "answer": [
            "D"
        ],
        "flag": "单选题（4选1） / answer.length: 1"
    }
]
const chapter_one_to_ten = [
    ...chapter_one,
    ...chapter_two,
    ...chapter_three,
    ...chapter_four,
    ...chapter_five,
    ...chapter_six,
    ...chapter_seven,
    ...chapter_eight,
    ...chapter_nine,
    ...chapter_ten
]